{
  "ADA": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: ADA",
      "In Wormwiring: ADALh, ADARh, ADALm, ADARm",
      "In Nemanode: ADA"
    ],
    "In Wormbase": "ADA, ADAL, ADAR",
    "Lineage": "AB plapaaaapp, AB prapaaaapp",
    "Location": "Cell bodies are located on the lateral sides of the head, at the level of the second bulb of the pharynx.",
    "Description": "Integrative ring interneurons. Each ADA neuron process travels within the deirid commissure to enter the retrovesicular ganglion neuropil. This process then travels anteriorly to the nerve ring where it runs dorsally near the center of the ring neuropil. It meets its contralateral partner at the dorsal midline and makes gap junctions with it.",
    "Neurotransmitter/Neuropeptide": [
      "Glutamate",
      "Possibly FLP-8, a FMRFamide-like peptide",
      "PDF-1; pigment dispensing factor homolog",
      "(Loer and Rand, 2022; Janssen et al., 2009; Li and Kim, 2008; Lee et al.,1999)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-7",
      "INX-10a (only in dauer)",
      "INX-12",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": "Unknown",
    "Function": "Unknown. However, topological cluster analyses suggest ADA may be involved in chemosensation (Sohn et al., 2011).",
    "Reporters": [
      "At CGC:",
      "Others:"
    ]
  },
  "ADE": {
    "Type": "Sensory neuron (mechanosensory, possible pheromone-sensory)",
    "Connectivity": [
      "In MoW: ADE",
      "In Wormwiring: ADELh, ADERh, ADELm, ADERm",
      "In Nemanode: ADE"
    ],
    "In Wormbase": "ADE, ADEL, ADER",
    "Lineage": "AB plapaaaapa, AB prapaaaapa",
    "Location": "Located laterally in the head, behind the second bulb of the pharynx.",
    "Description": "Anterior deirids. The sensillar branch from the dorsal process of each ADE neuron follows a dorsal and frequently posterior trajectory ending laterally within the lateral alae in the anterior third of the body. See Deirids. The dorsal process enters the nerve ring laterally and runs anteriorly through the ring neuropil, making small synapses to other neurons. The ventral process of each neuron runs through the deirid commissure to enter the retrovesicular ganglion. It then runs anteriorly and enters the ventral ganglion where it crosses over to the opposite side and runs posteriorly for a short distance.",
    "Neurotransmitter/Neuropeptide": [
      "Dopamine",
      "PDF-1; pigment dispensing factor homolog",
      "(Loer and Rand, 2022; Janssen et al., 2009; Sulston et al., 1975)",
      "Innexin expression: - CHE-7 - INX-1a - INX-1b - INX-7 - UNC-9 (Altun et al., 2009; Bhattacharya et al., 2019) Receptor expression: - DOP-2; dopamine receptor - EXP-1; excitatory, cation-selective GABA receptor - TRP-4; pore-forming subunit of a mechanosensitive TRPN channel",
      "TYRA-3; tyramine receptor",
      "Possibly ACR-16; nicotinic acetylcholine receptor",
      "(Wormbase; Altun, 2011; Wragg et al., 2007; Feng et al., 2006; Kahn-Kirby and Bargmann, 2006; Li et al., 2006; Beg and Jorgensen, 2003; Suo et al., 2003)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "DOP-2; dopamine receptor",
      "EXP-1; excitatory, cation-selective GABA receptor",
      "TRP-4; pore-forming subunit of a mechanosensitive TRPN channel"
    ],
    "Function": [
      "ADEL/R are dopaminergic nose touch mechanoceptors. They modulate locomotion behavior in response to the presence of food by textural mechanosensation, wherein upon encountering a lawn of bacteria (or Sephadex G-200 beads) worms slow their forward movement. The three classes of ciliated dopaminergic neurons (CEPs,ADEs, and PDEs) function redundantly in this behavior (i.e. sensing the mechanosensory stimuli during crawling through bacteria (or the beads) and communicating with the motor circuit to bring about the locomotory change) (Sawin et al., 2000). Another form of motor plasticity related to food presence is area restricted search (ARS). CEP and PDE neurons work synergistically to mediate this behavior while ADE modulates it (Hills et al., 2004).",
      "Anterior harsh touch sensation: Laser ablation of FLP, AQR, ADE results in a significant reduction of anterior harsh touch sensation, while laser ablation of BDU, SDQR, FLP, ADE and AQR eliminates it (Li et al., 2011).",
      "Possibly pheromone sensation: The complete pheromone (a mixture composed of derivatives of the dideoxysugar ascarylose (ascarosides) insensitivity of the tax-2(p694) mutant suggests that this defect is due to a site of action in one or more of the AFD, ASE, ADE, or BAG neurons, since the tax-2(p694) mutation eliminates expression of the TAX-2 subunit from these, but has normal expression and function in the other seven neurons that express this channel (Aillion and Thomas, 2000)."
    ],
    "Reporters": [
      "At CGC: BZ555egIs1[dat-1p::GFP]. Also expressed in CEP, PDE, R5A, R7A, R9A in males.",
      "Other: BY200"
    ]
  },
  "ADF": {
    "Type": "Sensory neuron (chemosensory (gustatory), oxygen-sensory)",
    "Connectivity": [
      "In MoW: ADF",
      "In Wormwiring: ADFLh, ADFRh, ADFLm, ADFRm",
      "In Nemanode: ADF"
    ],
    "In Wormbase": "ADF, ADFL, ADFR",
    "Lineage": "AB alpppppaa, AB praaappaa",
    "Location": "Lateral ganglia in the head",
    "Description": "Amphid neurons, with dual (AdF) ciliated sensory endings which are exposed to the external environment. Like all other amphid neurons, ADF are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7, secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub (Heiman and Shaham, 2010). Dendritic process takes up FITC. Each ADF axon travels through the amphid commissure to enter the ventral cord. From there, it travels anteriorly to enter the nerve ring. After running dorsally within the nerve ring, it meets its contralateral partner at the dorsal midline and makes a gap junction with it.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "Serotonin",
      "FLP-6; FMRFamide-like peptide",
      "INS-1; insulin-like peptide",
      "NLP-3; neuropeptide-like peptide",
      "(Pereira et al., 2015; Loer and Rand, 2022; Li and Kim, 2008; Kodama et al., 2006; Nathoo et al., 2001; Sze et al., 2000; Duerr et al.,1999)"
    ],
    "Innexin expression": [
      "CHE-7 (in early larva)",
      "INX-10a",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019; Chuang et al., 2007)"
    ],
    "Receptor expression": [
      "MGL-3; metabotropic glutamate receptor family protein",
      "NPR-5; receptor for flp-3 and flp-18 encoded peptides",
      "OSM-9; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)",
      "OCR-2; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)",
      "SRB-6 (faint); G protein-coupled seven transmembrane receptor",
      "SRD-1 (in male); G protein-coupled seven transmembrane receptor",
      "TMC-1; putative cation channel, salt-sensing receptor",
      "(Wormbase; Chatzigeorgiou et al., 2013; Altun, 2011; Cohen et al., 2009; Greer et al., 2008; Tobin et al., 2002; Colbert et al., 1997; Troemel et al.,1995)"
    ],
    "Function": [
      "ADFL/R are the only serotonergic sensory neurons in the hermaphrodite worm (in males, ray sensory neurons 1B, 3B and 9B are also serotonergic) and may couple environmental food signals with serotonin neurotransmission (Jafari et al., 2011)",
      "They contribute to a residual chemotactic response to cAMP, biotin, Cl-, and Na+ after ASE is killed (Bargmann and Horvitz, 1991). C. elegans shows chemoattraction to low NaCl. This is mediated by four pairs (ADF, ASE, ASG and ASI) of amphid sensory neurons, of which the ASE cells are most important. However, under hypoxic conditions, an additional, latent circuit involving ADF and ASG is activated for processing this chemosensory information (Pocock and Hobert, 2010).C. elegans also shows avoidance of NaCl concentrations above 200 mM which is thought to be due to a general avoidance of high osmotic strength (mainly mediated by the ASH sensory neurons). However, this response to salt is plastic, involving a balance between attraction and avoidance, i.e., balances between ASE, ASI, ASH, ADF and perhaps ADL neuron (Hukema et al, 2006).",
      "Control entry into dauer stage; ADF, ASI and ASG inhibit entry into dauer stage while ASJ and ASK promote dauer entry (Kim et al., 2009; Ouellett et al., 2008; Schackwitz et al., 1996; Bargmann and Horvitz, 1991).",
      "Function as part of the oxygen-sensing network (which also includes URX, AQR, PQR, SDQ, ALN, PLN, ADL, and ASH) by promoting hyperoxia avoidance. ADF pair stimulates aerotaxis in the absence of food by producing serotonin (Chang et al., 2006).",
      "Modulate NMJ neurotransmission; serotonin functions as a neuromodulator by inhibiting and enhancing synaptic transmission of other neurotransmitters; e. g. studies have revealed both stimulatory and inhibitory serotonin inputs to the NMJs. Aldicarb, an inhibitor of acetylcholinesterase, causes paralysis in C. elegans due to accumulation of acetylcholine (ACh) at the locomotory NMJs, but exogenous serotonin inhibits paralysis induced by aldicarb. By contrast, exogenous serotonin does not reduce the paralysis induced by levamisole, a specific agonist of the nicotinic ACh receptor UNC-29 in the bodywall muscles. This suggests that serotonin signaling inhibits ACh release by the motor neurons. Studies showed that the inhibitory and stimulatory serotonin signals to NMJ neurotransmission arise from distinct serotonergic neurons; endogenous serotonin released from the ADF neurons stimulates ACh synaptic transmission at the NMJs, whereas serotonin from the NSM/RIH/AIM neurons inhibits the stimulatory serotonin inputs (Govorunova et al., 2010)."
    ],
    "Reporters": [
      "At CGC: GR1333yzIs71 [tph-1p::GFP + rol-6(su1006)] also labels NSM, GR1366mgIs42 [tph-1::GFP + rol-6(su1006)] also labels NSM, NC3604myls13 [klp-6p::GFP], oyIs51 [srh-142::RFP], also labels IL2s with GFP (Sze et al., 2000).",
      "Other:"
    ]
  },
  "ADL": {
    "Type": "Sensory neuron (chemosensory, odorsensory, pheromone-sensory, nociceptive)",
    "Connectivity": [
      "In MoW: ADL",
      "In Wormwiring: ADLLh, ADLRh, ADLLm, ADLRm",
      "In Nemanode: ADL"
    ],
    "In Wormbase": "ADL, ADLL, ADLR",
    "Lineage": "AB alppppaad, AB praaapaad",
    "Location": "Lateral ganglia in the head",
    "Description": "Amphid neurons, dual (AdL) ciliated sensory endings. Like all other amphid neurons, ADL are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7, secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub (Heiman and Shaham, 2010). Dendritic process takes up FITC. Each ADL axon enters the nerve ring from the lateral side directly and runs both dorsally and vertrally within the ring. The dorsal branch meets its contralateral partner at the midline and makes a gap junction with it. Sister cells of ADL neurons undergo apoptosis.",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "FLP-4; FMRFamide-like neuropeptide",
      "FLP-21; FMRFamide-like neuropeptide",
      "NLP-7; neuropeptide-like peptide",
      "NLP-8; neuropeptide-like peptide",
      "NLP-10; neuropeptide-like peptide",
      "(Li and Kim, 2008; Rogers et al., 2003; Nathoo et al., 2001; O. Hobert, pers. comm.)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-18a",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019; Chuang et al., 2007; Liu et al., 2006)"
    ],
    "Receptor expression": [
      "GCY-21; transmembrane receptor guanylate cyclase",
      "OSM-9; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)-cation selective",
      "OCR-1; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)",
      "OCR-2; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)",
      "SER-6; octopamine receptor",
      "SRB-6; G protein-coupled seven transmembrane receptor",
      "SRE-1; G protein-coupled seven transmembrane receptor",
      "SRH-132; G protein-coupled seven transmembrane receptor",
      "SRH-220; G protein-coupled seven transmembrane receptor",
      "SRI-51; G protein-coupled seven transmembrane receptor",
      "SRO-1; G protein-coupled seven transmembrane receptor",
      "TMC-1; putative cation channel, salt-sensing receptor",
      "(Wormbase; Chatzigeorgiou et al., 2013; Mills et al., 2012; Altun, 2011; Tobin et al., 2002; de Bono et al., 2002; Colbert et al., 1997; Troemel et al., 1995)"
    ],
    "Function": [
      "ASH, ADL, ASK and ASE sensory neurons are responsible for the detection of certain chemical repellents. ASH plays a major role in this avoidance, whereas ADL, ASK and ASE play minor roles that are only evident when ASH is missing (de Bono and Maricq, 2005; Hiliard et al., 2002; Sambongi et al., 1999; Bargmann et al., 1990). ADL mediate avoidance behavior from heavy metals (Cd++ and Cu++)(Sambongi et al., 1999), odors (e.g. octanol) (Troemel et al., 1995), high osmotic strength and SDS.",
      "Balances between at least four sensory cell types, ASE, ASI, ASH, ADF and perhaps ADL, modulate the response to NaCl(Hukema et al, 2006).",
      "ASH and ADL are proposed to mediate social feeding behavior in response to repulsive cues (e.g. high O2 levels); ablation of ASH and ADL abolishes social feeding behavior transforming social animals to solitary feeders; avoidance of high O2 levels that facilitate aggregation is promoted by OCR-2 and OSM-9, and the transmembrane protein ODR-4, acting in the nociceptive neurons ASH and ADL. ASH and ADL, in turn, transmit information about aversive stimuli in the environment to a circuit that is responsible for aggregation, rapid locomotion, and food bordering behavior (Rogers et al., 2006; de Bono et al., 2002).",
      "Sense pheromone and are involved in behavioral responses to pheromone (C. elegans pheromone is a mixture composed of derivatives of the dideoxysugar ascarylose [C3, C6, C7, C9 and other ascarosides] that regulates entry to dauer stage at L1, as well as adult behaviors such as sexual attraction of males to hermaphrodites and social behavior, i.e., attraction between hermaphrodites to clump into feeding groups) (Jang et al., 2012; Lockery, 2009; Macosco et al., 2009)."
    ],
    "Reporters": [
      "At CGC: OH14884otIs646 [srh-127p::GFP + pha-1(+)] (Masoudi et al., 2018).",
      "Other:"
    ]
  },
  "AFD": {
    "Type": "Sensory neuron (thermosensory and CO2- sensory)",
    "Connectivity": [
      "In MoW: AFD",
      "In Wormwiring: AFDLh, AFDRh, AFDLm, ADFRm",
      "In Nemanode: AFD"
    ],
    "In Wormbase": "AFD, AFDL, AFDR",
    "Lineage": "AB alpppapav, AB praaaapav",
    "Location": "Lateral ganglia in the head",
    "Description": "Amphid neurons with finger-like (AfD) ciliated endings embedded in the amphid sheath cell. Like all other amphid neurons, AFD are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7, secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub (Heiman and Shaham, 2010). Each AFD axon travels through the amphid commissure to enter the ventral cord. From there, it travels anteriorly to enter the nerve ring. After running dorsally within the nerve ring, it meets its contralateral partner at the dorsal midline and makes a gap junction with it",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "FLP-6; FMRFamide-like neuropeptide",
      "NLP-7; neuropeptide-like peptide",
      "NLP-21; neuropeptide-like peptide",
      "Possibly PDF-1; pigment dispensing factor homolog",
      "(Barrios et al, 2012;Ohnishi et al, 2011; Loer and Rand, 2022; Li and Kim, 2008; Rogers et al., 2003; Nathoo et al., 2001)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-19",
      "UNC-7",
      "(Altun et al., 2009; Bhattacharya et al., 2019; Chuang et al., 2007; Liu et al., 2006)"
    ],
    "Receptor expression": [
      "GCY-8; transmembrane receptor guanylate cyclase (cGMP production in AFD is redundantly carried out by GCY-8, GCY-18 and GCY-23 and gcy-23, gcy-8, and gcy-18 triple mutants show a cryophilic or athermotactic phenotype(Inada et al., 2006)",
      "GCY-18; transmembrane receptor guanylate cyclase",
      "GCY-23; transmembrane receptor guanylate cyclase",
      "GCY-29; transmembrane receptor guanylate cyclase",
      "TMC-1; putative cation channel, salt-sensing receptor",
      "(Wormbase; Chatzigeorgiou et al., 2013; Ortiz et al., 2006; Inada et al., 2006; Yu et al., 1997)"
    ],
    "Function": [
      "Functions in thermotaxis: AFD neurons are the main thermosensors in C. elegans and laser ablation of the AFD pair makes most animals athermotactic (Ma and Shen, 2012; Beverly et al, 2011; Kuhara et al, 2008; Satterlee et al., 2004; Mori and Ohshima, 1995). After cultivation at a uniform temperature (Tc) with sufficient food, animals preferentially migrate to their cultivation temperature (Tc) when placed on a thermal gradient, and move isothermally at this temperature (Hedgecock and Russell, 1975). Animals sense and memorize their Tc by AFD (major thermosensory), AWC and ASI neurons (Beverly et al, 2011; Kuhara et al., 2008; Biron et al., 2008). This memory is plastic and can be reset upon cultivation at a different temperature (Hedgecock and Russell, 1975). To track isotherms, animals do not actively pursue isothermal alignment, but once serendipitously aligned along an isotherm (at T=Tc), they track by suppressing turns (Luo et al., 2006).The animal increases its reversal and turn frequency when it detects a rise in temperature and it moves back down the gradient toward Tc (negative thermotaxis). AFD neurons respond to thermal stimuli above Tc with continuous, graded calcium signals due to a Ca++ influx via cGMP-dependent TAX-2/TAX-4 cation channels. The AFD, AWC and ASI neurons may act in concert to increase turning rate when animals encounter higher temperatures (Biron et al., 2008). The thermal information is transmitted by AFD and AWC to AIY interneurons for information processing, and AIY neurons, in turn, transmit it to AIZ and RIA interneurons for further processing. It is suggested that activation of AFD neurons by warming above Tc induces the animal to reverse by inhibiting AIY since loss of AFD (by ablation) suppresses spontaneous reversals in an AIY-dependent manner, while loss of AIY (by ablation) increases spontaneous reversals (de Bono and Maricq 2005; Tsalik and Hobert, 2003). G-protein-coupled receptor (GPCR) SRTX-1 is required both in AFD and AWC for retaining normal isothermal tracking (Liu et al., 2012).",
      "In addition to sensing temperature within the viable range (~15-25oC), AFD neurons also take part in sensing noxious temperatures (thermonociception) (~35-38oC). Noxious temperatures induce a temperature avoidance response with reflex-like escape reaction. FLP neurons in the head and PHC neurons in the tail also act as thermonociceptive neurons. This avoidance response requires the cell autonomous function of TAX-2, TAX-4 in AFD, and the heat- and capsaicin-sensitive transient receptor potential vanilloid (TRPV) channels, OCR-2/OSM-9 in the FLP and PHC neurons. In sensing ambient temperature, cGMP production in AFD is through GCY-23, GCY-8 and GCY-18, while for noxious heat sensation cGMP production in AFD is mainly through GCY-12. Noxious temperature avoidance via AFD involves AIB interneuron (Liu et al., 2012).",
      "Functions in locomotion: Laser ablations of AFD cause hyporeversal phenotype (Tsalik and Hobert, 2003).",
      "AFD, BAG and ASE are primary CO2 sensors, while oxygen-sensing neurons AQR, PQR and URX are also weakly CO2 responsive. AFD and BAG neurons together stimulate turning when CO2 rises and inhibit turning when CO2 falls (Bretscher et al., 2011).",
      "May be involved in social feeding since disruption of tax-2 expression in AFD, AQR, ASE and BAG neurons disrupts social feeding (Coates and de Bono, 2002)."
    ],
    "Reporters": [
      "At CGC: PY1157 oyls17 [gcy-8p::GFP + lin-15(+)].",
      "Other:"
    ]
  },
  "AIA": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AIA",
      "In Worm Wiring: AIAL h, AIAR h, AIALm, AIAR m - In Nemanode: AIA"
    ],
    "In Wormbase": "AIA, AIAL, AIAR",
    "Lineage": "AB plppaappa, AB prppaappa",
    "Location": "Ventral ganglion in the head",
    "Description": "Ring interneurons. AIAL and AIAR are located anteriorly to the excretory cell, at the ventral side of the terminal bulb of pharynx. They are located very close to each other on the right and left sides of the A-P midline. The process of each AIA neuron enters the nerve ring from the ventral side, runs dorsally and meets its contralateral partner at the dorsal midline and makes a gap junction with it.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "FLP-1; FMRFamide-like neuropeptide",
      "FLP-2; FMRFamide-like neuropeptide",
      "INS-1; insulin-like peptide. Important in the neuropeptide feedback loop between AWC and AIA. (Chalasani et al., 2010; Li and Kim, 2008; Altun-Gultekin et al., 2001; Nelson et al., 1998)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b - INX-10a",
      "INX-14 (only in dauer)",
      "INX-19",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-2; AMPA-type ionotropic (Na+/K+) glutamate receptor subunit",
      "GLC-3; L-glutamate-gated chloride channel subunit (ionotropic glutamate rec subunit). AWC-AIA synapse is an inhibitory, glutamatergic synapse via GLC-3, whose function is acutely modulated by NLP-1/NPR-11 signaling",
      "GCY-28; transmembrane receptor guanylate cyclase",
      "MGL-1; group II metabotropic glutamate receptor",
      "NPR-5; receptor for FLP-18 peptides",
      "NPR-11; candidate receptor for NLP-1",
      "SCD-2; ALK receptor tyrosine kinase",
      "SRA-11; G protein-coupled seven transmembrane receptor",
      "(Wormbase; Altun, 2011; Shinkai et al, 2011; Chalasani et al., 2010; Glauser and Goodman, 2010; Greer et al, 2008; Altun-Gultekin et al., 2001; Brockie et al., 2001)"
    ],
    "Function": [
      "Integration of information from amphid sensory neurons; AIA pair is one of the four (AIA, AIB, AIY, and AIZ) first layer amphid interneuron pairs that receive and process synaptic output from the amphid sensory neurons towards a behavioral response. AIA pair is suggested to sum inputs from various chemosensory neurons before passing the information on to AIB pair, which synapses onto motor neurons (AIA-AIB connections are likely to be inhibitory) (Wakayabashi et al., 2004). AIA neurons are the main target of ASI outputs.",
      "AIA interneurons integrate multiple sensory cues to adjust behavioral choices and play an important role in learning (e.g. salt chemotaxis learning) and behavioral plasticity (Shinkai et al, 2011; Tomioka et al., 2006)",
      "Functions in locomotion: in isothermal tracking, AIB and AIZ interneurons promote turns while AIY and AIA interneurons inhibit turns (Garrity et al., 2010)",
      "The AIA neurons play a role in chemotaxis to ascarosides, downstream of the ASK sensory neuron (Srinivasan et al., 2012, Macosko et al., 2009)"
    ],
    "Reporters": [
      "At CGC:",
      "Other: MT25268 nsIs840 [Pgcy-28.d::gfp] (Saul et al., 2022)"
    ]
  },
  "AIB": {
    "Type": "Interneuron",
    "Connectivety": [
      "In MoW: AIB",
      "In WormWiring: AIBLh, AIBRh, AIBLm, AIBRm",
      "In Nemanode: AIB"
    ],
    "In Wormbase": "AIB, AIBL, AIBR",
    "Lineage": "AB plaapappa, AB praapappa",
    "Location": "Lateral ganglia in the head",
    "Description": "Amphid interneurons. The process of each AIB neuron travels through the amphid commissure to enter the ventral cord. From there, it travels anteriorly to enter the nerve ring. The process then runs dorsally and after making a brief anterior turn at the midline, it runs round the nerve ring. It reenters the ventral cord on the other side and ends within the ventral ganglion.",
    "Neurotransmitter/ Neuropeptide": [
      "Betaine",
      "Glutamate",
      "FLP-20; FMRFamide-like neuropeptide",
      "(Wang et al., 2024; Pereira et al., 2015;Li and Kim, 2008)"
    ],
    "Innexin expression": [
      "INX-1",
      "INX-2",
      "INX-6 (only in dauer)",
      "INX-7",
      "INX-10a",
      "INX-18a",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-1; glutamate-activated cation channel",
      "GLR-2; glutamate-activated cation channel",
      "Possibly GLR-5; kainate (non-NMDA)-type ionotropic glutamate receptor",
      "Possibly GGR-1; GABA-A/glycine receptor-like protein",
      "Possibly MGL-2; metabotropic glutamate receptor",
      "(Wormbase; Fujiwara et al., 1996; Maricq et al., 1995; Brockie et al., 2001; Kang and Avery, 2009; O. Hobert, pers. comm.)"
    ],
    "Function": [
      "Integration of information from amphid sensory neurons; AIBL/R is one of the four first layer amphid interneuron pairs (AIA, AIB, AIY, and AIZ) that receives and processes synaptic output from the amphid sensory neurons. AIA pair is suggested to sum inputs from various chemosensory neurons before passing the information on to AIB pair, which synapses onto motor neurons (AIA-AIB connections are likely to be inhibitory) (Wakayabashi et al., 2004).",
      "Functions in locomotion: Among the interneurons, AIA and AIY inhibit turns, AIB and RIA does not affect turning rates (Garrity et al., 2010; Wakayabashi et al., 2004).",
      "Functions in information processing within the AWC-AIB-AIY circuit that controls food- and odor-evoked behaviors(Chalasani et al., 2007). After animals are removed from bacterial food, they initiate a local search behavior consisting of reversals and deep omega-shaped turns. This is followed by dispersal ~30 min later, as reversals and turns are suppressed. Local search behavior is triggered by AWC olfactory neurons, ASK gustatory neurons, and AIB interneurons while dispersal is promoted by ASI gustatory neurons and AIY interneurons (Gray et al., 2005). AWC neurons are activated by odor removal and activate the AIB interneurons through AMPA-type glutamate receptors, while they inhibit AIY interneurons through glutamate-gated chloride channels; odor presentation relieves this inhibition and results in activation of AIY interneurons. The opposite regulation of AIY and AIB interneurons generates a coordinated behavioral response.",
      "Regulates lifespan and starvation response (starvation induces heat-shock resistance, oxidative stress resistance and extension of life-span). Certain amino acids (such as leu, gln, ala, val, ile) might act as signaling molecules that modulate the starvation response by acting as anti-hunger signals. The amino acid signal activates AIY neurons and inhibits AIB neurons by modulating the activities of MGL-1 and MGL-2 metabotropic glutamate receptors, respectively. AIY then inhibits the starvation response, whereas AIB activates it (Shen et al, 2010; Kang and Avery, 2009)."
    ],
    "Reporters": [
      "At CGC:",
      "Other: ZQ281 lin-15B&lin-15A(n765) X; zwEx101[inx-1p::GFP + lin-15(+)] (Altun et al., 2009)"
    ]
  },
  "AIM": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AIM",
      "In WormWiring: AIMLh, AIMRh, AIMLm, AIMRm",
      "In Nemanode: AIM"
    ],
    "In Wormbase": "AIM, AIML, AIMR",
    "Lineage": "AB plpaapppa, AB prpaapppa",
    "Location": "Ventral ganglion in the head",
    "Description": "Ring interneurons bridging sensory inputs and command outputs. Excessive neurites that connect AIML and AIMR early in development are pruned during larval stages (along with RIF, they are the only other neuron pair that is subject to developmental neurite pruning in C. elegans) (Hayashi et al., 2009; Kage et al., 2005). The process of each AIM neuron enters the nerve ring from the ventral side. After running dorsally within the nerve ring, it meets its contralateral partner at the dorsal midline and makes a gap junction with it.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine - only in males after L4",
      "Glutamate - sexually dimorphic expression; in hermaphrodites AIMs are glutamatergic and serotonergic. In males, they are glutamatergic and serotonergic until L3. During L4 they become cholinergic and serotonergic",
      "Serotonin - may be absorbing and then releasing rather than synthesizing serotonin",
      "FLP-10; FMRFamide-like peptide",
      "FLP-22; FMRFamide-like peptide",
      "INS-1; insulin-like peptide",
      "PDF-1; pigment dispensing factor homolog",
      "(Pereira et al., 2015; Barrios et al, 2012; Loer and Rand, 2022; Li and Kim, 2008; Sze et al., 2000; Duerr et al., 1999)"
    ],
    "Innexin expression": [
      "CHE-7 (only in dauer)",
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-19",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GCY-18; guanylate cyclase",
      "(Wormbase; Ortiz et al., 2006)"
    ],
    "Function": [
      "Serotonin secreted by both synaptic vesicles and dense core vesicles seem to diffuse readily to the extrasynaptic space adjacent to the AIM and RIH neurons. Among 5 classes (NSM, ADF, HSN, AIM, RIH) of serotonergic neurons, RIH and AIM mainly take up serotonin from outside (produced by the remaining serotonergic neurons) via the membrane serotonin transporter (MOD-5/SERT), rather than synthesizing it themselves (Jafari et al., 211).",
      "RIH and AIM possibly function as temporal–spatial regulators of extrasynaptic serotonin to modulate the activity of the behavioral circuits. In Caenorhabditis elegans, serotonin signaling is required for coupling feeding and the memory of prior food availability to the rate of locomotion. Following food deprivation, wild-type animals show markedly decreased locomotion on their return to a lawn of bacterial food. While serotonin-deficient mutants exhibit less slowing response (become insensitive), mutants of mod-5/SERT exaggerate the slowing response (become hypersensitive). Transgenic expression of mod-5/SERT in the serotonin-absorbing neurons fully corrects this exaggerated behavior, suggesting AIM and RIH regulate the availability of serotonin for neurotransmission (Jafari et al., 2011).",
      "Function in swim initiation; behaviorally, ablation of VC-4, VC-5, AIM, or NSM neurons delays swim onset, implicating serotonin signaling in this behavior (Vidal-Gadea et al., 2011)",
      "They are part of the neuronal circuit that functions in mate-searching behavior of males(Barrios et al, 2012)"
    ],
    "Reporters": [
      "At CGC: OH12503otIs520 [eat-4(prom11)::GFP + ttx-3::mCherry] X. AIM is marked only with GFP, not mCherry. Can be used to isolate AIM by FACS. Used by CeNGEN project for RNA-Seq cengen.org.",
      "Other:"
    ]
  },
  "AIN": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AIN",
      "In WormWiring: AINLh, AINRh, AINLm, AINRm",
      "In Nemanode: AIN"
    ],
    "In Wormbase": "AIN, AINL, AINR",
    "Lineage": "AB alaaaalal, AB alaapaaar",
    "Location": "Lateral ganglia in the head",
    "Description": "Ring interneurons. The process of each AIN neuron enters the nerve ring subdorsally and after crossing the dorsal midline, runs round the nerve ring on the opposite side. After entering the ventral cord on the contralateral side, it ends within the ventral ganglion.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "FLP-19; FMRFamide-like peptide",
      "(Although earlier reports suggested AIN might be glutamatergic, more recent studies showed it is not) (Pereira et al., 2015; Serrano-Saiz et al., 2013; Loer and Rand, 2022; Li and Kim, 2008; Lee et al., 1999)."
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-2 (plasticity in non-dauer)",
      "INX-8",
      "INX-10a",
      "INX-14",
      "INX-17",
      "INX-19 (only in dauer)",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": "Unknown",
    "Function": "Function in cold tolerance downstream of ASG(Takagaki et al., 2020).",
    "Reporters": [
      "At CGC: OH16151 ynIs34 [flp-19p::GFP] IV. otEx7424 [lgc-35p::tagRFP + pha-1(+)]. Marked with both GFP &RFP.",
      "Other:"
    ]
  },
  "AIY": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AIY",
      "In WormWiring: AIYLh, AIYRh, AIYLm, AIYRm",
      "In Nemanode: AIY"
    ],
    "In Wormbase": "AIY, AIYL, AIYR",
    "Lineage": "AB plpapaaap, AB prpapaaap",
    "Location": "Ventral ganglion in the head",
    "Description": "Amphid interneurons. The process of each AIY neuron enters the nerve ring from the ventral side. After running dorsally within the nerve ring, it meets its contralateral partner at the dorsal midline and makes a gap junction with it.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "FLP-1; FMRFamide-like peptide",
      "FLP-18; FMRFamide-like peptide",
      "(Li and Kim, 2008; Rogers et al., 2003; Altun-Gultekin et al., 2001)"
    ],
    "Innexin expression": [
      "INX-1",
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-18a",
      "INX-18b",
      "INX-19",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019; Chuang et al., 2007)"
    ],
    "Receptor expression": [
      "ACR-14; nicotinic AChR alpha subunit",
      "C50F7.1; tachykinin receptor-like",
      "CKR-2; cholecystokinin receptor-like",
      "GAR-2; muscarinic AChR"
    ],
    "Function": [
      "AIYL/R is one of the four first layer amphid interneuron pairs (AIA, AIB, AIY, and AIZ) that receive and process synaptic output from the amphid sensory neurons. They are postsynaptic to several olfactory and gustatory sensory neurons, such as ASE, ASI, AWA, AWC and AFD, and are presumed to play an integrative role, processing multiple streams of sensory information. They have a key role in behavioral plasticity in paradigms in which starvation is paired with a thermal or chemical cue (de Bono and Maricq, 2005; Ishihara et al., 2002).",
      "Functions in thermotaxis; laser ablation of the AIY pair makes the animals cryophilic and impaired in isothermal tracking (Mori and Ohshima, 1995). The thermal information sensed by AFD, AWC and ASI is processed in downstream interneurons AIY, AIZ, RIA (thermotaxis core interneurons) and also likely in AIA and AIB(Ma and Shen, 2012; Sasakura and Mori, 2012; Ardiel and Rankin, 2011; Beverly et al, 2011). In the original two-drive model of thermotaxis, activation of AIY neuron-signaling drives warm-seeking (thermophilic) movement, activation of AIZ neuron-signaling drives cold-seeking (cryophilic) movement, while the counterbalancing between the AIY and AIZ signals, possibly through the RIA interneuron, leads to execution of motor output in response to thermal signals (Ohnishi et al, 2011; Kuhara et al, 2008). AIY is the major postsynaptic partner of AWC and AFD. AWC-derived glutamatergic signals stimulate AIY and induce migration to warmer temperature (Ohnishi et al, 2011). AFD transmits both inhibitory and stimulatory signals to AIY such that calcium concentration threshold in AFD acts as a switch for opposing neural signals to AIY that direct opposite (warm- or cold-seeking) behaviors (Kuhara et al., 2011). AFD-derived glutamatergic signals inhibit AIY through activation of GLC-3 glutamate-gated chloride channel and drive migration towards colder temperature. Recent studies suggest this AFD/AIY synapse may have evolved for reliable transmission of a scaled-down temperature signal from AFD, enabling AIY to monitor and integrate temperature with other sensory inputs (Narayan et al, 2011). The molecular mechanism of the stimulatory signaling between AFD and AIY is currently unknown.",
      "Functions in locomotion: Suppresses turns and reversals enhancing smooth forward movements and dispersal, since laser ablation of AIY increases reversals and turns, disrupts dispersal behavior and shortens forward movements (Gray et al., 2005; Wakayabashi et al., 2004 ; Tsalik and Hobert, 2003). Similar to AIY, laser ablation of ASE or AIA increases the frequency of reversals while ablation of AWC, AIB or AIZ decreases the frequency of reversals (ablation of RIA does not affect turning rate). Since ablation of AIY and AIZ (the major postsynaptic partner of AIY) causes opposite behavioral phenotpes, the synapses made by AIY onto AIZ may be inhibitory. Alternatively, signals fom AIY to AIZ are processed in a downstream neuron such as RIA(de Bono and Maricq 2005).",
      "Functions in information processing within the AWC-AIB-AIY circuit that controls food- and odor-evoked behaviors(Chalasani et al., 2007).AWC neurons are activated by food or odor removal and activate the AIB interneurons through AMPA-type glutamate receptors, while they inhibit AIY interneurons through glutamate-gated chloride channels; odor presentation relieves this inhibition and results in activation of AIY interneurons. The opposite regulation of AIY and AIB interneurons generates a coordinated behavioral response.",
      "Regulates lifespan and starvation response (starvation induces heat-shock resistance, oxidative stress resistance and extension of life-span). Certain amino acids (such as leu, gln, ala, val, ile) might act as signaling molecules that modulate the starvation response by acting as anti-hunger signals. The amino acid signal activates AIY neurons and inhibits AIB neurons by modulating the activities of MGL-1 and MGL-2 metabotropic glutamate receptors in these neurons, respectively. AIY then inhibits the starvation response, whereas AIB activates it (Shen et al, 2010; Kang and Avery, 2009)."
    ],
    "Reporters": [
      "At CGC: OH99mgIs18 [ttx-3p::GFP] IV",
      "Other:"
    ]
  },
  "AIZ": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AIZ",
      "In WormWiring: AIZLh, AIZRh, AIZLm, AIZRm",
      "In Nemanode: AIZ"
    ],
    "In Wormbase": "AIZ, AIZL, AIZR",
    "Lineage": "AB plapaaapav, AB prapaaapav",
    "Location": "Lateral ganglia in the head",
    "Description": "Ring Interneurons. The process of each AIZ neuron travels through the amphid commissure to enter the ventral cord. From there, it travels anteriorly to enter the nerve ring. After running dorsally within the nerve ring, it meets its contralateral partner at the dorsal midline and makes a gap junction with it.",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "FLP-22; FMRFamide-like neuropeptide",
      "(Loer and Rand, 2022; Li and Kim, 2008; Lee et al., 1999)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "SER-2; tyramine receptor (expresses two separate splice variants)",
      "(Altun, 2011; Tsalik et al., 2003)"
    ],
    "Function": "Integration of information from amphid sensory neurons; AIZL/R is one of the four (AIA, AIB, AIY, and AIZ) first-layer amphid interneuron pairs that receive and process synaptic output from the amphid sensory neurons towards a behavioral response. Along with the second-layer RIA and RIB interneurons, AIZ neurons also receive heavy input from the first layer AIA, AIB, AIY interneurons and they themselves send outputs to RIA and RIB. Additionally, AIZ synapse directly onto SMB head motor neurons. - Functions in thermotaxis; Along with AIY and RIA, AIZ are thermotaxis core interneurons (Sasakura and Mori, 2012). Laser ablation of the AIZ pair makes the animals thermophilic. The thermal information sensed by AFD, AWC, and ASI is processed in downstream interneurons AIY, AIZ, RIA, and also likely in AIA and AIB. In the original two-drive model of thermotaxis, activation of AIY neuron-signaling drives warm-seeking (thermophilic) movement, activation of AIZ neuron-signaling drives cold-seeking (cryophilic) movement, while the counterbalancing between the AIY and AIZ signals, possibly through the RIA interneuron, leads to execution of motor output in response to thermal signals. However, there is evidence that a thermophilic drive at temperatures below cultivation temperature (Tc) does not exist and regulation of thermotaxis involves a more complex circuit. Around Tc animals track isothermally on a gradient and above Tc they display negative thermotaxis by regulating their turning frequency and run duration. It has been suggested that thermosensory signals from AFD, AWC, and ASI converge on the AIB interneuron in negative thermotaxis, whereas the AIY/AIZ/RIA network may function mainly in isothermal tracking (Ma and Shen, 2012; Sasakura and Mori, 2012; Ardiel and Rankin, 2011; Beverly et al, 2011; Ohnishi et al, 2011; Kuhara et al, 2008; Ryu and Samuel, 2002; Mori and Ohshima, 1995). During associative learning between temperature and feeding state, starvation, a conditioning factor, downregulates AIZ activity through calcineurin/TAX-6, a calcium-activated phosphatase, leading to avoidance from Tc (Kuhara and Mori, 2006). - Functions in locomotion: Laser ablation of AIZ, like AIB and AWC, causes decrease in reversals and leads to large increases in the duration of forward movement. Since ablations of AIY and AIZ cause opposite behavioral phenotpes, the synapses made by AIY onto AIZ may be inhibitory. Alternatively, signals fom AIY to AIZ could be processed in a downstream neuron such as RIA (Iino and Yoshida, 2009; de Bono and Maricq 2005; Tsalik and Hobert, 2003). - Functions in chemotaxis: Laser ablation of AIZ causes defects in the weathervane (slow turning of the animal by biased head swing) and pirouette (bout of sharp turns generated by frequent reversals followed by omega turns) responses (see Nervous System-General Description) leading to impaired chemotaxis (Iino and Yoshida, 2009). Reporters: - At CGC: - Other:",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "ALA": {
    "Type": "Interneuron, mechanosensory neuron",
    "Connectivity": [
      "In MoW: ALA",
      "In WormWiring: ALAh, ALAm,",
      "In Nemanode: ALA"
    ],
    "In Wormbase": "ALA",
    "Lineage": "AB alapppaaa",
    "Location": "Dorsal ganglion of the head",
    "Description": "ALA neuron has two processes that branch from the anterior portion of the cell body and project into the left and right sides of the nerve ring. A third, short process enters the dorsal cord and then peters out. The two large processes run on the left and rights sides of the ring and then leave the ring to join the lateral cords. They extend as far as the tail, adjacent to the excretory canals.",
    "Neurotransmitter/ Neuropeptide": [
      "FLP-7; FMRFamide-like peptide",
      "(Li and Kim, 2008)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-10a",
      "INX-14",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "ACR-13 (LEV-8)",
      "ACR-4 (DES-2)",
      "SRA-10",
      "(Wormbase; Altun, 2011; Van Buskirk and Sternberg, 2010; Towers et al., 2005; Troemel et al., 1995)"
    ],
    "Function": [
      "Involved in inducing normal lethargus quiescence (i.e., cessation of pharyngeal pumping and locomotion during the lethargus periods [an EGF/LET-23-induced sleep-like state prior to molts]). ALA neuron inhibits locomotion by inhibiting AVE, which normally functions to promote locomotion. Synapse between ALA and AVE is contacted by the CEPsh glia and CEPsh cells inhibit synaptic transmission from ALA to AVE, promoting locomotion.",
      "(Van Buskirk and Sternberg, 2007)",
      "ALA is a high-threshold mechanosensor, which responds to harsh mechanical stimuli, e.g.with a pick, mechanical stimuli and is involved in inhibition of egg-laying in response to these stimuli. It doesn't respond to light touch. Also, its physiological responses to anterior vs posterior touch are distinct suggesting it can distinguish between spacially separated stimuli. Its laterally placed long processes are required for this harsh-touch response.",
      "(Sanders et al., 2013)"
    ],
    "Reporters": [
      "At CGC: BL5717 inIs179 [ida-1p::GFP]; him-8(e1489) IV. Also expressed in ADE, ALA, ASI, ASK, AUA, ASG, AVH, AVJ, AVK, VC, HSN, PDE, PVP, PHA, PHB, PHC.",
      "Other:"
    ]
  },
  "ALM": {
    "Type": "Sensory neuron (mechanosensory)",
    "In MoW": "ALM",
    "In WormWiring": "ALMLh, ALMRh, ALMLm, ALMRm",
    "In Wormbase": "ALM, ALML, ALMR",
    "Lineage": "AB arppaappa, AB arpppappa",
    "Location": "Lateral in mid-body",
    "Description": "Anterior lateral microtubule cells. After they are born in the embryo, ALM neurons move from the anterior edge of the intestine to midway within the anterior body. ALML/R are among the 6 non-ciliated touch receptor neurons (TRN) that extend long, 15-protofilament microtubule (MT)-filled neurites in close apposition to the hypodermis and cuticle. Although MTs attach to the membrane at multiple sites, they likely do not gate the mechanosensory channels directly, since the ends of the MTs do not co-localize with the mechanosensory channels. The specialized extracellular matrix,",
    "Neurotransmitter/Neuropeptide": [
      "Glutamate",
      "FLP-20; FMRFamide-like neuropeptide",
      "(Loer, 2010; Li and Kim, 2008; Tsalik et al., 2003; Lee et al., 1999)"
    ],
    "Innexin expression": [
      "INX-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": [
      "ASIC-1; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit)- part of a mechanosensory transduction channel",
      "DEG-3; alpha subunit of nicotinic acetylcholine receptor",
      "DEL-1; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit). - part of a mechanosensory transduction channel",
      "DES-2; alpha subunit of nicotinic acetylcholine receptor",
      "DEGT-1; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit). - part of a mechanosensory transduction channel",
      "DOP-1; D1-like dopamine receptor",
      "GLR-8; ionotropic glutamate receptor subunit (unclassifiable as NMDA or non-NMDA)",
      "GAB-1; GABA receptor beta-like subunit",
      "LGC-37; ligand-gated ion channel (human GABA A receptor gamma 2 (GABRG2) ortholog)",
      "LGC-55; ligand-gated ion channel",
      "MEC-2; stomatin-like protein required to sense touch, part of a mechanotransduction channel complex that senses low-threshold stimuli (gentle body touch)",
      "MEC-4; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit). - part of a mechanosensory transduction channel - core component of a mechanosensory transduction channel that senses low-threshold stimuli (gentle body touch)",
      "MEC-6; part of the degenerin/epithelial Na+channel complex - interacts physically with the MEC-4 degenerin ion channel",
      "MEC-9; provides an extracellular attachment point for the mechanosensory channels in touch cells",
      "MEC-10; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit). - part of a mechanosensory transduction channel - core component of a mechanosensory transduction channel that senses low-threshold stimuli (gentle body touch)",
      "PDFR-1; pigment dispersing factor (PDF-1) receptor",
      "STR-33; seven TM receptor",
      "TYRA-2; tyramine receptor",
      "(Wormbase; Barrios et al., 2012; Altun, 2011; Topalidou and Chalfie, 2011; Chatzigeorgiou et al., 2010; Sanyal et al., 2004; Tsalik et al., 2003; Chelur et al., 2002; Brockie et al., 2001; Treinin. et al., 1998; Du et al., 1996; Lai et al., 1996; Huang et al., 1995; Treinin and Chalfie, 1995; Huang and Chalfie, 1994)",
      "Function:",
      "Along with AVM and PLM, ALM neurons sense gentle (low threshold) mechanical stimulus to the body and provide input to the command (inter) neurons (PVC, AVB, AVD, AVA) via both synaptic connections and gap junctions (see mechanosensory circuit in C.elegans Book II and circuit for escape response in Pirri and Alkema, 2011). The touch cells form gap junctions with agonist interneurons and chemical synapses with the antagonist interneurons (see locomotory circuit). Hence, in the neural circuit of the escape response, the anterior touch cells ALML/R and AVM form gap junctions with the backward movement interneuron AVD, but they provide (inhibitory) synaptic input to the forward movement interneurons AVB and PVC(Goodman, 2006; Chalfie et al.,1985; Kaplan and Driscoll, 1997)",
      "ALM neurons also respond to harsh (high threshold) touch. Although the gentle touch response requires MEC-4, and is also largely dependent on MEC-10, the harsh touch response is MEC-4-independent and requires MEC-10 (degenerin) and DEGT-1(Suzuki et al., 2003; Chatzigeorgiou et al., 2010)",
      "Along with other TRNs, ALM neurons are involved in memory formation for habituation to tap response both for massed training with 12-hr memory retention and spaced training with 48-hr memory retention (Li et al., 2013). Long-term memory for tap habituation requires protein synthesis, the transcription factor CREB and the AMPA-type glutamate receptor subunit GLR-1 in the postsynaptic AVA and AVD interneurons of the tap withdrawal circuit, while 12-hr memory is correlated with a FLP-20-dependent increase of synaptic vesicles in the terminals of the PLM mechanosensory neurons and likely other TRNs (Timbers and Rankin, 2011; Li et al., 2013)"
    ]
  },
  "ALN": {
    "Type": "Sensory neuron (minor oxygen-sensory)",
    "Connectivity": [
      "In MoW: ALN",
      "In WormWiring: ALNLh, ALNRh, ALNLm, ALNRm",
      "In Nemanode: ALN"
    ],
    "In Wormbase": "ALN, ALNL, ALNR",
    "Lineage": "AB plapappppap, AB prapappppap",
    "Location": "Tail",
    "Description": "Neurons associated with ALM, send processes into tailspike.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "FLP-34",
      "(Fadda et al., 2020; Loer and Rand, 2022; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "CHE-7 (in early larva)",
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-3",
      "INX-7",
      "INX-10a",
      "INX-11 (only in dauer)",
      "INX-14",
      "INX-18a",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "DOP-1; D1-like dopamine receptor",
      "SER-2; tyramine receptor",
      "LGC-55; ligand-gated ion channel (tyramine-gated chloride channel)",
      "(Wormbase; Altun, 2011; Pirri et al., 2009; Tsalik et al., 2003)"
    ],
    "Function": "Soluble guanylate cyclase (sGC, e.g. GCY-35 and GCY-36)-expressing oxygen-sensing neurons (URX, AQR, PQR, SDQ, BDU, ALN, and PLN) mediate the avoidance of high O2 levels (Zimmer et al, 2009). URX appears to be the most important member of this group, since its activity is uniquely important for aggregation (Coates and de Bono, 2002), while for aerotactic behavior in an O2 gradient, URX is redundant with other sGC-expressing neurons (Chang et al., 2006).",
    "Reporters": [
      "At CGC: OH11738otIs439 [lad-2p::GFP + pha-1(+)], not exclusive to ALN (Gordon and Hobert, 2015)",
      "Other: uIs129 [lad-2p::GFP], not exclusive to ALN (Zheng et al., 2015)"
    ]
  },
  "AQR": {
    "Type": "Sensory neuron (oxygen- and minor CO2-sensory)",
    "Connectivity": [
      "In MoW: AQR",
      "In WormWiring: AQRh, AQRm,",
      "In Nemanode: AQR"
    ],
    "In Wormbase": "AQR",
    "Lineage": "QR.ap",
    "Location": "Head; right side near the posterior bulb of the pharynx",
    "Description": [
      "Postembryonically born neuron with rudimentary cilium.",
      "AQR and its ciliated dendrite are directly exposed to the pseudocoelomic body fluid. AQR axonal process projects into the ring."
    ],
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GCY-25; transmembrane receptor guanylate cyclase",
      "GCY-32; soluble guanylate cyclase",
      "GCY-34; soluble guanylate cyclase",
      "GCY-35; soluble guanylate cyclase, binds molecular oxygen and mediates oxygen sensation. Heterodimerizes with GCY-36",
      "GCY-36; soluble guanylate cyclase",
      "GCY-37; soluble guanylate cyclase",
      "NPR-1; receptor for flp-18- and flp-21-encoded peptides"
    ],
    "Function": [
      "Functions in aerotaxis, and along with PQR, URX and AUA regulate social feeding (or aggregation on a bacterial lawn) and bordering (the accumulation of animals on the thickest part of a bacterial lawn) behaviors. Suppressing the activity of AQR, PQR and URX neurons inhibits social feeding (Coates and de Bono , 2002). AQR, PQR and URX function as sensors of environmental oxygen which is a quantitative regulator of social feeding (Gray et al., 2004). Studies indicate that animals that carry the npr-1 (215F) low-activity allele or that lack npr-1 function tend to dwell (slow down) on food in low ambient O2 and roam around or aggregate (at the borders of the food lawn) in high ambient O2. In this model, drops in O2 lead to increased activity of a GCY-35/GCY-36 heterodimeric soluble guanylate cyclase. Rising cGMP, in turn, opens the TAX-2/TAX-4 cGMP-gated ion channel in AQR, PQR and URX leading to their depolarization and when food is present, strong suppression of roaming behavior (Cheung et al., 2005). In npr-1 mutants these neurons are thought to be hyperactive (see URX page for a full description).",
      "AQR, PQR and URX suppress innate immunity via NPR-1, which regulates both PMK-1-dependent and PMK-1-independent immune responses (Styer et al., 2008). Since URX, AQR, PQR are exposed to pseudocoelomic fluid, they are hypothesized to communicate neuroendocrine signals to nonneural tissues involved in innate immunity defense responses. - AQR, PQR and URX are weak CO2-sensors and contribute to CO2 avoidance (main CO2 sensors are AFD, BAG and ASE) (Bretscher et al., 2011). Reporters: - At CGC: ZG611 iaIs19 [gcy-32p::GFP + unc-119(+)]. Expression of gcy-32::GFP is consistenly observed in AQR, PQR, and URX neurons. - Other:"
    ],
    "Reporters": [
      "At CGC: ZG611iaIs19 [gcy-32p::GFP + unc-119(+)]. Expression of gcy-32::GFP is consistenly observed in AQR, PQR, and URX neurons.",
      "Other:"
    ]
  },
  "AS": {
    "Type": "Motor neuron",
    "Connectivity": [
      "In MoW: ASn",
      "In WormWiring: AS01h[a], AS02h[a], AS03h[a], AS04h[a], AS05h[a], AS06h[a], AS07h[a], AS08h[a], AS08m[p], AS09h[a], AS09m[p], AS10h[p], AS10m[p], AS11h[p], AS11m[p]",
      "In Nemandode: ASn"
    ],
    "In Wormbase": [
      "ASn, AS1, AS2, AS3, AS4, AS5,",
      "AS6, AS7, AS8, AS9, AS10, AS11"
    ],
    "Lineage": [
      "P1.apa, P2.apa, P3.apa,",
      "P4.apa, P5.apa, P6.apa, P7.apa,",
      "P8.apa, P9.apa, P10.apa, P11.apa"
    ],
    "Location": "Body (ventral nerve cord)",
    "Description": "Ventral cord motor neurons, born postembryonically. Innervate dorsal muscles, no ventral counterpart, similar to VAn but receive additional synaptic input from AVB. Note that unlike AS1-10, the commissure of AS11 originates from the posterior process. All AS commissures to the dorsal cord occur on the right side of the body. Hermaphrodites and males exhibit some differences in ASn connectivity. Also, in males, the AS11 cell body lies posterior to the male-specific CP9 neuron, which defines the anterior boundary of the male preanal ganglion (see Male Tail Cell ID). In males, AS11 is, therefore, considered part of the pre-anal ganglion rather than the ventral nerve cord.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "NLP-21; neuropeptide-like peptide",
      "(Loer and Rand, 2022; Duerr et al., 2008; von Stetina et al., 2007; Rand and Nonet, 1997-Appendix 2) Innexin expression: - INX-1a - INX-1b - INX-3- UNC-7 - INX-10a - INX-14 - UNC-7 - UNC-9 (Altun et al., 2009; Bhattacharya et al., 2019; Starich et al., 2009) Receptor expression: - ACR-14; nicotinic AChR non-alpha subunit - ACR-15; nicotinic AChR alpha subunit - LGC-46; ligand-gated ion channel - UNC-63; alpha subunit of a levamisole-sensitive nicotinic acetylcholine receptor (Wormbase; Altun, 2011; von Stetina et al., 2007; Fox et al., 2005)",
      "Function:",
      "Coordinates body wave propagation during locomotion (Tolstenkov et al., 2018)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-3",
      "UNC-7",
      "INX-10a",
      "INX-14",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019; Starich et al., 2009)"
    ],
    "Receptor expression": [
      "ACR-14; nicotinic AChR non-alpha subunit",
      "ACR-15; nicotinic AChR alpha subunit",
      "LGC-46; ligand-gated ion channel",
      "UNC-63; alpha subunit of a levamisole-sensitive nicotinic acetylcholine receptor",
      "(Wormbase; Altun, 2011; von Stetina et al., 2007; Fox et al., 2005)"
    ],
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "ASE": {
    "Type": "Sensory neuron (chemosensory (gustatory), CO2-sensory)",
    "Connectivity": [
      "In MoW: ASE",
      "In WormWiring: ASELh, ASERh, ASELm, ASERm",
      "In Nemanode: ASE"
    ],
    "In Wormbase": "ASE, ASEL, ASER",
    "Lineage": "AB alppppppaa, AB praaapppaa",
    "Location": "Lateral ganglia of head",
    "Description": "Amphid neurons, single (AsE) ciliated endings. Like all other amphid neurons, ASE are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7, secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub (Heiman and Shaham, 2010). ASE axon projects into ring via amphid commissure from ventral ganglion, makes diverse synaptic connections in ring neuropil. Although these neurons are left–right homologs anatomically, they exhibit marked asymmetries in gene expression and function (Cochella and Hobert, 2012) .",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "FLP-4; expressed in ASEL only. FMRFamide-like neuropeptide",
      "FLP-6; FMRFamide-like neuropeptide",
      "FLP-13; FMRFamide-like neuropeptide",
      "FLP-20; expressed in ASEL only. FMRFamide-like neuropeptide",
      "FLP-25; FMRFamide-like neuropeptide",
      "INS-1; insulin-like peptide, orthologous to human insulin",
      "INS-22; insulin-like peptide",
      "INS-26; insulin-like peptide",
      "INS-32; expressed in ASEL only. Insulin-like peptide",
      "NLP-3; neuropeptide-like peptide",
      "NLP-5; expressed in ASER only. Neuropeptide-like peptide",
      "NLP-7; bilaterally expressed (Nathoo et al., 2001) vs only in ASER (Takayama et al., 2010). Neuropeptide-like peptide",
      "NLP-14; neuropeptide-like peptide",
      "(N.B. Despite earlier reports suggesting FLP-5 and FLP-21 are expressed in ASE neurons, later studies indicate they are not; see Li and Kim, 2008-table 2.)",
      "(Pereira et al., 2015; Takayama et al., 2010; Li and Kim, 2008; Etchberger et al, 2007; Johnston et al., 2005; Kim and Li, 2004; Rogers et al., 2003; Nathoo et al., 2001; Pierce et al, 2001; O. Hobert, pers. comm.)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-14",
      "UNC-7(only in dauer)",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "DEL-3; degenerin-like, amiloride-sensitive channel",
      "DEL-4; degenerin-like, amiloride-sensitive channel",
      "DAF-2; functional studies suggest DAF-2 (RTK ins/IGF rec ortholog) is possibly expressed in ASER",
      "DOP-3; mammalian D2-like dopamine receptor",
      "DOP-5; homolog of mammalian dopamine and serotonin receptors",
      "GCY-1; expressed in ASER only. Transmembrane receptor guanylate cyclase",
      "GCY-3; expressed in ASER only. Transmembrane receptor guanylate cyclase",
      "GCY-4; expressed in ASER only. Transmembrane receptor guanylate cyclase",
      "GCY-5; expressed in ASER only. Transmembrane receptor guanylate cyclase",
      "GCY-6; expressed in ASEL only. Transmembrane receptor guanylate cyclase",
      "GCY-7; expressed in ASEL only. Transmembrane receptor guanylate cyclase",
      "GCY-14; expressed in ASEL only. Transmembrane receptor guanylate cyclase",
      "GCY-19; bilaterally expressed (faint) (Ortiz et al., 2006) vs only in ASER (Takayama et al., 2010). Transmembrane receptor guanylate cyclase",
      "GCY-20; expressed in ASEL only. Transmembrane receptor guanylate cyclase",
      "GCY-22; expressed in ASER only. Transmembrane receptor guanylate cyclase",
      "GCY-29; bilaterally expressed. Transmembrane receptor guanylate cyclase",
      "MGL-3; metabotropic glutamate receptor",
      "NPR-1; receptor for flp-18- and flp-21-encoded peptides",
      "NPR-5; receptor for flp-3 and flp-18 encoded peptides",
      "NPR-15; neuropeptide receptor",
      "OSM-9; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)",
      "SRAB-14; G-protein-coupled seven transmembrane receptor",
      "SRD-33; G-protein-coupled seven transmembrane receptor",
      "SRG-30; G-protein-coupled seven transmembrane receptor",
      "SRX-76; G-protein-coupled seven transmembrane receptor",
      "TMC-1; putative cation channel, salt-sensing receptor",
      "TRPA-2 ; transient receptor potential ion channel (TRPA, TRPM and TRPV ion channel families are considered \"thermoTRPs\" that sense temperature\")",
      "TRP-2 ; expressed in ASER only. Transient receptor potential ion channel (TRPC family)",
      "TYRA-2; tyramine receptor",
      "(Wormbase; Chatzigeorgiou et al., 2013; Mills et al., 2012; Altun, 2011; Takayama et al., 2010; Etchberger et al., 2007; Ortiz et al., 2006; Tomiaka et al 2006; Coates and de Bono , 2002; Colbert et al., 1997; Yu et al., 1997)."
    ],
    "Function": [
      "Chemotaxis to water soluble attractants including Na+, Cl-, cAMP, biotin and lysine. Simultaneous ablation of all amphid and phasmid neurons except ASE spares chemotaxis, indicating that the role of ASE in water-soluble chemotaxis is the most important. In the absence of ASE neurons, ADF, ASG, ASI, ASK, and ASJ carry out a weak residual response (Bargmann, 2006). ASE neurons respond to stepwise changes in NaCl concentration rather than absolute concentration. ASEL is primarily sensitive to Na+, whereas ASER is primarily sensitive to Cl- and K+(Bargmann, 2006; Pierce-Shimomura et al., 2001; Bargmann and Horvitz, 1991). Opposite intacellular Ca2+ transients are generated in ASEL and ASER in response to changes in salt concentration; ASEL is an ON-cell, activated by increases in NaCl concentration, whereas ASER is an OFF-cell, i.e, it is tonically active at baseline and becomes deactivated by increases in NaCl concentration (Suzuki et al., 2008; Suzuki et al., 2004). ASE responses are likely mediated by cGMP signalling. Behaviorally, increases in NaCl concentration increase the probability of forward locomotion and decrease the probability of turning, whereas decreases in NaCl concentration have the opposite effect resulting in a biased random walk towards the chemoattractant. Activation of ASEL inhibits reversals and lengthens bouts of forward locomotion (runs), whereas activation of ASER promotes reversals and direction changes (turns) (Appelby, 2012; Suzuki et al., 2008).",
      "ASH, ADL, ASK and ASE sensory neurons are responsible for the detection of certain chemical repellents. ASH neurons play a major role in this avoidance, whereas ADL, ASK and ASE play minor roles that are only evident when ASH neurons are missing (Hiliard et al., 2002; Sambongi et al., 1999; Bargmann et al, 1990). ASE neurons mediate avoidance behavior from Cd2+ and Cu2+ (Sambongi et al., 1999).",
      "Functions in adaptive food-leaving behavior (leaving a food patch as it is becoming depleted to start foraging); the ASE neurons promote food-leaving behavior via a cGMP pathway as food becomes limited; in well-fed animals ASE neurons mediate chemoattraction to water-soluble cues as noted above. However, food withdrawal or gradual depletion of food turns this attraction to salt into repulsion. This switch in preference involves signaling by the DAF-2 insulin receptor in ASER as well as INS-1-dependent feedback from AIA to ASER (Milward et al., 2011; Tomioka et al., 2006).",
      "AFD, BAG and ASE are primary CO2 sensors while oxygen-sensing neurons AQR, PQR and URX are also weakly CO2 responsive. As opposed to their asymmetric NaCl response, both ASEL and ASER become activated when CO2 rises (Bretscher et al., 2011)."
    ],
    "Reporters": [
      "At CGC: OH3191otIs3 [gcy-7::GFP + lin-15(+)] expressed in ASEL; OH3192ntIs1[gcy-5p::GFP] expressed in ASER",
      "Other:"
    ]
  },
  "ASG": {
    "Type": "Sensory neuron (chemosensory [gustatory])",
    "Connectivity": [
      "In MoW: ASG",
      "WormWiring Project: ASGLh, ASGRh, ASGLm, ASGRm",
      "In Nemanode: ASG"
    ],
    "In Wormbase": "ASG, ASGL, ASGR",
    "Lineage": "AB plaapapap, AB praapapap",
    "Location": "Lateral ganglia of head",
    "Description": [
      "Amphid neurons, single (AsG) ciliated ending. Like all other amphid neurons, ASG neurons are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7, secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub (Heiman and Shaham, 2010). ASG axon projects into nerve ring via amphid commissure where their primary synaptic partner is AIA.",
      "Developmental default state of the ASG neurons is AWA-like, and this fate must be repressed in order for the ASG neurons to adopt ASG fate. ALR-1 acts in parallel to UNC-130 and upstream of LIN-11 to specify the AWA and ASG neurons.",
      "(Melkman and Sengupta, 2005; Sarafi-Reinach and Sengupta, 2000)"
    ],
    "Neurotransmitter/ Neuropeptide": [
      "Betaine",
      "Glutamate",
      "Serotonin (under hypoxic conditions)",
      "FLP-6; FMRFamide-like neuropeptide",
      "FLP-13; FMRFamide-like neuropeptide",
      "FLP-22; FMRFamide-like neuropeptide"
    ],
    "Innexin expression": [
      "CHE-7 (in early larva)",
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX18a",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "DOP-4; human D1-like dopamine receptor",
      "GCY-15; transmembrane receptor guanylate cyclase",
      "GCY-21; transmembrane receptor guanylate cyclase",
      "NPR-1; receptor for flp-18- and flp-21-encoded peptides",
      "NPR-5; receptor for flp-3 and flp-18 encoded peptides",
      "NPR-15; neuropeptide receptor",
      "OSM-9; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)- cation selective",
      "TYRA-2; tyramine receptor",
      "(Wormbase; Mills et al., 2012; Altun, 2011; Ortiz et al., 2006; Rex et al., 2005; Sugiura et al., 2005; Coates and De Bono, 2002; Colbert et al., 1997; O. Hobert, pers. comm.)"
    ],
    "Function": [
      "Chemotaxis to water soluble attractants including Na+, Cl-, cAMP, biotin and lysine. Under normoxic conditions, simultaneous ablation of all amphid and phasmid neurons except ASE spares chemotaxis, indicating that the role of ASE in water-soluble chemotaxis is the most important. In the absence of ASE neurons, ADF, ASG, ASI, ASK, and ASJ carry out a weak residual response (Bargmann, 2006). However, under hypoxic conditions, an additional, latent circuit involving ADF and ASG is activated for processing the chemosensory information; downstream of ADF and ASG, pharyngal neuron M4 and AQR/PQR/URX function in processing this information towards behavioral response (Pocock and Hobert, 2010).",
      "Control entry into dauer stage and life span regulation:ADF, ASI and ASG inhibit entry into dauer stage while ASJ and ASK promote dauer entry (Kim et al., 2009; Ouellett et al., 2008; Schackwitz et al., 1996; Bargmann and Horvitz, 1991). Functional loss of ASI and ASG promotes lifespan and ablation of ASJ and ASK suppresses this effect (loss of ADF function does not prolong lifespan). This lifespan modulation is dependent on hormonal signalling via DAF-2 (insulin receptor homolog) which negatively regulates DAF-16 (FOXO transcription factor)(Alcedo and Kenyon, 2004).",
      "ASG is also required for starvation-dependent salt avoidance (Jang et al., 2019)."
    ],
    "Reporters": [
      "At CGC: OH14973 otEx6966 [srw-119p::GFP + pha-1(+)]",
      "Other:"
    ]
  },
  "ASH": {
    "Type": "Sensory neuron (polymodal nociceptive for osmo-, mechano-, electro-, photo- and odorsensation)",
    "Connectivity": [
      "In MoW: ASH",
      "WormWiring Project: ASHLh, ASHRh, ASHLm, ASHRm",
      "In Nemanode: ASH"
    ],
    "In Wormbase": "ASH, ASHL, ASHR",
    "Lineage": "AB plpaappaa, AB prpaappaa",
    "Location": "Lateral ganglia of head",
    "Description": "Amphid neurons, single (AsH) ciliated endings. Like all other amphid neurons, ASH are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7, secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub (Heiman and Shaham, 2010). Dendritic process takes up FITC. ASH axon projects into the ventral cord by way of the same side amphid commissure and then grows into the nerve ring where it makes diverse synaptic connections in ring neuropil.",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "FLP-21; FMRFamide-like neuropeptide",
      "INS-1; insulin-like peptide, orthologous to human insulin",
      "NLP-3; neuropeptide-like peptide",
      "NLP-15; neuropeptide-like peptide",
      "(Li and Kim, 2008; Nathoo et al., 2001; Lee et al., 1999; Serrano-Saiz et al., 2013)"
    ],
    "Innexin expression": [
      "CHE-7(in early larva)",
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10",
      "INX-14",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019; Chuang et al., 2007)"
    ],
    "Receptor expression": [
      "DCAR-1; seven transmembrane receptor for dihydrocaffeic acid (a water-soluble repellent)",
      "DOP-4; (D1-like) dopamine receptor",
      "NPR-1; receptor for flp-18- and flp-21-encoded peptides",
      "OCTR-1; octopamine receptor",
      "OCR-2; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)",
      "OSM-9; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)-cation selective, among \"thermoTRPs\" (TRPA, TRPM, TRPV)",
      "SER-3; octopamine receptor",
      "SER-5; serotonin receptor (5-HT6R-like)",
      "SRA-6; G protein-coupled seven transmembrane receptor",
      "SRB-6; G protein-coupled seven transmembrane receptor",
      "TMC-1; Na+-sensitive ion channel required for salt taste chemosensation and high salt avoidance behavior",
      "TRPA-1; transient receptor potential ion channel",
      "TYRA-2; tyramine receptor",
      "UNC-8; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit)",
      "(Wormbase; Chatzigeorgiou et al., 2013; Altun, 2011; Ezcurra et al., 2011; Aoki et al., 2011; Tobin et al., 2002; Coates and de Bono, 2002; de Bono et al., 2002; Tavernarakis et al., 1997; Troemel et al., 1995)"
    ],
    "Function": [
      "ASH is the main nociceptor and leads to avoidance responses from noxious stimuli, which include hyperosmolarity, nose touch, volatile repellent chemicals (1-octanol), heavy metals (Cd++ and Cu++), detergents/SDS, protons, high salt and alkaloids, such as quinine. There is stimulus-specific downstream signaling in ASH; a mutation in the glutamate receptor subunit, glr-1 which acts in synaptic targets of the ASH neurons and eliminates the response to nose touch but not to osmotic repellents. Similarly, ITR-1 (inositol 1,4,5-trisphosphate receptor) functions in nose touch- and benzaldehyde-avoidance but not in other known ASH-mediated avoidance behaviors. ASH-mediated aversive responses are modulated by monoamines and peptides. Receptors for 5-HT (SER-5), DA (DOP-3, DOP-4), and OA (OCTR-1, SER-3) appear to function directly in the ASH neurons for these effects. Food or 5-HT enhances a subset of ASH-mediated aversive responses (to nose touch, but not to soluble repellants, e.g.). Similarly, DA enhances aversive responses via DOP-4 on ASH, while TA and OA delay or inhibit these reponses through distinct subsets of TA and OA receptors. Inhibition by TA and OA requires the release of multiple neuropeptides from a number of additional neurons. These neuropeptides activate peptide receptors within the ASH-mediated circuit itself and on sensory neurons outside the circuit, suggesting these monoamine-initiated peptidergic signaling cascades can have global effects.",
      "(Chatzigeorgiou et al., 2013; Ezcurra et al., 2011; Komuniecki et al., 2011; Walker et a.l, 2009; Bargmann, 2006; de Bono & Villu Maricq, 2005; Hilliard et al., 2004; Hiliard et al., 2002; Hart et al., 1999; Sambongi et al., 2000; Sambongi et al., 1999; Troemel et al., 1995; Bargmann et al., 1990; Culotti and Russell, 1978).",
      "Light-sensation (350-470 nm range): when a flash of light is focused on the head of a worm moving forward, the animal halts and initiates reversals. Ablation of ASJ, AWB, ASK and ASH neurons together leads to a severe deficit in this head avoidance response while ablation of them individually or in different combinations does not yield a significant defect suggesting functional redundancy (Ward et al., 2008).",
      "Electrosensory navigation: C. elegans moves toward the negative pole of an electric field. Killing the ASJ or ASH neurons leads to significant disruption in electrotaxis while killing ASK, AWB or AWC has a weaker effect (Gabel et al., 2007).",
      "ASH and ADL are proposed to mediate social feeding behavior in response to repulsive cues (e.g. high O2 levels): ablation of ASH and ADL abolishes social feeding behavior transforming social animals to solitary feeders; avoidance of high O2 levels that facilitate aggregation is promoted by OCR-2 and OSM-9, and the transmembrane protein ODR-4, acting in the nociceptive neurons ASH and ADL. ASH and ADL, in turn, transmit information about aversive stimuli in the environment to a circuit that is responsible for aggregation, rapid locomotion, and food bordering behavior (Rogers et al., 2006; de Bono et al., 2002).",
      "Modulates innate immune response to pathogenic bacteria: ASH, ASI, AQR, PQR, and URX neurons control the unfolded protein response (UPR) and a p38 mitogen-activated protein kinase signaling pathway required for innate immunity (Singh and Aballay, 2012). Loss of OCTR-1 signaling in ASH and ASI increases the general immune function of the nematodes; OCTR-1 functions in these neurons to actively suppress innate immune responses by down-regulating the expression of noncanonical UPR genes in nonneuronal tissues (Sun et al., 2011).",
      "Plays role in establishment of asymmetric fates of AWCL/R neurons during development via NSY-5/INX-19 gap junctions (Schumacher et al., 2012)."
    ],
    "Reporters": [
      "At CGC: XE2046oyIs14 [sra-6p::GFP + lin-15(+)]. sra-6p::GFP marks both PVQ neurons as well as the ASI and ASH neurons in the head",
      "Other:"
    ]
  },
  "ASI": {
    "Type": "Sensory neuron (chemosensory [gustatory], thermosensory)",
    "Connectivity": [
      "In MoW: ASI",
      "WormWiring Project: ASILh, ASIRh, ASILm, ASIRm",
      "In Nemanode: ASI"
    ],
    "In Wormbase": "ASI, ASIL, ASIR",
    "Lineage": "AB plaapapppa, AB praapapppa",
    "Location": "Lateral ganglia of head",
    "Description": "Amphid neurons, single (AsI) ciliated endings. Like all other amphid neurons, ASI are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7 secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub (Heiman and Shaham, 2010). Dendritic process takes up FITC. ASI projects into the ventral cord via the amphid commissure and then into the nerve ring where it makes diverse synaptic connections.",
    "Neurotransmitter/Neuropeptide": [
      "Betaine",
      "DAF-28; beta-type insulin, homologous to human insulin",
      "FLP-2; FMRFamide-like peptide; variably expressed/neurons tentatively identified",
      "FLP-10; FMRFamide-like peptide",
      "FLP-21; FMRFamide-like peptide",
      "INS-1; insulin-like peptide, orthologous to human insulin",
      "INS-3; insulin-like peptide",
      "INS-4; insulin-like peptide",
      "INS-6; beta-type insulin-like molecule",
      "INS-7; insulin-like peptide",
      "INS-9; insulin-like peptide",
      "INS-22; insulin-like molecule, lacks a C-peptide domain",
      "INS-26; insulin-like peptide",
      "INS-32; insulin-like peptide",
      "NLP-1; neuropeptide-like protein",
      "NLP-5; neuropeptide-like protein",
      "NLP-6; neuropeptide-like protein",
      "NLP-7; neuropeptide-like protein",
      "NLP-9; neuropeptide-like protein",
      "NLP-14; neuropeptide-like protein",
      "NLP-18; neuropeptide-like protein",
      "NLP-24; neuropeptide-like protein",
      "NLP-27; neuropeptide-like protein",
      "PDF-1; pigment dispensing factor homolog",
      "(Wang et al., 2024; Pierce et al., 2013; Cornils et al., 2011; Janssen et al., 2009; Takayama et al., 2009; Li and Kim, 2008; Kodama et al., 2006; Tomioka et al., 2006; Li et al., 2003; Nathoo et al., 2001)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-18",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019; Chuang et al., 2007)"
    ],
    "Receptor Expression": [
      "DAF-11; transmembrane receptor type guanylate cyclase",
      "DAF-37; a G protein-coupled receptor, which, cooperatively with DAF-38, mediates ascaroside perception",
      "DAF-38; a G protein-coupled receptor, which, cooperatively with DAF-37, mediates ascaroside perception",
      "DCAR-1; seven transmembrane receptor for dihydrocaffeic acid (a water-soluble repellent)",
      "GCY-1; transmembrane receptor type guanylate cyclase",
      "GCY-2; transmembrane receptor type guanylate cyclase",
      "GCY-3; transmembrane receptor type guanylate cyclase",
      "GCY-27; receptor type guanylate cyclase, lacks transmembrane domain and predicted signal sequence",
      "NPR-5; receptor for flp-3 and flp-18 encoded peptides",
      "NPR-15; neuropeptide receptor",
      "SER-6; octopamine receptor",
      "SRD-1; G protein-coupled seven transmembrane receptor",
      "STR-2; G protein-coupled seven transmembrane receptor",
      "STR-3; G protein-coupled seven transmembrane receptor"
    ],
    "Function": [
      "The main synpatic output of ASI is onto AIA interneurons. The ASI neurons modulate behavior in several contexts, so they may work to integrate information about the environment (such as population density, food availability, CO2 level or the presence of sex pheromone) and adjust either the function or programming of related neural circuits via DAF-7/TGF-β (White and Jorgensen, 2012). ASI neurons are the sole source of DAF-7/TGF-β in C. elegans.",
      "Locomotion: Suppress omega turns and reversals enhancing dispersal (Gray et al., 2005). After animals are removed from bacterial food, they initiate a local search behavior consisting of reversals and deep omega-shaped turns. This is followed by dispersal ~30 min later as reversal and turns are suppressed. Local search behavior is triggered by AWC olfactory neurons, ASK gustatory neurons, and AIB interneurons while dispersal is promoted by ASI gustatory neurons and AIY interneurons (Gray et al., 2005).",
      "Chemotaxis: ASI neurons are involved in chemotaxis to lysine, contribute to a residual chemotactic response to cAMP, biotin, Cl-, and Na+ after ASE neurons are killed (Bargmann and Horvitz, 1991).",
      "Sense temperature: After cultivation at a uniform temperature (Tc) with sufficient food, animals preferentially migrate to their cultivation temperature (Tc) when placed on a thermal gradient, and move isothermally at this temperature (Hedgecock and Russell 1975). Animals sense and record their Tc by AFD (major thermosensory), AWC and ASI neurons (Beverly et al, 2011; Kuhara et al., 2008; Biron et al., 2008). This Tc memory is plastic and can be reset upon cultivation at a different temperature (Hedgecock and Russell 1975). Unlike AFD neurons, which respond to thermal stimuli above Tc with continuous, graded calcium signals in a deterministic and highly reproducible way, ASI neurons exhibit temperature-induced stochastic Ca++ transients in a defined operating range with decreased responses close to or far from Tc (Beverly et al, 2011).",
      "Sense pheromone and are involved in behavioral responses to pheromone (C. elegans pheromone is a mixture composed of derivatives of the dideoxysugar ascarylose (C3, C6, C7, C9 and other ascarosides) that regulates entry to dauer stage at L1, as well as adult behaviors such as sexual attraction of males to hermaphrodites and social behavior, i.e., attraction between hermaphrodites to clump into feeding groups)(Park et al., 2012). ADF, ASI and ASG inhibit entry into the dauer stage, while ASJ and ASK promote dauer entry (Kim et al., 2009; Ouellett et al., 2008; Schackwitz et al., 1996; Bargmann and Horvitz, 1991). ASI neurons function to repress pheromone actions (e.g, sexual attraction) in hermaphrodites; mutation of daf-7 or ablation of the ASI neuron pair reveals sexual attraction (male-specific behavior) in hermaphrodites (White and Jorgensen, 2012). In turn, pheromone induces dauer formation in part by repression of DAF-7/TGF-β expression in ASI.",
      "Modulate innate immune response to pathogenic bacteria. ASH, ASI, AQR, PQR, and URX neurons control the unfolded protein response (UPR) and a p38 mitogen-activated protein kinase signaling pathway required for innate immunity (Sun & Singh, 2012). Loss of OCTR-1 signaling in ASH and ASI increases the general immune function of the nematodes; OCTR-1 functions in these neurons to actively suppress innate immune responses by down-regulating the expression of noncanonical UPR genes in nonneuronal tissues (Sun et al., 2011)."
    ],
    "Reporters": [
      "At CGC: FK181ksIs2 [daf-7p::GFP + rol-6(su1006)]",
      "Other:"
    ]
  },
  "ASJ": {
    "Type": "Sensory neuron (dauer entry, electrosensory and photosensory)",
    "Connectivity": [
      "In MoW: ASJ",
      "WormWiring Project: ASJLh, ASJRh, ASJLm, ASJRm",
      "Nemanode: ASJ"
    ],
    "In Wormbase": "ASJ, ASJL, ASJR",
    "Lineage": "AB alpppppppa, AB praaappppa",
    "Location": "Lateral ganglia of head",
    "Description": "Amphid neurons, single (AsG) ciliated endings. Like all other amphid neurons, ASJ are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7 secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub (Heiman and Shaham, 2010). Dendritic process takes up FITC. The ASJ axons project into the ventral cord by way of the amphid commissure and then into the nerve ring where their primary synaptic output is to PVQ.",
    "Neurotransmitter/ Neuropeptide": "NLP-3; neuropeptide-like protein (although earlier reports suggested ASJ might be glutamatergic, more recent studies showed it is not) (Serrano-Saiz et al., 2013; Ohnishi et al., 2011; Nathoo et al., 2001)",
    "Innexin expression": [
      "CHE-7",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-18a",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "OSM-9; capsaicin receptor-like protein",
      "SRE-1; G protein-coupled, 7 TM protein",
      "DAF-11; transmembrane guanylyl cyclase",
      "(Birnby et al., 2000; Colbert et al., 1997; Troemel et al., 1995)"
    ],
    "Function": [
      "Control entry into dauer stage; ADF, ASI and ASG inhibit entry into dauer stage while ASJ and ASK promote dauer entry (Kim et al., 2009; Ouellett et al., 2008; Schackwitz et al., 1996).",
      "Control exit from dauer stage; promotes dauer recovery (Bargmann and Horvitz, 1991).",
      "Light-sensation (350-470 nm range); when a flash of light is focused on the head of a worm moving forward, the animal halts and initiates reversals. Ablation of ASJ, AWB, ASK and ASH neurons together leads to a severe deficit in this head avoidance response while ablation of them individually or in different combinations does not yiled a significant defect suggesting functional redundancy (Ward et al., 2008).",
      "Electrosensory navigation; C. elegans moves toward the negative pole of an electric field. Killing the ASJ or ASH neurons leads to significant disruption in electrotaxis while killing ASK, AWB or AWC has a weaker effect (Gabel et al., 2007).",
      "Temperature habituation; allows survival of cold shock following cultivation at 15�C (Ohta et al., 2014)."
    ],
    "Reporters": [
      "At CGC: OE3010ofEx4 [trx-1::GFP + lin-15(+)]",
      "Other:"
    ]
  },
  "ASK": {
    "Type": "Sensory neuron (chemosensory (gustatory), pheromone-sensory, electrosensory and photosensory)",
    "Connectivity": [
      "In MoW: ASK",
      "WormWiring Project: ASKLh, ASKRh, ASKLm, ASKRm",
      "In Nemanode: ASK"
    ],
    "In Wormbase": "ASK, ASKL, ASKR",
    "Lineage": "AB alpppapppa, AB praaaapppa",
    "Location": "Lateral ganglia of head",
    "Description": "Amphid neurons, single ciliated endings. Like all other amphid neurons, ASK are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7 secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub (Heiman and Shaham, 2010). Dendritic process takes up FITC. ASK axons project into the ventral cord by way of the amphid commissure and then grows into the nerve ring where their primary synaptic output is AIA.",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "FLP-21",
      "NLP-8",
      "NLP-10",
      "NLP-14 - Possibly PDF-1; pigment dispensing factor homolog",
      "(Barrios et al., 2012; Li and Kim, 2008; Nathoo et al., 2001; Lee et al., 1999)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-18",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019; Chuang et al., 2007)"
    ],
    "Receptor expression": [
      "OSM-9; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)-cation selective channel",
      "SRA-7; G protein-coupled serpentine receptor",
      "SRA-9; G protein-coupled serpentine receptor",
      "SRG-2; G protein-coupled serpentine receptor",
      "SRG-8; G protein-coupled serpentine receptor",
      "DAF-11; transmembrane guanylyl cyclase",
      "(Birnby et al., 2000; Troemel et al., 1995; Colbert et al., 1997)"
    ],
    "Function": [
      "Involved in chemotaxis to lysine (Bargmann and Horvitz, 1991).",
      "ASH, ADL, ASK and ASE sensory neurons are responsible for avoidance from certain chemical repellents. ASH plays a major role in this avoidance, whereas ADL, ASK and ASE play minor roles that are only evident when ASH is missing (Hiliard et al., 2002; Sambongi et al., 1999; Bargmann et al., 1990.) Mediate avoidance behavior from protons, detergents, alkaloids such as quinine; ASH is the main sensory neuron responsible for quinine detection while ASK plays a minor role (Hilliard et al., 2004).",
      "After animals are removed from bacterial food, they initiate a local search behavior consisting of reversals and deep omega-shaped turns. This is followed by dispersal ~30 min later, as reversals and turns are suppressed. Local search behavior is triggered by AWC, ASK and AIB neurons while dispersal is promoted by ASI and AIY neurons (Gray et al., 2005).",
      "Sense pheromone and are involved in behavioral responses to pheromone (C. elegans pheromone is a mixture composed of derivatives of the dideoxysugar ascarylose [C3, C6, C7, C9 and other ascarosides] that regulates entry to dauer stage at L1, as well as adult behaviors such as sexual attraction of males to hermaphrodites and social behavior, i.e., attraction between hermaphrodites to clump into feeding groups) (Jang et al., 2012; Lockery, 2009; Macosco et al., 2009). ADF, ASI and ASG inhibit entry into dauer stage while ASJ and ASK promote dauer entry (Kim et al., 2009; Ouellett et al., 2008; Schackwitz et al., 1996; Bargmann and Horvitz, 1991). ASK pair is one of the three core sensory neurons (AWA, AWC, ASK) that are required for sexual-attraction in males (White and Jorgensen, 2012).",
      "Lightsensation (350-470 nm range); when a flash of light is focused on the head of a worm moving forward, the animal halts and initiates reversals. Ablation of ASJ, AWB, ASK and ASH neurons together leads to a severe deficit in this head avoidance response while ablation of them individually or in different combinations does not yiled a significant defect suggesting functional redundancy (Ward et al., 2008).",
      "Electrosensory navigation; C. elegans moves toward the negative pole of an electric field. Killing the ASJ or ASH neurons leads to significant disruption in electrotaxis while killing ASK, AWB or AWC has a weaker effect (Gabel et al., 2007)."
    ],
    "Reporters": [
      "At CGC:",
      "Other: OH15857 otIs733 [srg-8p::GFP + inx-6p18::tagRFP]"
    ]
  },
  "AUA": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AUA",
      "WormWiring Project: AUALh, AUARh, AUALm, AUARm",
      "In Nemanode: AUA"
    ],
    "In Wormbase": "AUA, AUAL, AUAR",
    "Lineage": "AB alpppppppp, AB praaappppp",
    "Location": "Lateral ganglia of head",
    "Description": "Dendritic processes run with amphid neuron dendrites, but lack ciliated endings",
    "Neurotransmitter/ Neuropeptide": [
      "Betaine",
      "Glutamate",
      "(Wang et al., 2024; Lee et al., 1999)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-4",
      "INX-7",
      "INX-10a",
      "INX-14",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-4; glutamate receptor subunit",
      "NPR-1; neuropeptide Y receptor like protein which mediates social feeding behavior",
      "SER-2; tyramine receptor (a splice variant)",
      "Possibly DOP-1; dopamine receptor",
      "(Sanyal et al., 2004; Tsalik and Hobert, 2003; Coates and de Bono, 2002; Brockie et al., 2001)"
    ],
    "Function": [
      "Regulates social feeding behavior along with AQR, PQR and URX neurons (Coates and de Bono, 2002)",
      "Regulates learned aversive behavior to pathogenic bacteria (Filipowicz et al., 2022)",
      "Mediates aversive response modulation in starvation conditions (Ezcurra et al., 2016)"
    ],
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "AVA": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AVA",
      "In WormWiring: AVALh, AVARh, AVALm, AVARm",
      "In Nemanode: AVA"
    ],
    "In Wormbase": "AVA, AVAL, AVAR",
    "Lineage": "AB alppaaapa, AB alaappapa",
    "Location": "Lateral ganglia of head",
    "Description": "One of four bilaterally symmetric interneuron pairs (AVA, AVB, AVD, and PVC) with large-diameter axons that run the entire length of the ventral nerve cord and provide input to the ventral cord motor neurons. Synapse onto A-type (VA, DA) and AS motor neurons. Formerly called alpha. In males, AVAL receives input from PQR, PVY and PVX(Jarrell et al., 2012).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "FLP-1; FMRFamide-like peptide",
      "FLP-18; FMRFamide-related neuropeptide",
      "(Although earlier reports suggested AVA might be glutamatergic, more recent studies showed it is not) (Pereira et al., 2015; Serrano-Saiz et al., 2013; Ohnishi et al., 2011; Rogers et al., 2003; Nelson et al., 1998)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-18a",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "Possibly GGR-3; GABA-A/glycine receptor-like protein",
      "GLR-1; glutamate receptor subunit",
      "GLR-2; glutamate receptor subunit",
      "GLR-4; glutamate receptor subunit",
      "GLR-5; glutamate receptor subunit",
      "NMR-1; glutamate receptor subunit",
      "NMR-2; glutamate receptor subunit"
    ],
    "Function": [
      "Command interneuron",
      "Locomotion; functions as driver cell for backward locomotion (reversal). Drives backward movement of the animal along with touch modulator AVD neuron, AVE and A-type motor neurons. However, although AVA/AVD/AVE are important for initiating reversals, they are not essential, since worms lacking these neurons can still initiate reversals although at a reduced frequency (Piggott et al., 2011)."
    ],
    "Reporters": [
      "At CGC: NC1749hdIs32 [glr-1::DsRed2] III. otEx239 [rig-3::GFP + pha-1(+)]",
      "Other:"
    ]
  },
  "AVB": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AVB",
      "In WormWiring: AVBLh, AVBRh, AVBLm, AVBRm",
      "In Nemanode: AVB"
    ],
    "In Wormbase": "AVB, AVBL, AVBR",
    "Lineage": "AB plpaapaap, AB prpaapaap",
    "Location": "Lateral ganglia of head",
    "Description": "One of four bilaterally symmetric interneuron pairs (AVA, AVB, AVD, and PVC) with large-diameter axons that run the entire length of the ventral nerve cord and provide input to the ventral cord motor neurons. Synapse onto B-type (VB, DB) and AS motor neurons. Formerly called beta. In males, AVBR receives input from male-specific interneurons (Jarrell et al., 2012).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "PDF-1; pigment dispensing factor homolog",
      "(Pereira et al., 2015; Barrios et al., 2012)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-10a",
      "INX-18a",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-1; glutamate receptor subunit",
      "GLR-5; glutamate receptor subunit",
      "SRA-11; G protein-coupled seven transmembrane receptor",
      "Possibly GGR-3; GABA-A/glycine receptor-like protein",
      "UNC-8; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit)",
      "(Brockie et al., 2001; Tavernarakis et al., 1997; Fujiwara et al., 1996; Maricq et al., 1995; Troemel et al., 1995)"
    ],
    "Function": [
      "Command interneuron",
      "Functions as driver cell for forward locomotion. Drives forward movement of the animal along with the touch modulator, PVC, and B-type motor neurons (Chalfie et al., 1985). See Locomotory circuit."
    ],
    "Reporters": [
      "In CGC:",
      "Other:",
      "PICTURE TABLE"
    ]
  },
  "AVD": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AVD",
      "In WormWiring: AVDLh, AVDRh, AVDLm, AVDRm",
      "In Nemanode: AVD"
    ],
    "In Wormbase": "AVD, AVDL, AVDR",
    "Lineage": "AB alaaapalr, AB alaaapprl",
    "Location": "Lateral ganglia of head",
    "Description": "One of four bilaterally symmetric interneuron pairs (AVA, AVB, AVD, and PVC) with large-diameter axons that run the entire length of the ventral nerve cord and provide input to the ventral cord motor neurons (VA, DA, and AS).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-6",
      "INX-10a",
      "INX-14",
      "INX-18a",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-1; glutamate receptor subunit",
      "GLR-2; glutamate receptor subunit",
      "GLR-5; glutamate receptor subunit",
      "NMR-1; glutamate receptor subunit",
      "NMR-2; glutamate receptor subunit",
      "PDFR-1; pigment dispersing factor (PDF-1) receptor",
      "UNC-8, a DEG/ENaC family member homologous to subunits of a candidate mechanically gated ion channel",
      "(Wormbase; Barrios et al., 2012; Brockie et al., 2001; Tavernarakis et al., 1997; Maricq et al., 1995)"
    ],
    "Function": [
      "Command interneuron",
      "Functions as modulator for backward locomotion induced by head-touch. Drives backward movement (reversal) of the animal along with driver cell AVA neuron, AVE and A-type motor neurons. However, AVA/AVD/AVE are important for initiating reversals, they are not essential, since worms lacking these neurons can still initiate reversals although at a reduced frequency (Piggott et al,, 2011)."
    ],
    "Reporters": [
      "At CGC:",
      "Other: PICTURE TABLE"
    ]
  },
  "AVE": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AVE",
      "In WormWiring: AVELh, AVERh, AVELm, AVERm",
      "In Nemanode: AVE"
    ],
    "In Wormbase": "AVE, AVEL, AVER",
    "Lineage": "AB alpppaaaa, AB praaaaaaa",
    "Location": "Lateral ganglia of head",
    "Description": "Ventral cord interneurons. The AVEs send processes into the nerve ring where they receive synaptic input from sensory and interneurons. The processes exit the nerve ring into the ventral cord where they extend to anterior of the vulva. The ventral cord process is predominantly presynaptic with the same synaptic partners as AVD.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "FLP-1; FMRFamide-like peptide",
      "(Although earlier reports suggested AVE might be glutamatergic, more recent studies showed it is not)",
      "(Pereira et al., 2015; Serrano-Saiz et al., 2013; Ohnishi et al., 2011; Nelson et al., 1998)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-10a",
      "INX-14",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": "(Maricq et al., 1995; Brockie et al., 2001)",
    "Function": [
      "Command interneuron.",
      "Drives backward movement of the animal along with AVA, AVD and A-type motor neurons. See Locomotory circuit."
    ],
    "Reporters": [
      "At CGC: NC1750hdIs32 [glr-1::DsRed2]; gvEx173 [opt-3::GFP + rol-6(su1006)]",
      "Other:"
    ]
  },
  "AVF": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AVF",
      "In WormWiring: AVFLh, AVFRh, AVFLm, AVFRm",
      "In Nemanode: AVF"
    ],
    "In Wormbase": "AVF, AVFL, AVFR",
    "Lineage": "P1.aaaa or W.aaa (stochastic choice for L/R)",
    "Location": "Retrovesicular ganglion of head",
    "Description": "Postembryonically born interneurons with an anterior process located in the nerve ring and a posterior process extending the length of the ventral cord. In some animals the posterior process of AVFR may extend into the dorsorectal commissure instead of ending in the preanal ganglion (Hall and Russell, 1991). Both AVFL and AVFR send their anterior processes around the nerve ring on the same side, in parallel, rather than in opposite routes.",
    "Neurotransmitter/ Neuropeptide": "",
    "Innexin expression": [
      "INX-8",
      "INX-10a",
      "INX-14",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": "Expresses PDFR-1; pigment dispersing factor (PDF-1) receptor (Barrios et al., 2012)",
    "Function": "Controls increase in velocity prior to egg-laying (Hardaker et al., 2001)",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "AVG": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AVG",
      "In WormWiring: AVGh, AVGm",
      "In Nemanode: AVG"
    ],
    "In Wormbase": "AVG",
    "Lineage": "AB prpapppap",
    "Location": "Retrovesicular ganglion of head",
    "Description": "Ventral cord interneuron. The posterior process of AVG extends the length of the ventral cord and into the tailspike. In males, AVG has considerable input from HOA and LUA(Jarrell et al., 2012).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-10a",
      "INX-14 (only in dauer)",
      "INX-18a",
      "INX-18b",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-1; glutamate receptor subunit",
      "GLR-2; glutamate receptor subunit",
      "NMR-1; glutamate receptor subunit",
      "NMR-2; glutamate receptor subunit",
      "DEG-3; alpha subunit of a nicotinic acetylcholine receptor",
      "(Brockie et al., 2001; Maricq et al., 1995; Treinin and Chalfie, 1995)"
    ],
    "Function": [
      "Anterior guidepost neuron",
      "AVG pioneers the right tract of the ventral nerve cord. It expresses UNC-6 at 3-fold embryo stage to provide a continuous UNC-6 (netrin)-labeled pathway restricted to the right tract of the nerve cord.The unilateral UNC-6 cue from AVG guides various paired axons growing from the nerve ring and lumbar ganglia to make rightward decussations as they enter the ventral nerve cord. href=\"http://www.wormbase.org/db/gene/gene?name=WBGene00006746;class=Gene\" target=\"_blank\">UNC-6 also promotes bundling of axons within the cord itself. If the parent of AVG is ablated in wild-type embryos, interneurons and ventral cord motor neurons form several small fascicles rather than one tight bundle of right side tract and occasionally the right side axons shift to the left side",
      "(Antebi et al., 1997; Wadsworth et al., 1996; Wadsworth and Hedgecock, 1986; Durbin 1987).",
      "Regulates sex-specific tail mechanosensation and vulva location behavior in males (Oren-Suissa et al., 2016; Setty et al., 2022)."
    ],
    "Reporters": [
      "At CGC:",
      "Other: ZM9592 hpIs670 [pnmr-1::GFP ZF; pglr-5::ZIF-1::SL2::wCherry; lin-15(+)] (Taylor et al., 2021) PICTURE TABLE"
    ]
  },
  "AVH": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AVH",
      "In WormWiring: AVHLh, AVHRh, AVHLm, AVHRm",
      "In Nemanode: AVH"
    ],
    "In Wormbase": "AVH, AVHL, AVHR",
    "Lineage": "AB alapaaaaa, AB alappapaa",
    "Location": "Lateral ganglia of head",
    "Description": "Unipolar ventral cord interneurons. The processes of each AVH neuron enter the nerve ring and cross the midline into the contralateral side. The processes then exit the nerve ring into the ventral cord where they extend to the preanal ganglion.",
    "Neurotransmitter/ Neuropeptide": "",
    "Innexin expression": [
      "INX-1a",
      "INX-10a",
      "INX-12 (in early larva)",
      "UNC-9 (only in dauer)",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-4; glutamate receptor subunit",
      "SER-2; tyramine receptor (a splice variant)",
      "Possibly GGR-1; GABA-A/glycine receptor-like protein",
      "(Tsalik et al., 2003; Brockie et al., 2001; Fujiwara et al., 1996)"
    ],
    "Function": "Regulates touch-evoked escape response and motility (Chai et al., 2022)",
    "Reporters": [
      "At CGC: OH16483otIs768 [hlh-34p::GFP + unc-119(+)]",
      "Other:"
    ]
  },
  "AVJ": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: AVJ",
      "In WormWiring: AVJL, AVJR, AVJLm, AVJRm",
      "In Nemanode: AVJ"
    ],
    "In Wormbase": "AVJ, AVJL, AVJR",
    "Lineage": "AB alapapppa, AB alapppppa",
    "Location": "Lateral ganglia of head",
    "Description": "Unipolar ventral cord interneurons. The processes of each AVJ neuron enter the nerve ring and cross the midline into the contralateral side. The processes then exit the nerve ring into the ventral cord where they extend to the preanal ganglion.",
    "Neurotransmitter/ Neuropeptide": [
      "While immunoreactive to anti-GABA, does not contain known genes for release of GABA",
      "(Gendrel et al., 2016)."
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-8",
      "INX-10a",
      "INX-12 (in early larva)",
      "INX-18",
      "UNC-7",
      "UNC-9 (only in dauer)",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-1; glutamate receptor subunit",
      "(Maricq et al., 1995)"
    ],
    "Function": "",
    "Reporters": [
      "At CGC: KP987nuIs1[glr-1p::GFP + glr-1(+) + lin-15(+)] X. Also expressed in AVG, DVC, PVC, PVQ, RIG, RIS, RMD, RMEL/R, SMD, URY (Hart et al., 1995).",
      "Others:"
    ]
  },
  "AVK": {
    "Type": "Interneuron",
    "In MoW": "AVK",
    "Male Wiring Project": "AVKL,AVKR",
    "In Wormbase": "AVK, AVKL, AVKR",
    "Lineage": "AB plpapapap, AB prpapapap",
    "Location": "Ventral ganglion of head",
    "Description": "Ring and ventral cord interneuron. Mainly postsynaptic in ventral cord and presynaptic in ring. After making a full loop around the nerve ring, AVKR axon runs posteriorly on the left side of the ventral cord while AVKL axon runs on the right side of the ventral cord. In males, AVKL has input from PDER and AVKR makes gap junctions to hypodermis and PVS(Jarrell et al., 2012)",
    "Neurotransmitter/ Neuropeptide": [
      "FLP-1; FMRFamide-like peptide",
      "(Nelson et al., 1998)"
    ],
    "Innexin expression": [
      "INX-2",
      "INX-6",
      "INX-7",
      "INX-8",
      "INX-9",
      "INX-12",
      "INX-18",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": [
      "GLR-5; glutamate receptor subunit",
      "(Brockie et al., 2001)"
    ],
    "Function": ""
  },
  "AVL": {
    "Type": "Polymodal (interneuron, motor neuron)",
    "Connectivity": [
      "In MoW: AVL",
      "In WormWiring: AVL, AVLm",
      "In Nemanode: AVL"
    ],
    "In Wormbase": "AVL",
    "Lineage": "AB prpappaap",
    "Location": "Ventral ganglion in head",
    "Description": "An excitatory motor neuron for enteric muscles as well as a ring and ventral cord interneuron. In males, makes gap junctions with PDB, has a few synapses onto gonad and ventral body wall muscles (Jarrell et al., 2012).",
    "Neurotransmitter/ Neuropeptide": [
      "GABA",
      "Unknown monoamine",
      "(Eastman et al., 1999; Wang et al., 2024)"
    ],
    "Innexin expression": [
      "INX-2",
      "INX-10a",
      "INX-14",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": "",
    "Function": "Defecation. AVL and DVB are excitatory GABAergic motor neurons for the enteric muscles. Together with DVB, AVL activates expulsion muscle contraction. AVL is also required for anterior body contraction step in the defecation motor program (DMP) (Avery and Thomas, 1997; McIntire et al., 1993).",
    "Reporters": [
      "At CGC: XE2660wpIs40 [unc-47p::mCherry] V. ynIs50 [flp-22p::GFP]",
      "Other:"
    ]
  },
  "AVM": {
    "Type": "Sensory neuron (mechanosensory)",
    "Connectivity": [
      "In MoW: AVM",
      "In WormWiring: AVM, AVMm",
      "In Nemanode: AVM"
    ],
    "In Wormbase": "AVM",
    "Lineage": "QR.paa",
    "Location": [
      "Lateral. Right side of the anterior",
      "half of the body"
    ],
    "Description": "Postembryonically born anterior ventral microtubule cell, touch receptor",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "(Lee et al., 1999; Serrano-Saiz et al., 2013)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-14 (only in dauer)",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "PDFR-1; pigment dispersing factor (PDF-1) receptor",
      "(Barrios et al., 2012)"
    ],
    "Function": "Along with ALM and PLM, AVM neurons sense gentle (low threshold) mechanical stimulus to the body and provide input to the command (inter) neurons (PVC, AVB, AVD, AVA) via both synaptic connections and gap junctions (see mechanosensory circuit in C.elegans Book II). The touch cells form gap junctions with agonist interneurons and chemical synapses with the antagonist interneurons (see locomotory circuit). Hence, in the neural cicuit of the escape response, the anterior touch cells ALML/R and AVM form gap junctions with the backward movement interneuron AVD, but they provide (inhibitory) synaptic input to the forward interneurons (AVB and PVC) (Chalfie et al.,1985; Kaplan and Driscoll, 1997; Goodman, 2006; Pirri and Alkema, 2011).",
    "Reporters": [
      "At CGC: NC3738wdIs132 [gcy-35::GFP]; uIs152 [mec-3::RFP]",
      "Other:"
    ]
  },
  "AWA": {
    "Type": "Sensory neuron (odorsensory)",
    "Connectivity": [
      "In MoW: AWA",
      "In WormWiring: AWALh, AWARh, AWALm, AWARm",
      "In Nemanode: AWA"
    ],
    "In Wormbase": "AWA, AWAL, AWAR",
    "Lineage": "AB plaapapaa, AB praapapaa",
    "Location": "Lateral ganglia of head",
    "Description": "Amphid wing \"A\" cells. AWA have ciliated sheet-like sensory endings closely associated with amphid sheath(Doroquez et al., 2014). Like all other amphid neurons, AWA are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7, secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub (Heiman and Shaham, 2010).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Wang et al., 2024)"
    ],
    "Innexin expression": [
      "CHE-7",
      "EAT-5",
      "INX-7",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "OCR-1; TRPV (mammalian capsaicin receptor-like channel) protein",
      "OCR-2; TRPV (mammalian capsaicin receptor-like channel) protein",
      "OSM-9; TRPV (mammalian capsaicin receptor-like channel) protein",
      "ODR-10; 7-TM diacetyl receptor",
      "(Tobin et al., 2002; Sengupta et al., 1996; Colbert et al., 1997; Zhang et al., 1997)"
    ],
    "Function": [
      "Chemotaxis to diacetyl, pyrazine, trimethylthiazole (Bargmann et al., 1993)",
      "One of the three core sensory neurons (AWA, AWC, ASK) that are required for sexual-attraction in males (White and Jorgensen, 2012)"
    ],
    "Reporters": [
      "At CGC:",
      "Other: PY10421 oyIs88 [gpa-4d6p::myrGFP] (Maurya and Sengupta, 2021)"
    ]
  },
  "AWB": {
    "Type": "Sensory neuron (odorsensory, electrosensory and photosensory)",
    "Connectivity": [
      "In MoW: AWB",
      "In WormWiring: AWBL, AWBR, AWBLm, AWBRm",
      "In Nemanode: AWB"
    ],
    "In Wormbase": "AWB, AWBL, AWBR",
    "Lineage": "AB alpppppap, AB praaappap",
    "Location": "Lateral ganglia of head",
    "Description": "Amphid wing \"B\" cells. AWB have ciliated sheet-like sensory endings closely associated with amphid sheath. Like all other amphid neurons, AWB are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7, secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub (Heiman and Shaham, 2010).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "NLP-3; neuropeptide-like protein",
      "NLP-9; neuropeptide-like protein",
      "(Pereira et al., 2015; Nathoo et al., 2001)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-18a",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Chuang et al., 2007; Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "STR-1; G protein-coupled serpentine receptor",
      "DAF-11; transmembrane guanylyl cyclase",
      "Possibly AEX-2; a 7-transmembrane domain protein with homology to the G protein-coupled receptor family",
      "(Mahoney et al., 2008; Birnby et al., 2000; Troemel et al., 1997)"
    ],
    "Function": [
      "Avoidance of 2-nonanone and 1-octanol (Troemel et al., 1997).",
      "Lightsensation (350-470 nm range); when a flash of light is focused on the head of a worm moving forward, the animal halts and initiates reversals. Ablation of ASJ, AWB, ASK and ASH neurons together leads to a severe deficit in this head avoidance response, while ablation of them individually or in different combinations does not yield a significant defect suggesting functional redundancy (Ward et al., 2008).",
      "Electrosensory navigation; C. elegans moves toward the negative pole of an electric field. Killing the ASJ or ASH neurons leads to significant disruption in electrotaxis, while killing ASK, AWB or AWC has a weaker effect (Gabel et al., 2007)."
    ],
    "Reporters": [
      "At CGC: CX3553kyIs104 [str-1p::GFP] X",
      "Other:"
    ]
  },
  "AWC": {
    "Type": "Sensory neuron (odorsensory, photosensory, electrosensory and thermosensory)",
    "Connectivity": [
      "In MoW: AWC",
      "In WormWiring: AWCLh, AWCRh, AWCLm, AWCRm",
      "In Nemanode: AWC"
    ],
    "In Wormbase": "AWC, AWCL, AWCR",
    "Lineage": "AB plpaaaaap, AB prpaaaaap",
    "Location": "Lateral ganglia of head",
    "Description": "Amphid wing \"C\" cells. AWC have ciliated sheet-like sensory endings closely associated with the amphid sheath. Like all other amphid neurons, AWC are born near the presumptive nose of the embryo during development. They then anchor a short projection there, after which the cell body migrates away, stretching the dendrite out behind it. This process is dependent on DEX-1 or DYF-7, secreted extracellular matrix proteins which act cooperatively for anchoring. In mutants lacking these proteins, the dendrite fails to anchor at the nose and is dragged along with the migrating cell body, giving rise to a short dendritic stub. AWC neurons display functional asymmetry where one of the AWC pair stochastically expresses a chemoreceptor protein (Troemel et al., 1999; Heiman and Shaham, 2010).",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate (AWC-AIA synapse is an inhibitory glutamatergic synapse whose function is acutely modulated by NLP-1/NPR-11 signaling)",
      "NLP-1; neuropeptide-like protein",
      "(Chalasani et al., 2010; Serrano-Saiz et al., 2013)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-18a",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Chuang et al, 2007; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "OSM-9; mammalian capsaicin receptor-like channel protein",
      "DAF-11; transmembrane guanylyl cyclase",
      "STR-2, G protein-coupled serpentine receptor, expressed asymmetrically (randomly on the right or left side)",
      "(Birnby et al., 2000; Troemel et al., 1999; Colbert et al., 1997)"
    ],
    "Function": [
      "Critical for chemotaxis to volatile odorants, (e.g. chemotaxis to benzaldehyde, butanone, isoamylalcohol, 2,3 pentanedione and 2,4,5 trimethylthiazole).",
      "Induction of local search behavior and promoting turns. After animals are removed from bacterial food, they initiate a local search behavior consisting of reversals and deep omega-shaped turns. This is followed by dispersal ~30 min later as reversal and turns are suppressed. Local search behavior is triggered by AWC olfactory neurons, ASK gustatory neurons, and AIB interneurons, while dispersal is promoted by ASI gustatory neurons and AIY interneurons (Gray et al., 2005). The AWC neurons synapse onto several interneurons including AIB and AIY, which enhance and suppress turning, respectively. The AWC neurons activate the AIB interneurons through AMPA-type glutamate receptors and inhibit AIY interneurons through glutamate-gated chloride channels. AWC are odor-OFF neurons that are activated by odor removal and inhibited in the continued presence of odors. On prolonged exposure to odorant (over 30 min), adaptation to AWC-sensed odors occurs, abrogating the chemotactic response. NLP-1 is required for these AWC-dependent food-evoked behaviors and odor adaptation (Chalasani et al., 2010; Chalasani et al., 2007; Gray et al., 2005; L'Etoile and Bargmann, 2000; Bargmann et al., 1993).",
      "Thermosensor: After cultivation at a uniform temperature (Tc) with sufficient food, animals preferentially migrate to their cultivation temperature (Tc) when placed on a thermal gradient, and move isothermally at this temperature (Hedgecock and Russell 1975), animals sense and record their Tc by AFD (major thermosensory) and AWC and ASI neurons (Beverly et al, 2011; Kuhara et al., 2008; Biron et al., 2008). This Tc memory is plastic and can be reset upon cultivation at a different temperature (Hedgecock and Russell 1975). Activity of both the AFD and the AWC neurons is essential for the execution of thermotactic behaviors with high fidelity and precision. Upon sensation of a higher temperature than Tc, Ca++ concentration in AWC increases via production of cGMP by ODR-1 and activation of cGMP-dependent TAX-4 cation channel (Kuhara et al., 2008). Unlike AFD neurons, which respond to thermal stimuli above Tc with continuous, graded calcium signals in a deterministic and highly reproducible way, AWC neurons exhibit stochastic temperature-evoked Ca++ changes that are stimulus-correlated with different temporal kinetics at temperatures above and below Tc (Biron et al., 2008). AWC appears to get more active as temperatures rise or fall further from Tc. The AFD, AWC and ASI neurons seem to act in concert to increase turning rate when animals encounter higher temperatures than Tc on a gradient to move down the gradient toward colder temperatures near Tc (negative thermotaxis) (Biron et al., 2008). To track isotherms, animals do not actively pursue isothermal alignment, but once serendipitously aligned along an isotherm (at T=Tc), they track by suppressing turns (Luo et al., 2006). G-protein-coupled receptor (GPCRs) SRTX-1 is required both in AFD and AWC for retaining normal isothermal tracking (Liu et al., 2012). AWC neurons are relatively quiet around temperatures close to the Tc.",
      "Electrosensory navigation; C. elegans moves toward the negative pole of an electric field. Killing the ASJ or ASH neurons leads to significant disruption in electrotaxis, while killing ASK, AWB or AWC has a weaker effect (Gabel et al., 2007).",
      "One of the three core sensory neurons (AWA, AWC, ASK) that are required for sexual-attraction in males(White and Jorgensen, 2012)."
    ],
    "Reporters": [
      "At CGC: OH16052otIs745 [ceh-36p3::npp-9::mCherry::BLRP::3xFLAG::npp-9 3'UTR]",
      "Other:"
    ]
  },
  "BAG": {
    "Type": "Sensory neuron (oxygen- and carbondioxide-sensory",
    "Connectivity": [
      "In MoW: BAG",
      "In WormWiring: BAGLh, BAGRh, BAGLm, BAGRm",
      "In Nemanode: BAG"
    ],
    "In Wormbase": "BAG, BAGL, BAGR",
    "Lineage": "AB alppappap, AB arappppap",
    "Location": "Anterior to the nerve ring in head",
    "Description": "Form ciliated endings that are not exposed directly to the external environment. The BAG dendrite associates with and wraps the lateral inner-labial socket cells (Doroquez et al., 2014).",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "NLP-3; neuropeptide-like protein",
      "(Nathoo et al., 2001; Serrano-Saiz et al., 2013)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-19",
      "UNC-7",
      "(Chuang et al., 2007; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GCY-33; Oxygen sensor, guanylyl cyclase",
      "(Yu et al., 1997)"
    ],
    "Function": [
      "A neural circuit that includes BAG neurons mediates acute CO2 avoidance (Hallem and Sternberg, 2008; Bretscher et al., 2008).",
      "O2 sensation mainly requires the opposing actions of BAG and URX sensory neurons. URX affects behaviors similarly in well-fed or starved animals, while BAG is more important in starved animals. In wild type animals with high NPR-1 function, BAG neurons sense decreases in O2 concentrations and lead to transient slowing behavior, while URX neurons sense elevations. The interaction of these neurons results in locomotion responses allowing the worm to find and settle at places of preferred O2 concentrations. The O2-sensing abilities of BAG and URX neurons are attributed to specific O2-binding soluble guanylate cyclases (sGCs) within those neuron classes; GCY-31 and GCY-33 in BAG neurons, and GCY-35 and GCY-36 in URX neurons (Skora and Zimmer, 2013; Zimmer et al., 2009)",
      "Lifespan regulation; ablation of low-O2-sensing BAG neurons increases lifespan, while ablation of high-O2-sensing URX neurons decreases lifespan. BAG and URX neurons counterbalance each other for control of lifespan via functions of different sCGs. Also, their life-span modulating effects are independent of canonical life-span modulatory pathways, including DAF-2/DAF-16, DAF-12, germline signaling, sensory perception pathways or dietary restriction (Liu and Cai, 2013)."
    ],
    "Reporters": [
      "At CGC: RJP225ynIs34 [flp-19p::GFP] IV; him-5(e1490) V",
      "Other: RJP567 ynIs64[flp-17p::GFP]"
    ]
  },
  "BDU": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: BDU",
      "WormWiring: BDULh, BDURh, BDULm, BDURm",
      "In Nemanode: BDU"
    ],
    "In Wormbase": "BDU, BDUL, BDUR",
    "Lineage": "AB arppaappp, AB arpppappp",
    "Location": [
      "Lateral. Left and right sides",
      "of the anterior half of the body."
    ],
    "Description": "Bipolar neurons with processes running along the excretory canal. The anterior processes enter the nerve ring via the deirid commissure where their primary synaptic input is from ALM.",
    "Neurotransmitter/ Neuropeptide": [
      "NLP-1; neuropeptide-like protein",
      "NLP-15; neuropeptide-like protein",
      "(Nathoo et al., 2001)"
    ],
    "Innexin expression": [
      "CHE-7 (only in dauer)",
      "INX-2",
      "INX-7",
      "INX10a",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-8; glutamate receptor subunit",
      "SER-2; tyramine receptor (a splice variant)",
      "(Tsalik et al., 2003; Brockie et al., 2001)"
    ],
    "Function": "Guidance for AVM process outgrowth during L1 (Walthall and Chalfie, 1988)",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "CAN": {
    "Type": "Neuron with unknown function",
    "Connectivity": [
      "In MoW: CAN",
      "In WormWiring: CANLh, CANRh",
      "In Nemanode: CAN"
    ],
    "In Wormbase": "CAN, CANL, CANR",
    "Lineage": "AB alapaaapa, AB alappappa",
    "Location": "Midbody, lateral sides",
    "Description": "Process runs along excretory canal, no chemical synapses seen, some gap junctions to excretory cells, essential for survival. Posterior processes terminate at the anus. After they are born, CAN neurons migrate from the anterior end of the embryo to their final positions midway along the body (Sulston et al., 1983).",
    "Neurotransmitter/ Neuropeptide": [
      "Monoamine; express VMaT, CAT-1",
      "NLP-10; neuropeptide-like protein",
      "NLP-15; neuropeptide-like protein",
      "(Nathoo et al., 2001; Duerr et al., 1999)"
    ],
    "Innexin expression": [
      "INX-3",
      "INX-7",
      "INX-12",
      "INX-13",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": [
      "SER-2; tyramine receptor (a splice variant)",
      "Possibly GGR-2; a GABA-A/glycine receptor-like protein",
      "(Tsalik et al., 2003; Fujiwara et al., 1996)"
    ],
    "Function": [
      "A neural circuit that includes BAG neurons mediates acute CO2 avoidance (Hallem and Sternberg, 2008; Bretscher et al., 2008).",
      "O2 sensation mainly requires the opposing actions of BAG and URX sensory neurons. URX affects behaviors similarly in well-fed or starved animals, while BAG is more important in starved animals. In wild type animals with high NPR-1 function, BAG neurons sense decreases in O2 concentrations and lead to transient slowing behavior, while URX neurons sense elevations. The interaction of these neurons results in locomotion responses allowing the worm to find and settle at places of preferred O2 concentrations. The O2-sensing abilities of BAG and URX neurons are attributed to specific O2-binding soluble guanylate cyclases (sGCs) within those neuron classes; GCY-31 and GCY-33 in BAG neurons, and GCY-35 and GCY-36 in URX neurons (Skora and Zimmer, 2013; Zimmer et al., 2009).",
      "Lifespan regulation; ablation of low-O2-sensing BAG neurons increases lifespan, while ablation of high-O2-sensing URX neurons decreases lifespan. BAG and URX neurons counterbalance each other for control of lifespan via functions of different sCGs. Also, their life-span modulating effects are independent of canonical life-span modulatory pathways, including DAF-2/DAF-16, DAF-12, germline signaling, sensory perception pathways or dietary restriction (Liu and Cai, 2013)."
    ],
    "Reporters": [
      "At CGC: RJP225ynIs34 [flp-19p::GFP] IV; him-5(e1490) V",
      "Other: RJP567 ynIs64[flp-17p::GFP]"
    ]
  },
  "CEP": {
    "Type": "Sensory neuron (mechanosensory)",
    "Connectivity": [
      "In MoW: CEP",
      "WormWiring: CEPDLh, CEPDRh, CEPVLh, CEPVRh, CEPDLm, CEPDRm, CEPVLm, CEPVRm",
      "In Nemanode: CEP"
    ],
    "In Wormbase": "CEP, CEPDL, CEPDR, CEPVL, CEPVR",
    "Lineage": [
      "AB plaaaaappa, AB arpapaappa,",
      "AB plpaappppa, AB prpaappppa"
    ],
    "Location": "Head",
    "Description": "Neurons of cephalic sensilla. Dorsal CEP cell bodies are located just posterior of the nerve ring, while ventral CEP cell bodies are located just anterior of the nerve ring. CEP dendrite extends to the tip of the nose within corresponding labial nerve. CEPD neurons are directly exposed to the pseudocoelomic body fluid. CEP express acetylcholinesterase of class A, ACE-1(Culetto et al., 1999).",
    "Neurotransmitter/ Neuropeptide": [
      "Dopamine",
      "(Lints and Emmons, 1999)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-10a",
      "INX-11",
      "INX-14",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "DOP-2; dopamine receptor",
      "(Suo et al., 2003)"
    ],
    "Function": "Mechanosensensation in the head; deflection of its single cilium by pressure application produces ion currents in CEP neuron, consistent with mechanosensory function (Kang et al., 2010). The three classes of dopaminergic neurons (CEP, ADE, and PDE) function redundantly to sense the mechanosensory stimulus from bacteria and mediate the motor circuit to control \"basal slowing response\"; when well-fed C. elegans hermaphrodites are washed clean of bacteria and then reintroduced to the bacterial lawn, they move more slowly than when transferred to an environment without bacteria (Sawin et al., 2000).",
    "Reporters": [
      "At CGC: BZ555egIs1[dat-1p::GFP]",
      "Also expressed in ADE, PDE, and R5A, R7A, R9A in males.",
      "Other:"
    ],
    "Embryonic development of CEP neurons": "",
    "CEP Sensory Endings": ""
  },
  "DA": {
    "Type": "Motor neuron",
    "Connectivity": [
      "In MoW: DAn",
      "In WormWiring: DA02h, DA03h, DA04h, DA05h, DA06h, DA07h, DA08h, DA09h, DA04m, DA05m, DA06m, DA07m, DA08m, DA09m",
      "In Nemanode: DAn"
    ],
    "In Wormbase": [
      "DA1, DA2, DA3, DA4, DA5,",
      "DA6, DA7, DA8, DA9"
    ],
    "Lineage": [
      "AB prppapaap, AB plppapapa,",
      "AB prppapapa, AB plppapapp,",
      "AB prppapapp, AB plpppaaap,",
      "AB prpppaaap, AB prpapappp,",
      "AB plpppaaaa"
    ],
    "Location": "Body (ventral nerve cord)",
    "Description": "Ventral cord \"dorsal A\" motor neurons. DA neurons predominantly innervate dorsal body wall muscles and VD neurons. Hermaphrodites and males exhibit some differences in DAn connectivity.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "Betaine",
      "(Duerr et al., 2008; Rand and Nonet, 1997-Appendix 2; Wang et al., 2024)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-3",
      "INX-7",
      "INX-10a",
      "INX-14",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "ACR-14; nicotinic AChR alpha subunit",
      "UNC-8; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit)",
      "SER-2; DA9 expresses a splice variant of this tyramine receptor",
      "(Goodman, 2006; Tsalik et al., 2003; Tavernarakis et al., 1997)"
    ],
    "Function": "Backward locomotion. DA neurons receive input from the driver interneuron AVA, and modulator interneurons AVD and AVE. See Locomotory circuit.",
    "Reporters": [
      "At CGC: NC2913hdIs1 [unc-53p::GFP + rol-6(su1006)] X. ufIs26 [unc-4p::mCherry + lin-15(+)]",
      "Other:"
    ]
  },
  "DB": {
    "Type": "Ventral cord motor neuron, proprioceptive neuron",
    "Connectivity": [
      "In MoW: DBn",
      "In WormWiring: DB01h, DB03h, DB04h, DB05h, DB03m, DB04m, DB05m, DB06m, DB07m",
      "In Nemanode: DBn"
    ],
    "In Wormbase": "DB, DB1/3, DB2, DB3/1, DB4, DB5, DB6, DB7",
    "Lineage": [
      "AB plpaaaapp or AB prpaaaapp,",
      "AB arappappa, AB prpaaaapp or AB plpaaaapp,",
      "AB prpappapp, AB plpapappp, AB plppaappp,",
      "AB prppaappp"
    ],
    "Location": "Body (ventral nerve cord)",
    "Description": "Ventral cord \"dorsal B \" motor neurons. The DB neurons receive extensive input from PVC and innervates dorsal muscles and VDn.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Duerr et al., 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-3",
      "INX-14",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "ACR-14; nicotinic AChR non-alpha subunit",
      "Possibly PDFR-1; pigment dispersing factor (PDF-1) receptor (in DB2)",
      "(Barrios et al., 2012; Fox et al., 2005)"
    ],
    "Function": [
      "Forward locomotion. The VD neurons are activated during forward movement (Haspel et al., 2010). Ablation of five of seven DB neurons causes defects in larval forward movement (Chalfie et al., 1985). See Locomotory circuit.",
      "Proprioception involving propagation of rhythmic activities along the body during forward locomotion. Ventral and dorsal bending of an anterior body region directly activates VB and DB motor neurons (Wen et al., 2012). Gap junctions between neighbors as well as overlapping segments of their processes then propagate the bending signal from anterior to posterior. The mechanosensitive-proprioceptive receptors are likely localized near the anterior of the processes."
    ],
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "DD": {
    "Type": "",
    "Connectivity": [
      "In MoW: DDn",
      "In WormWiring: DD01h, DD02h, DD03h, DD04h, DD06h, DD03m, DD04m, DD05m, DD06m",
      "In Nemanode: DDn"
    ],
    "In Wormbase": [
      "DDn, DD1, DD2, DD3, DD4, DD5,",
      "DD6"
    ],
    "Lineage": [
      "AB plppappap, AB prppappap,",
      "AB plppapppa, AB prppapppa,",
      "AB plppapppp, AB prppapppp"
    ],
    "Location": "Body (ventral nerve cord)",
    "Description": "GABAergic inhibitory ventral cord motor neurons. DD's receive dyadic synapses from excitatory ventral cord motor neurons along with body wall muscles. The initial pattern of synapses made by DD neurons are presynaptic and inhibitory to ventral body wall muscles while being postsynaptic to neurons that activate dorsal body wall muscles. During late L1, after the birth of VD motor neurons, DD neurons change their",
    "Neurotransmitter/ Neuropeptide": [
      "GABA",
      "(McIntire et al., 1993, Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-3",
      "INX-10",
      "INX-14",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "ACR-14; nicotinic AChR non-alpha subunit",
      "(Fox et al., 2005) Function:",
      "Sinusoidal body movement-locomotion. Ablation of DD neurons causes uncoordinated movement in larvae (Chalfie et al., 1985). Optogenetic activation of DDs reduced ventral body wall muscle activity in L1 and a lesser reduction of dorsal body wall activity (Lu et al., 2022)."
    ],
    "Function": "",
    "Reporters": [
      "At CGC: NC3296ynIs37 [flp-13::GFP] III. juIs223 [ttr-39p::mCherry + ttx-3p::GFP] IV",
      "Other:"
    ]
  },
  "DVA": {
    "Type": "Interneuron, stretch sensitive sensory neuron",
    "Connectivity": [
      "In MoW: DVA",
      "In WormWiring: DVAh, DVAm",
      "In Nemanode: DVA"
    ],
    "In Wormbase": "DVA",
    "Lineage": "AB prppppapp",
    "Location": "Dorsorectal ganglion",
    "Description": "Monopolar ring interneuron with cell body located in the dorso-rectal ganglion. Sends process the length of the ventral cord and enters into the right side of the nerve ring.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "[N.B. DVA is cholinergic, while DVC is not] (Pereira et al., 2015; Duerr et al., 2008)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-3",
      "INX-7",
      "INX-10",
      "INX-13",
      "INX-14",
      "INX-17",
      "INX-18",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "Possibly GGR-3; GABA-A/glycine receptor-like protein",
      "GLR-4; glutamate receptor subunit",
      "GLR-5; glutamate receptor subunit",
      "NMR-1; glutamate receptor subunit",
      "SER-2; tyramine receptor (a splice variant)",
      "SER-4; serotonin receptor, variably expressed (the neuron can be DVC instead)",
      "TRP-4; mechanosensitive TRPN channel",
      "(Li et al., 2006; Tsalik et al., 2003; Brockie et al., 2001; Fujiwara et al., 1996)"
    ],
    "Function": [
      "Mechanosensory integration. The PVD and DVA neurons are presynaptic to both the forward and backing interneurons, and provide input to both the anterior and posterior touch circuits. Animals lacking these neurons respond to tap stimulus with diminished forward accelerations and reversals. These neurons, therefore, seem to maintain the overall activity of the touch circuit (Wicks et al., 1996; Driscoll and Kaplan, 1997; Goodman, 2007).",
      "Proprioception. DVA represents a stretch receptor neuron that regulates sensory-motor integration during C. elegans locomotion. trp-4, a homologue of the mechanosensitive TRPN channel, acts as a stretch-sensitive proprioceptor in DVA. DVA both positively and negatively modulates locomotion, providing a unique mechanism whereby a single neuron can fine-tune motor activity (Li et al., 2006)."
    ],
    "Reporters": [
      "At CGC: OH15623otIs706 [nlp-12p::TagRFP]",
      "Other:"
    ]
  },
  "DVB": {
    "Type": "Polymodal (motor neuron, interneuron)",
    "Connectivity": [
      "In MoW: DVB",
      "In WormWiring: DVBh, DVBm",
      "In Nemanode: DVB"
    ],
    "In Wormbase": "DVB",
    "Lineage": "K.p",
    "Location": "Dorsorectal ganglion",
    "Description": "An excitatory GABAergic motor neuron/interneuron located in dorso-rectal ganglion. Innervates enteric muscles. Born postembryonically from K rectal epithelial cell; during late L1 the K rectal epithelial cell divides to generate DVB (K.p) and K.a which acts as the new rectal epithelial cell. DVB shows experience-dependent morphological plasticity in males with the addition of new neurites (Hart and Hobert, 2018).",
    "Neurotransmitter/ Neuropeptide": [
      "GABA",
      "Betaine",
      "(McIntire et al., 1993; Wang et al., 2024)"
    ],
    "Innexin expression": [
      "INX-3",
      "INX-7",
      "INX-10",
      "INX-13",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "-",
    "Reporters": [
      "At CGC: OH906otIs39 [unc-47(delta)::GFP + lin-15(+)]. Also expressed in RMEL/R, AVL, RIS, and PVT.",
      "Other:"
    ]
  },
  "DVC": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: DVC",
      "In WormWiring: DVCh, DVCm",
      "In Nemanode: DVC"
    ],
    "In Wormbase": "DVC",
    "Lineage": "C aapaa",
    "Location": "Dorsorectal ganglion",
    "Description": "Ring interneuron that sends a process from the dorsorectal ganglion along the ventral cord and into the nerve ring.",
    "Neurotransmitter/ Neuropeptide": "Glutamate (Serrano-Saiz et al., 2013)",
    "Innexin expression": [
      "CHE-7",
      "INX-5",
      "INX-7",
      "INX-9",
      "INX-10",
      "INX-11",
      "INX-13",
      "INX-14",
      "INX-17 (early larva)",
      "INX-18",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-1; glutamate receptor subunit",
      "SER-4; serotonin receptor, variably expressed (the neuron can be DVA instead)",
      "TRP-4; mechanosensitive TRPN channel",
      "(Tsalik et al., 2003; Hart et al., 1995)"
    ],
    "Function": "",
    "Reporters": [
      "At CGC: NC3540otIs458 [ceh-63p::GFP + unc-119(+)]",
      "Other:"
    ]
  },
  "FLP": {
    "Type": "Sensory neuron (polymodal nociceptive for mechanosensation and thermosensation)",
    "Connectivity": [
      "In MoW: FLP",
      "In WormWiring: FLPL, FLPR, FLPLm, FLPRm",
      "In Nemanode: FLP"
    ],
    "In Wormbase": "FLP, FLPL, FLPR",
    "Lineage": "AB plapaaapad, AB prapaaapad",
    "Location": "Head",
    "Description": "Name originally derived from \"FLAP\". Not part of a sensillum. FLP neurons are multidendritic with an arborization structure very similar to PVD neurons (Hall and Treinin, 2011; Hall and Altun, 2008). Topologically they cover head and neck, while PVD neurons cover the rest of the body (Hall and Altun, 2008). Their primary dendrites have ciliated endings in head which are not open to outside. They wrap around a branch of the lateral ILso cell just below the region where the socket cell surrounds the IL neurons.",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "FLP-4; FMRFamide-like neuropeptide",
      "FLP-21; FMRFamide-like neuropeptide",
      "(Loer and Rand, 2022; Li and Kim, 2008;Lee et al., 1999)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-7",
      "INX-10a (only in dauer)",
      "INX-14",
      "INX-18a",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "DEG-3; alpha subunit of nicotinic acetylcholine receptor",
      "DEL-1; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit)",
      "DES-2; alpha subunit of nicotinic acetylcholine receptor",
      "GLR-4; putative non-NMDA ionotropic glutamate receptor subunit",
      "MEC-10; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit), part of a mechanosensory transduction channel that senses low-threshold stimuli (gentle body touch)",
      "OSM-9; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)-cation selective; among \"thermoTRPs\" (TRPA, TRPM, TRPV)",
      "PDFR-1; G-protein coupled class B subfamily B1 hormone receptor, orthologous to drosophila pigment dispensing factor receptors and human CALCR",
      "UNC-8; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit)",
      "(Wormbase; Altun, 2011; Brockie et al., 2001; Treinin. et al., 1998; Colbert et al., 1997; Tavernarakis et al., 1997; Treinin and Chalfie, 1995; Huang and Chalfie, 1994)",
      "Function:",
      "Harsh nose touch response; nose-on collision with an object such as an eyelash initiates backward movement of C. elegans. Three classes of mechanosensory neurons (ASH, FLP, and OLQ) act in parallel to mediate this response. Each sensory neuron class accounts for a fraction of the normal response, as follows: ASH, 45%; FLP, 29%; and OLQ, 5%. The remaining responses (~10%) are mediated by the ALM and AVM neurons, which sense anterior body touch (Goodman, 2006; Kaplan and Driscoll, 1997)",
      "FLP neurons also respond to gentle nose touch and activate an escape behavior (Chatzigeorgiou and Schafer, 2011). OLQ and CEP neurons indirectly facilitate gentle nose touch responses in the FLP nociceptors via the RIH interneuron which acts as the integrating neuron of this circuit hub (Chatzigeorgiou and Schafer, 2011).",
      "AFD and FLP neurons in the head, and PHC neurons in the tail sense noxious temperatures (thermonociception) (~35-38oC) inducing a reflex-like escape reaction (temperature avoidance response). This avoidance response requires the cell autonomous function of cGMP dependent cyclic nucleotide-gated channels (TAX-2, TAX-4) in AFD, and the heat- and capsaicin-sensitive Transient Receptor Potential Vanilloid (TRPV) channels (OCR-2/OSM-9) in the FLP and PHC neurons (Liu et al., 2012)."
    ],
    "Reporters": [
      "At CGC: CF702muIs32 [mec-7p::GFP + lin-15(+)], also expressed in touch receptor neurons",
      "Other:"
    ]
  },
  "HSN": {
    "Type": "Motor neuron",
    "Connectivity": [
      "In MoW: HSN",
      "In WormWiring: HSNLh, HSNRh",
      "In Nemanode: HSN"
    ],
    "In Wormbase": "HSN, HSNL, HSNR",
    "Lineage": "AB plapppappa, AB prapppappa",
    "Location": "Midbody, close to vulva",
    "Description": [
      "Hermaphrodite specific motor neurons, which die in male embryo. The HSNs are generated in the tail of the embryo and then migrate anteriorly to positions near the middle of the animal in both sexes. Therefore, it appears that the decision for cell death in male is not made at the time that the cells are born (Sulston et al., 1983). HSNR axon travels in the right fascicle of VNC, whereas HSNL axon travels in the left side. Axon outgrowth begins during L2 and L3 and is guided by the epithelial cells of the developing vulva and processes of the ventral nerve cord (PVP and PVQ processes). Vulval precursor cells guide the emerging HSN processes ventrally. They also organize the two HSN processes to join the ventral nerve cord in two separate fascicles and induce them to defasciculate from the ventral nerve cord and branch at the vulva (Garriga et al.,1993). Synapse formation takes place in the L3 and L4 stages.",
      "For a more detailed anatomical description of HSN neurons also refer to Reproductive System-Egg-laying apparatus."
    ],
    "Neurotransmitter/ Neuropeptide": [
      "Serotonin",
      "Acetylcholine - after late L4",
      "NLP-3; neuropeptide-like protein",
      "NLP-8; neuropeptide-like protein",
      "NLP-15; neuropeptide-like protein",
      "FLP-5; FMRFamide-like neuropeptide",
      "(Pereira et al., 2015; Loer and Rand, 2022; Duerr et al., 2008; Nathoo et al., 2001; Sze et al., 2000; Desai et al., 1988; Duerr et al., 1999; Rand and Nonet, 1997; M. Barr; K. Kim and C. Li, pers. comm.)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-3",
      "INX-7",
      "INX-10a",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "ACR-14; nicotinic AChR non-alpha subunit",
      "MEC-6; part of the degenerin/epithelial Na+channel complex - interacts physically with the MEC-4 degenerin ion channel",
      "GAR-2; G protein-linked (muscarinic) acetylcholine receptor",
      "Possibly GLR-5; kainate-type ionotropic glutamate receptor subunit",
      "Possibly GGR-2; GABA-A/glycine receptor-like protein",
      "(Fox et al., 2005; Chelur et al., 2002; Brockie et al., 2001; Lee et al., 2000; Fujiwara et al., 1996)"
    ],
    "Function": [
      "Egg-laying: Laser ablation of HSN neurons and mutants lacking HSN reduced egg-laying while optogenetic activation of HSN stimulates egg-laying (Trent et al., 1983; Emtage et al., 2012)",
      "Locomotion: HSN modulates locomotion speed occurring in association with egg-laying behavior (Hardaker et al., 2001; Huang et al., 2023)"
    ],
    "Reporters": [
      "At CGC: SK4013zdIs13 [tph-1p::GFP]IV",
      "Other:"
    ]
  },
  "I1": {
    "Type": [
      "Pharyngeal interneuron",
      "(also anterior sensory?)"
    ],
    "Connectivity": [
      "In MoW:",
      "In WormWiring: I1Lh, I1Rh",
      "In Nemanode: I1L, I1R"
    ],
    "In Wormbase": "I1, I1L, I1R",
    "Lineage": "AB alpapppaa, AB arapappaa",
    "Location": "Pharynx anterior bulb",
    "Description": "Pharyngeal interneurons. The anterior projections from these cells insert onto muscles pm1 and pm2s, and have a free subcuticular, proprioceptive-like (postulated sensory) ending at the anterior end. They also extend to the basement membrane here to receive input from the somatic RIP neurons. The posterior axonal projections of the I1s run within the subventral nerve cords and then run around the pharyngeal nerve ring to the dorsal side where they meet in gap junctions. The termination of the anterior projections in the dorsal pharyngeal nerve cord is variable (Albertson and Thomson, 1976).",
    "Neurotransmitter/Neuropeptide": [
      "Acetylcholine",
      "NLP-3; neuropeptide-like protein",
      "(Pereira et al., 2015; Loer and Rand, 2022; Duerr et al., 2008; Nathoo et al., 2001)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-18a",
      "UNC-7",
      "UNC-9 (Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-7; glutamate receptor subunit",
      "GLR-8; glutamate receptor subunit",
      "(Brockie et al., 2001)"
    ],
    "Function": [
      "Pharyngeal pumping modulator: In the absence of food, ablation of I1 neurons causes a reduction in pharyngeal pumping (Trojanowski et al., 2014).",
      "Response to light: Exposure to short wavelength light interrupts pharyngeal pumping. Ablation of the I1 neurons disrupts this response (Bhatla et al., 2015)."
    ],
    "Reporters": [
      "At CGC: OH4141zdIs21 [zag-1::GFP] IV",
      "Other:"
    ]
  },
  "I2": {
    "Type": [
      "Pharyngeal interneuron",
      "(also anterior sensory?)"
    ],
    "Connectivity": [
      "In MoW:",
      "In WormWiring: I2Lh, I2Rh",
      "In Nemanode: I2L, I2R"
    ],
    "In Wormbase": "I2, I2L, I2R",
    "Lineage": "AB alpappaapa, AB arapapaapa",
    "Location": "Pharynx anterior bulb",
    "Description": "Pharyngeal interneurons. At the most anterior end of the subventral nerve cords, I2s have proprioceptive-like free subcuticular endings slightly anterior to those of I1s. They are also coupled by gap junctions to M1 neurons and attach",
    "Neurotransmitter/Neuropeptide": [
      "Glutamate",
      "NLP-3; neuropeptide-like protein",
      "NLP-8; neuropeptide-like protein",
      "(Pereira et al., 2015; Nathoo et al., 2001)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-7; glutamate receptor subunit",
      "GLR-8; glutamate receptor subunit",
      "(Brockie et al., 2001)"
    ],
    "Function": "Unknown or redundant (Avery and Thomas, 1997)",
    "Reporters": [
      "At CGC: MT21910nEx2065 [gur-3p::GFP + lin-15(+)]",
      "Other:"
    ]
  },
  "I3": {
    "Type": [
      "Pharyngeal interneuron",
      "(also anterior sensory?)"
    ],
    "Connectivity": [
      "In MoW:",
      "In WormWiring: I3h",
      "In Nemanode: I3"
    ],
    "In Wormbase": "I3",
    "Lineage": "MS aaaaapaa",
    "Location": "Pharynx anterior bulb",
    "Description": "Anteriorly, I3 is inserted onto muscles pm1 and pm2 and terminates anterior to the dorsal gland cell duct with a proprioceptive-like ending. Posterior process terminates on the dorsal side of the nerve ring (Albertson and Thomson, 1976).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "NLP-3; neuropeptide-like protein",
      "(Pereira et al., 2015; Nathoo et al., 2001)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-9",
      "INX-10a",
      "INX-14",
      "INX-19",
      "UNC-7",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-7; glutamate receptor subunit",
      "GLR-8; glutamate receptor subunit",
      "(Brockie et al., 2001)"
    ],
    "Function": "Unknown or redundant (Avery and Thomas, 1997)",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "I4": {
    "Type": "Pharyngeal interneuron",
    "Connectivity": [
      "In MoW:",
      "In WormWiring: I4h",
      "In Nemanode: I4"
    ],
    "In Wormbase": "I4",
    "Lineage": "MS aaaapaa",
    "Location": "Pharynx posterior bulb",
    "Description": [
      "The soma of I4 is located on the dorsal side of the terminal bulb commissure. A branch from each side runs within the terminal bulb commissure and continues anteriorly to the nerve ring in the subventral nerve cords On the ventral side of the nerve ring, these processes cross over to the other side. The right branch travels dorsally around the left half of the nerve ring and ends buried in pm1. The left branch travels dorsally around the right side of the ring and terminates at the level of the right subdorsal apex of the pharyngeal lumen (Albertson and Thomson, 1976).",
      "Neurotransmitter/Neuropeptide: - Glutamate - NLP-3; neuropeptide-like protein - NLP-13; neuropeptide-like protein (Wang et al., 2024; Nathoo et al., 2001) Innexin expression:",
      "INX-2",
      "INX-10a",
      "UNC-9",
      "(Bhattacharya et al., 2019)",
      "Receptor expression: Function: - Unknown or redundant (Avery and Thomas, 1997)"
    ],
    "Neurotransmitter/Neuropeptide": [
      "Glutamate",
      "NLP-3; neuropeptide-like protein",
      "NLP-13; neuropeptide-like protein",
      "(Wang et al., 2024; Nathoo et al., 2001)"
    ],
    "Innexin expression": "",
    "Receptor expression": "",
    "Function": "Unknown or redundant (Avery and Thomas, 1997)",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "I5": {
    "Type": [
      "Pharyngeal interneuron (can also be a",
      "posterior-sensory neuron or both)"
    ],
    "Connectivity": [
      "In MoW:",
      "WormWiring: I5h",
      "In Nemanode: I5"
    ],
    "In Wormbase": "I5",
    "Lineage": "AB arapapapp",
    "Location": "Pharynx posterior bulb",
    "Description": "I5 has a very large cell body which is located on the ventral side of the terminal bulb. Two short branches come out of the cell body and split into anterior and posterior projections. At the level of the terminal bulb commissure, the anterior processes end on the cell bodies of M2 motor neurons and are linked to them by desmosomes. Posteriorly, the processes run between pm6 and pm7 and reach a subdorsal position adjacent to the subdorsal marginal cells. Each branch then travels anteriorly to the terminal bulb commissure where they fuse across the dorsal side. Ventrally, these also become attached to the cell bodies of M2 motor neurons by desmosomes. At the level of the subventral nerve cords, each branch turns anteriorly and travels to the nerve ring. They make a single closed loop within the nerve ring. A short anterior projection is also seen in the dorsal side of the nerve cord (Albertson and Thomson, 1976).",
    "Neurotransmitter/Neuropeptide": [
      "Glutamate",
      "Serotonin; low likelihood",
      "(Sawin et al., 2000; Lee et al., 1999; C. Loer pers. comm.)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-14",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": "",
    "Function": "M3 and I5 are suggested to facilitate bacterial trapping by regulating the relative duration of muscle relaxation in different regions of the pharynx (Avery, 1993). Pharyngeal relaxation becomes quicker when I5 is ablated. When both I5 and M3 are ablated there is a delay in relaxation that is indistinguishable from that caused by ablation of M3 alone, suggesting I5 slows down relaxation by inhibiting M3 (Avery and Thomas, 1997).",
    "Reporters": [
      "At CGC: NC3792ynIs37 [flp-13p::GFP] III. ufIs26 [unc-4p::mCherry + lin-15(+)]",
      "Other:"
    ]
  },
  "I6": {
    "Type": [
      "Pharyngeal interneuron",
      "(also posterior sensory?)"
    ],
    "Connectivity": [
      "In MoW:",
      "In WormWiring: I6h",
      "In Nemanode: I6"
    ],
    "In Wormbase": "I6",
    "Lineage": "MS paaapaa",
    "Location": "Pharynx posterior bulb",
    "Description": "A bipolar neuron. Its shorter process travels posteriorly, crosses from left to right subdorsally between pm6 and pm7, and then ends with a free subcuticular ending between pm5 and pm6. The longer process runs anteriorly from the cell body to enter the nerve ring from the dorsal nerve cord, where it terminates on the dorsal side (Albertson and Thomson, 1976).",
    "Neurotransmitter/Neuropeptide": "NLP-3; neuropeptide-like protein (Nathoo et al., 2001)",
    "Innexin expression": [
      "INX-10a",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-7; glutamate receptor subunit",
      "GLR-8; glutamate receptor subunit",
      "(Brockie et al., 2001)"
    ],
    "Function": "Unknown or redundant (Avery and Thomas, 1997)",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "IL1": {
    "Type": "Polymodal neuron (sensory neuron (mechanosensory), motor neuron, interneuron)",
    "In MoW": "IL1",
    "Male Wiring Project": "IL1LIL1RIL1DLIL1DRIL1VLIL1VR",
    "In Wormbase": "IL1L, IL1R, IL1DL, IL1DR, IL1VL, IL1VR",
    "Lineage": [
      "AB alapaappaa, AB alaappppaa,",
      "AB alapappaaa, AB alappppaaa,",
      "AB alppapppaa, AB arapppppaa"
    ],
    "Location": "Head",
    "Description": "Neurons of inner labial sensilla, ciliated endings with striated rootlets, synapse directly onto muscle cells. IL1 dendrite ending does not protrude through the hole in the socket cell to the outside.",
    "Neurotransmitter/Neuropeptide": [
      "Glutamate",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "INX-12",
      "INX-18",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "DEG-3; alpha subunit of a nicotinic acetylcholine receptor",
    "Function": "When worms are touched on either the dorsal or ventral sides of their nose with an eyelash, they interrupt the normal pattern of foraging and undergo an aversive head-withdrawal reflex. This simple reflex is mediated by two classes of mechanosensory neurons (OLQ and IL1) and their synaptic targets, the RMD motor neurons. Killing any of these cells, alone or in combination, diminishes the head withdrawal reflex. IL1, OLQ, and RMD also regulate spontaneous foraging movements. Laser operated animals lacking IL1 and OLQ forage abnormally slowly and make exaggerated dorsal and ventral nose turns (Goodman, 2006; Kaplan and Driscoll, 1997; Hart et al., 1995). See head withdrawal and foraging circuit.",
    "Embryonic development of IL1 neurons": "",
    "IL1 Sensory Endings": ""
  },
  "IL2": {
    "Type": "Sensory neuron (polymodal sensory?; chemosensory?, mechanosensory?)",
    "In MoW": "IL2",
    "Male Wiring Project": "IL2L, IL2R, IL2DL, IL2DR, IL2VL, IL2VR",
    "In Wormbase": "IL2L, IL2R, IL2DL, IL2DR, IL2VL, IL2VR",
    "Lineage": [
      "AB alapaappp, AB alaappppp",
      "AB alapappap, AB alappppap",
      "AB alppapppp, AB arapppppp"
    ],
    "Location": "Head",
    "Description": "Neurons of inner labial sensilla. They have ciliated endings without rootlets. IL2 dendrite ending protrudes through the hole in the socket cell to the outside, hence, it is suggested that IL2 neurons are chemosensory. Stains with DiI/Ca Acetate, DiO, Di4ANEPPS and RH421 ((Burket et al., 2006; Mille and Shakes, 1995). Although the six IL2 neurons have a similar gross structure and express many of the same genes, the lateral IL2s display different neuronal connectivity and morphology than the quadrant (dorsal & ventral) ones (Wang et al., 2010; MoW). IL2 neurons display neuroplasticity and stage-specific remodeling; dorsal and ventral IL2s undergo significant dendrite arborization and axon remodeling during dauer development while this remodeling is much less striking in lateral IL2s. When dauer larva are returned to favorable",
    "Neurotransmitter/Neuropeptide": [
      "Acetylcholine",
      "(N.B. Although earlier reports suggested IL2 might be glutamatergic, more recent studies showed it is not) (Serrano-Saiz et al., 2013; Lee et al., 1999; O. Hobert, pers. comm.)",
      "(Zhang et al, 2014; Loer, 2010; Duerr et al, 2008)"
    ],
    "Innexin expression": [
      "INX-18; in IL2L/R only",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": [
      "DES-2; alpha subunit of a nicotinic acetylcholine receptor",
      "NPR-1; neuropeptide Y receptor like protein (in IL2L/R)",
      "(Coates and de Bono, 2002; Treinin. et al., 2001)"
    ],
    "Function": "Regulates nictation, a dispersal behavior seen in dauer larva. Intact IL2 cilia and cholinergic transmission in the IL2 neurons are required for this function (Lee et al., 2012). Targeted activation of IL2 neurons in non-dauers does not induce nictation, possibly since IL2 neurons undergo a significant structural change at the dauer stage which may be required for control of this behavior (Albert and Riddle, 1983)",
    "Embryonic development of IL2 neurons": "",
    "IL2 Sensory Endings": ""
  },
  "LUA": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: LUA",
      "In WormWiring: LUALh, LUARh, LUALm, LUARm",
      "In Nemanode: LUA"
    ],
    "In Wormbase": "LUAL, LUAR",
    "Lineage": "AB plpppaapap, AB prpppaapap",
    "Location": "Left and right lumbar ganglia",
    "Description": "Interneuron",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "NLP-13; neuropeptide-like protein",
      "PDF-1; pigment dispensing factor homolog",
      "(Pereira et al., 2015; Barrios et al., 2012;",
      "Nathoo et al., 2001)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-2",
      "INX-7",
      "INX-11",
      "INX-13",
      "INX-14",
      "INX-18a",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-5; glutamate receptor subunit",
      "SER-2; tyramine receptor (a splice variant)",
      "(Tsalik et al., 2003; Brockie et al., 2001)"
    ],
    "Function": "Suggested to be a \"connector cell\" between the PLM touch receptors, with which they make gap junctions along the lumbar commissures, and AVA/D interneurons, with which they make chemical synapses in the ventral cord (Chalfie et al., 1985). However, laser ablation does not lead to any abnormalities of movement or touch sensitivity (Chalfie et al., 1985) and no role in tap-withdrawal reflex has been found (Wicks and Rankin, 1995).",
    "Reporters": [
      "At CGC:",
      "Other: XE2299 pha-1(e2123); wpEx389 [C39H7.2::NLS::GFP+pha-1]"
    ]
  },
  "M1": {
    "Type": "Pharyngeal motor neuron",
    "Connectivity": [
      "In MoW:",
      "In WormWiring: M1h",
      "In Nemanode: M1"
    ],
    "In Wormbase": "M1",
    "Lineage": "MS paapaaa",
    "Location": "Pharynx posterior bulb",
    "Description": "The cell body of M1 is located subdorsally between the muscle and right marginal cell. A single process runs anteriorly in this position to the nerve ring where it then joins the dorsal nerve cord. Upon reaching the level of pm1, the process splits into two to send a vesicle-filled process to each of the subventral nerve cords, synapsing on pm1 and pm2 before reaching the cords. These then run posteriorly for a short length and form synapses on pm2 and pm3 (Albertson and Thomson, 1976).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "NLP-3 ; neuropeptide-like protein",
      "(Loer and Rand, 2022; Duerr et al., 2008; Nathoo et al., 2001)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-5",
      "INX-7",
      "INX-10",
      "INX-13",
      "INX-14",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-2; ionotropic glutamate receptor subunit",
      "Possibly AVR-14; a subunit of the glutamate-gated chloride channel",
      "(Cook et al., 2006; Brockie and Maricq, 2006; Brockie et al., 2001)"
    ],
    "Function": "Unknown or redundant (Avery and Thomas, 1997)",
    "Reporters": [
      "At CGC:",
      "Other: YLC132 him-5;pepEx013 [Plury-1(3.4 kb)::mKate2, unc-122::gfp]"
    ]
  },
  "M2": {
    "Type": "Pharyngeal motor neuron",
    "Connectivity": [
      "In MoW:",
      "In WormWiring: M2Lh, M2RSh",
      "In Nemanode: M2"
    ],
    "In Wormbase": "M2, M2L, M2R",
    "Lineage": "AB araapappa, AB araappppa",
    "Location": "Pharynx posterior bulb",
    "Description": "M2L/R are a pair of unipolar neurons with processes which run anteriorly in the subventral nerve cords. After making synapses on pm5, these processes travel past the pharyngeal nerve ring without changing course. They then travel dorsally piercing through pm4 while making motor synapses on pm4 along this course. These are one of the two pharyngeal neuron pairs (the other pair is M3) that do not make their dorsal turn within the nerve ring but more anteriorly within the muscle cells. They terminate in gap junctions to each other when they meet on the dorsal side (Albertson and Thomson, 1976).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "FLP-18; FMRFamide-related neuropeptide (FaRP)",
      "FLP-21; FMRFamide-related neuropeptide (FaRP)",
      "NLP-3; neuropeptide-like protein",
      "NLP-13; neuropeptide-like protein",
      "(Loer and Rand, 2022; Duerr et al., 2008; Rogers et al., 2003; Nathoo et al., 2001)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-12",
      "INX-13",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": "",
    "Function": "Unknown or redundant (Avery and Thomas, 1997; Chiang et al., 2002)",
    "Reporters": [
      "At CGC:",
      "Other: YLC132 him-5;pepEx013 [Plury-1(3.4 kb)::mKate2, unc-122::gfp]"
    ]
  },
  "M3": {
    "Type": "Pharyngeal motor neuron (also possibly proprioceptive sensory)",
    "Connectivity": [
      "In MoW:",
      "In WormWiring: M3Lh, M3Rh",
      "In Nemanode: M3"
    ],
    "In Wormbase": "M3, M3L, M3R",
    "Lineage": "AB araapappp, AB araappppp",
    "Location": "Pharynx posterior bulb",
    "Description": "M3s are a bilaterally symmetric pair of inhibitory glutamatergic neurons with output to the metacorpus and possibly the isthmus. They are bipolar neurons with a posterior dendrite and an anterodorsal axon. The posterior process is approximately 5 µm and makes an occasional single synapse to pm5. The anterior projection of these cells grows past the nerve ring, and sends one branch to the dorsal side through pm4 similar to the process of M2 neuron. An additional branch runs posteriorly between pm4 and pm5 at the outside of the pharynx to just behind the nerve ring and terminates with neuromuscular synapses on the posterior edge of pm4. The branches to the dorsal side make no neuromuscular synapses along their dorsal trajectory, but similar to the two subventral branches, they pass posteriorly between pm4 and pm5 at the dorsal edge of the pharynx and form synapses on pm4 behind the nerve ring (Albertson and Thomson, 1976).",
    "Neurotransmitter/ Neuropeptide": [
      "Betaine",
      "Glutamate",
      "FLP-18; FMRFamide-related neuropeptide (FaRP)",
      "NLP-3; neuropeptide-like protein",
      "(Wang et al., 2024; Rogers et al., 2003; Nathoo et al., 2001; Lee et al., 1999; Radice and Visser, 1996)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-3",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-8; glutamate receptor subunit",
      "NPR-1; neuropeptide Y receptor like protein",
      "(Coates and de Bono, 2002; Brockie et al., 2001)",
      "Function:",
      "M3s modulate the timing of pharyngeal relaxation in corpus and promote rapid relaxation of the pharyngeal muscle following contraction. When M3s are decoupled from the pharyngeal muscle by mutating the postsynaptic receptor (a glutamate-gated chloride channel partly encoded by avr-15) for M3 neurotransmission, the duration of pharyngeal contraction increases (Dent et al., 1997). Each M3 is suggested to be proprioceptive and fire in response to corpus muscle contraction, which, in turn, induces inhibitory postsynaptic potentials (repolarization) and relaxation of the muscle. This relaxation seems to be important for effective transport of bacteria within the lumen (Avery and Thomas, 1997). Exogenous serotonin mimics the presence of food and induces rapid contraction-relaxation cycles with shortened action potentials in pharynx. This effect is dependent on MC and M3 neurons (see model below) (Niacaris and Avery, 2003)."
    ],
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "M4": {
    "Type": "Pharyngeal motor neuron",
    "Connectivity": [
      "In MoW:",
      "In WormWiring: M4h",
      "In Nemanode: M4"
    ],
    "In Wormbase": "M4",
    "Lineage": "MS paaaaaa",
    "Location": "Pharynx anterior bulb",
    "Description": "The cell body of M4 is located dorsally at the level of the nerve ring.M4 sends two ventral branches, which run around the nerve ring on each side. These processes then cross to the other side and continue to run posteriorly in the subventral nerve cords. In the isthmus, M4 makes neuromuscular synapses on pm5. The two processes turn dorsally in the terminal bulb commissure, meet each other in gap junctions and run anteriorly in the dorsal nerve cord for some variable distance through the isthmus before ending. These also make synapses on pm5 on the dorsal side. Unlike other pharyngeal motor neurons, M4 contains darkly-staining vesicles, similar to the 65 nm dense core vesicles associated with some amphidial neurones (Albertson and Thomson, 1976).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "Glutamate - weak",
      "FLP-21; FMRFamide-related neuropeptide (FaRP)",
      "(Pereira et al., 2015; Duerr et al., 2008; Rogers et al., 2003; Rand and Nonet, 1997-Appendix 2; O. Hobert pers comm.)"
    ],
    "Innexin expression": [
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-14",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "SER7b; G-alpha(s) coupled 5-HT7-like receptor",
      "GLR-8; glutamate receptor subunit",
      "(Hobson et al., 2003; Brockie et al., 2001)"
    ],
    "Function": "-M4 is essential for feeding in wild-type worms. M4 synapses on the isthmus and the terminal bulb, and is necessary for posterior isthmus peristalsis (Avery and Thomas, 1997). Worms lacking M4 continue pumping, however, bacteria become trapped in corpus and anterior isthmus and these worms fail to grow since they can not pass the food to their intestines.",
    "Reporters": [
      "At CGC: OH16144 nIs177 (ceh-28::4xNLS::GFP)",
      "Other:"
    ]
  },
  "M5": {
    "Type": "Pharyngeal motor neuron",
    "Connectivity": [
      "In MoW:",
      "In WormWiring: M5h",
      "In Nemanode: M5"
    ],
    "In Wormbase": "M5",
    "Lineage": "MS paaapap",
    "Location": "Pharynx posterior bulb",
    "Description": "M5 is located subdorsally on the left, posterior to pm7. It sends one dorsal and one ventral process. Dorsal process makes a half circle running behind pm7. The two processes then cross on the ventral side and run anteriorly adjacent to the ventral marginal cell until they reach the terminal bulb commissure. The processes pass under the cell bodies of motor neurons M2 and continue to meet in gap junctions on the dorsal side of the terminal bulb commissure. Along the way they also send short, posterior branches which run on either side of the subdorsal marginal cells (Albertson and Thomson, 1976).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "FLP-1; FMRFamide-like peptide",
      "(Duerr et al., 2008; Nelson et al., 1998; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "INX-2",
      "INX-7 only in dauer",
      "INX-10a",
      "INX-14",
      "INX-18a only in dauer",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-8; glutamate receptor subunit",
      "(Brockie et al., 2001)"
    ],
    "Function": "Unknown or redundant (Avery and Thomas, 1997)",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "MC": {
    "Type": "Pharyngeal motor neuron (also putative sensory)",
    "Connectivity": [
      "In MoW:",
      "In WormWiring: MCLh, MCRh",
      "In Nemanode: MC"
    ],
    "In Wormbase": "MC, MCL, MCR",
    "Lineage": "AB alpaaappp, AB arapaappp",
    "Location": "Pharynx anterior bulb",
    "Description": "MC's are a pair of cholinergic excitatory (motor) neurons. Anteriorly, they have free subcuticular (putative proprioceptive) endings between pm3 and pm4. Posteriorly, each cell sends a process which enters the pharyngeal nerve ring from the pharyngeal subventral nerve cord and makes a loop around the nerve ring.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine (weak)",
      "FLP-21; FMRFamide-related neuropeptide (FaRP)",
      "(Rogers et al., 2003; Niacaris and Avery, 2003; Rand and Nonet, 1997-Appendix 2; Raizen et al., 1995)"
    ],
    "Innexin expression": [
      "INX-1b",
      "INX-2",
      "INX-3",
      "INX-7",
      "INX-10a",
      "INX-18a only in dauer",
      "INX-19",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-8; glutamate receptor subunit",
      "(Brockie et al., 2001)"
    ],
    "Function": "MC's control the frequency of pharyngeal pumping (Avery and Thomas, 1997). They initiate pharyngeal muscle action potentials, and hence, function as pacemakers of pumping. Release of Ach from MC neurons stimulates the muscle via a postsynaptic nicotinic ACh receptor encoded by eat-2 (Niacaris and Avery, 2003; McKay et al., 2004). In eat-2 mutants, MC is decoupled from pharyngeal muscle and the pharynx is unable to pump rapidly in the presence of food. Modulators of pharyngeal pumping such as exogenous serotonin mostly act through MC neurons.",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "MI": {
    "Type": "Pharyngeal motor neuron, interneuron",
    "Connectivity": [
      "In WormWiring: MIh",
      "In Nemanode: MI"
    ],
    "In Wormbase": "MI",
    "Lineage": "AB araappaaa",
    "Location": "Pharynx anterior bulb",
    "Description": "MI is a unipolar neuron which is located in the dorsal nerve cord, anterior to the pharyngeal nerve ring. Its process makes a",
    "Neurotransmitter/ Neuropeptide": [
      ":",
      "Glutamate",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "INX-2",
      "INX-7",
      "INX-10a",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": "",
    "Function": "Unknown or redundant (Avery and Thomas, 1997)",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "NSM": {
    "Type": "Pharyngealneurosecretory, motor, sensory (proprioceptive/mechanosensory) neuron",
    "Connectivity": [
      "In WormWiring: NSMLh, NSMRh",
      "In Nemanode: NSM"
    ],
    "In Wormbase": "NSM, NSML, NSMR",
    "Lineage": "AB araapapaav, AB araapppaav",
    "Location": "Pharynx anterior bulb",
    "Description": "NSM cell bodies are located in the pharyngeal subventral nerve cords just anterior to the nerve ring. These cells are bipolar with one major process from each cell bifurcating near the cell body to two thick processes. There is also a third, long, thin process that originates from the cell body and possibly functions as proprioceptive (Axang et al., 2008). One of the two main branches crosses to the opposite side, turns dorsally within the nerve ring and continues its trajectory posteriorly within the dorsal nerve cord",
    "Neurotransmitter/ Neuropeptide": [
      "Betaine",
      "Serotonin",
      "NLP-13; neuropeptide-like protein",
      "NLP-18; neuropeptide-like protein",
      "NLP-19; neuropeptide-like protein",
      "[N.B. According to recent studies, glutamate does not seem to be a neurotransmitter in NSMs, although some weak and variable EAT-4 (VGluT) expression was noted in a previous work (Lee et al., 1999; O. Hobert, pers. comm.)]",
      "(Wang et al., 2024; Nathoo et al., 2001; Horvitz et al., 1982; Sze et al., 2000)"
    ],
    "Innexin expression": [
      "CHE-7 only in dauer",
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-14",
      "INX-19",
      "UNC-7 only in dauer",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GLR-7; glutamate receptor subunit",
      "GLR-8; glutamate receptor subunit",
      "SER-2; a splice variant of the tyramine receptor",
      "Possibly AEX-2; G protein-coupled receptor",
      "(Tsalik et al., 2003; Round et al., 2002; Brockie et al., 2001)"
    ],
    "Function": [
      "These neurons were suggested to have neurohumoral function signaling the presence of food to the body since NSM's appear secretory by morphology and have processes that run in close apposition to the pseudocoelom over most of their lengths (Albertson and Thomson, 1976, Avery and Thomas, 1997).",
      "They were postulated to sense bacteria in the pharynx lumen by their proprioceptive endings and transmit this (presence of food) to the rest of the body by secretions to the pseudocoelomic fluid. The presence of food works as a signal for increased pharyngeal pumping, decreased locomotion and increased egg-laying behavior. Exogenous application of serotonin also induces these responses supporting the hypothesis NSM's can function neurohumorally by serotonin secretion. However, ablation of NSM's have only subtle effects on pumping suggesting they may not play any important role in this behavior (Avery et al., 1993, Avery and Thomas, 1997).",
      "May modulate \"the enhanced slowing response\"; when placed on a bacterial lawn, previously food-deprived animals slow down their locomotion to a higher degree compared to well-fed animals. When NSM's are ablated there is a small but significant decrease in the enhanced slowing response suggesting NSM's contribute to this behavior (Sawin et al., 2000)."
    ],
    "Reporters": [
      "At CGC: LX837vsIs45 [tph-1::GFP]",
      "Other:"
    ]
  },
  "OLL": {
    "Type": "Sensory neuron (mechanosensory)",
    "Connectivity": [
      "In MoW: OLL",
      "In WormWiring: OLLLh, OLLRh, OLLLm, OLLRm",
      "In Nemanode: OLL"
    ],
    "In Wormbase": "OLL, OLLL, OLLR",
    "Lineage": "AB alppppapaa, AB praaapapaa",
    "Location": "Head",
    "Description": "Neurons of outer labial lateral sensilla, ciliated endings with striated rootlets. Sister cells of OLL neurons undergo apoptosis.",
    "Neurotransmitter/Neuropeptide": [
      "Glutamate",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "PDFR-1; pigment dispersing factor (PDF-1) receptor",
      "SER-2 a splice variant of the tyramine receptor",
      "(Barrios et al., 2012; Tsalik et al., 2003)"
    ],
    "Function": [
      "Similar to ADE, PDE, CEP, FLP, IL1, OLQ neurons, OLL neurons have been connected to mechanosensation(Inglis et al., 2007).",
      "OLL neurons negatively regulate pathogen avoidance as laser ablation of these neurons leads to enhanced pathogen-avoidance behavior (Chang et al., 2011)."
    ],
    "Reporters": [
      "At CGC: OH16719otIs138 [ser-2p3 + rol-6(su1006)] X; otIs521 [eat-4prom8::tagRFP + ttx-3::GFP]",
      "Other:"
    ],
    "Embryonic development of OLL neurons": "",
    "OLL Sensory Endings": ""
  },
  "OLQ": {
    "Type": "Polymodal neuron (sensory neuron - mechanosensory, interneuron)",
    "Connectivity": [
      "In MoW: OLQ",
      "In WormWiring: OLQDLh, OLQDRh, OLQVLh, OLQVRh, OLQDLm, OLQDRm, OLQVLm",
      "In Nemanode: OLQ"
    ],
    "In Wormbase": "OLQ, OLQDL, OLQDR, OLQVL, OLQVR",
    "Lineage": [
      "AB alapapapaa, AB alapppapaa",
      "AB plpaaappaa, AB prpaaappaa"
    ],
    "Location": "Head",
    "Description": "Neurons of outer labial lateral sensilla. Their dendrites have ciliated endings with striated rootlets and terminate embedded within the cuticle of the nose.",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "(Lee et al., 1999)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-10a",
      "INX-14",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "OCR-4; TRPV (transient receptor potential channel, vanilloid subfamily; mammalian capsaicin receptor-like channel)",
      "OSM-9; transient receptor potential (TRPV) ion channel protein",
      "NPR-1; receptor for flp-18- and flp-21-encoded peptides",
      "TRPA-1; transient receptor potential (TRPA) ion channel protein",
      "(Wormbase; Altun, 2011; Kindt et al., 2007; Coates and de Bono, 2002; Tobin et al., 2002; Colbert et al.,1997)"
    ],
    "Function": [
      "IL1, OLQ, and RMD regulate spontaneous foraging movements; in the presence of food, C. elegans makes rapid nose oscillations termed 'foraging' as they explore their environment. Laser operated animals lacking IL1 and OLQ forage abnormally slowly and make exaggerated dorsal and ventral nose turns (Hart et al., 1995; Kaplan and Driscoll, 1997; Goodman, 2006). See head withdrawal and foraging circuit.",
      "When worms are touched on the ventral or dorsal side of the nose during forward movement they respond with an aversive head movement away from the stimulus, termed the head-withdrawal reflex. This simple reflex is mediated by two classes of mechanosensory neurons (OLQ and IL1) and their synaptic targets, the RMD motor neurons. Killing any of these cells, alone or in combination, diminishes this reflex (Kaplan and Driscoll, 1997; Kindt et al., 2007).TRPA-1 function in IL1 and OLQ and GLR-1 function in RMD neurons facilitate both foraging rate and head withdrawal (Kindt et al., 2007)."
    ],
    "Embryonic development of OLQ neurons": "",
    "OLQ Sensory Endings": ""
  },
  "PDA": {
    "Type": "Motor neuron",
    "Connectivity": [
      "In MoW: PDA",
      "In WormWiring: PDAhPDAm",
      "In Nemanode: PDA"
    ],
    "In Wormbase": "PDA",
    "Lineage": "AB prpppaaaa (in herm), Y.a (in male)",
    "Location": "Preanal ganglion",
    "Description": "During the second larval stage (L2), the rectal epithelial cell Y withdraws from the epithelium, migrates anterodorsally, and then becomes the PDA neuron through a transdifferentiation event while P12.pa, born at the end of the L1 stage just anterior to the position of Y, replaces Y in the rectum, completing the toroid with B epithelial cell. (Sulston and Horvitz 1977). The dorsal cord process of PDA ends in the posterior part of the body. In male, Y divides and the anterior daughter becomes PDA. Hermaphrodites and males exhibit some differences in PDA connectivity.",
    "Neurotransmitter/ Neuropeptide": [
      "Betaine",
      "Acetylcholine",
      "(Wang et al., 2024; Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-10a",
      "INX-14",
      "INX-18a",
      "UNC-9",
      "(Altun et al., 2009; Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "EXP-1; excitatory GABA receptor subunit",
      "UNC-8; a DEG/ENaC family member homologous to subunits of a candidate mechanically gated ion channel",
      "(Beg and Jorgensen, 2003, also pers. comm.; Tavernarakis et al., 1997)"
    ],
    "Function": "Innervates posterior dorsal body wall muscles",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "PDB": {
    "Type": [
      "Motor neuron in the hermaphrodite",
      "Motor neuron and interneuron in the male"
    ],
    "Connectivity": [
      "At CGC:",
      "Other:"
    ],
    "In Wormbase": "PDB",
    "Lineage": "P12.apa",
    "Location": "Preanal ganglion",
    "Description": "Born postembryonically. Sends process towards tail which turns around and joins dorsal cord in hermaphrodites. PDB process exhibits elaborate branching in the male (Jarrell et al., 2012; WormWiring). PDB has identical connectivity to male-specific neuron PDC.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": "Makes gap junctions to multiple partners but major gap junctions are to EF1, EF2, PDC, AVL, PHB, DA08 (Jarrell et al., 2012; WormWiring)",
    "Receptor expression": [
      "UNC-8, a DEG/ENaC family member homologous to subunits of a candidate mechanically gated ion channel",
      "(Tavernarakis et al., 1997)"
    ],
    "Function": [
      "Innervates posterior dorsal body wall muscles. Likely controls mating posture in males along with male-specific PVV and PDC neurons.",
      "(Koo et al., 2011)"
    ]
  },
  "PDE": {
    "Type": "Sensory neuron",
    "Connectivity": [
      "In MoW: PDE",
      "In WormWiring: PDELh, PDERh",
      "In Nemanode: PDE"
    ],
    "In Wormbase": "PDEL, PDER",
    "Lineage": "V5L.paaa, V5R.paaa",
    "Location": "Posterior half of the body",
    "Description": "Postembryonically born. Posterior deirid neurons. Function as sensory receptors located next to dorsal body wall muscle along the lateral side of the posterior body.",
    "Neurotransmitter/ Neuropeptide": [
      "Dopamine",
      "Glutamate",
      "(Wang et al., 2024; Lints and Emmons, 1999)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-5",
      "INX-10a",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "DOP-2",
      "(Suo et al., 2003)"
    ],
    "Function": "When well-fed C. elegans hermaphrodites are washed clean of bacteria and then reintroduced to the bacterial lawn, they move more slowly than when transferred to an environment without bacteria. This behavior is described as \"basal slowing response\". The three classes of dopaminergic neurons (CEPs, ADEs, and PDEs) function redundantly to sense the mechanosensory stimulus from bacteria and mediate the motor circuit to control this behavioral change (Sawin et al., 2000).",
    "Reporters": [
      "At CGC: OH7193otIs181 [dat-1::mCherry + ttx-3::mCherry]",
      "Other:"
    ]
  },
  "PHA": {
    "Type": "Sensory neuron (chemosensory)",
    "In MoW": "PHA",
    "Connectivity": [
      "In WormWiring: PHALh, PHALm, PHARm",
      "In Nemanode: PHA"
    ],
    "In Wormbase": "PHA, PHAL, PHAR",
    "Lineage": "AB plpppaapp, AB prpppaapp",
    "Location": "Right and left lumbar ganglia",
    "Description": "Phasmid neurons - ciliated, exposed to outside environment",
    "Neurotransmitter/Neuropeptide": [
      "Glutamate",
      "NLP-7; neuropeptide-like protein",
      "NLP-14; neuropeptide-like protein",
      "(Pereira et al., 2015; Nathoo et al., 2001)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-13",
      "INX-19 (NSY-5)",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019; Schumacher et al., 2012; Altun et al., 2009)"
    ],
    "Receptor expression": [
      "GCY-12; guanylyl cyclase",
      "OCR-2; TRPV channel proteins",
      "OSM-9; TRPV channel protein",
      "NPR-1; neuropeptide Y receptor like protein",
      "PDFR-1; pigment dispersing factor (PDF-1) receptor",
      "SRG-13; G protein-coupled serpentine receptor",
      "SRB-6; G protein-coupled serpentine receptor",
      "(Barrios et al., 2012; Coates and de Bono, 2002; Tobin et al., 2002; Colbert et al., 1997; Yu et al., 1997; Troemel et al., 1995)"
    ],
    "Function": [
      "Modulate chemorepulsion behavior in worms (Hilliard et al., 2002)",
      "Part of the neuronal circuit that functions in mate-searching behavior of males(Barrios et al., 2012)"
    ],
    "Reporters": [
      "At CGC: OH16065otIs355 [rab-3p::2xNLS::TagRFP] IV. otIs747 [srg-13p::GFP]. PHA neurons are labeled with GFP and RFP",
      "Other:"
    ]
  },
  "PHB": {
    "Type": "Sensory neuron (chemosensory)",
    "Connectivity": [
      "In MoW: PHB",
      "In WormWiring: PHBLh, PHBRh, PHBLm, PHBRm",
      "In Nemanode: PHB"
    ],
    "In Wormbase": "PHB, PHBL, PHBR",
    "Lineage": "AB plapppappp, AB prapppappp",
    "Location": "Right and left lumbar ganglia",
    "Description": "Phasmid neurons",
    "Neurotransmitter/Neuropeptide": [
      "Glutamate",
      "Serotonin; low likelihood",
      "NLP-1; neuropeptide-like protein",
      "(Pereira et al., 2015; Nathoo et al., 2001; Sawin et al., 2000; C. Loer, pers. comm.)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-11",
      "INX-13",
      "INX-18a",
      "INX-19 (NSY-5)",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019; Schumacher et al., 2012; Altun et al., 2009)"
    ],
    "Receptor expression": [
      "OCR-2; TRPV channel proteins",
      "OSM-9; TRPV channel protein",
      "NPR-1; neuropeptide Y receptor like protein",
      "SRB-6; G protein-coupled serpentine receptor",
      "(Coates and de Bono, 2002; Tobin et al., 2002; Colbert et al., 1997; Troemel et al., 1995)"
    ],
    "Function": "Modulate chemorepulsion behavior in worms (Hilliard et al., 2002)",
    "Reporters": [
      "At CGC: BL5717inIs179 [ida-1p::GFP]. GFP is expressed in a subset of neurons and the neuroendocrine uv1 cells of the vulva",
      "Other:"
    ]
  },
  "PHC": {
    "Type": "Sensory neuron (thermosensory/ thermonociceptor, mechanosensory?)",
    "Connectivity": [
      "In MoW: PHC",
      "In WormWiring: PHCLh, PHCRh, PHCLm, PHCRm",
      "In Nemanode: PHC"
    ],
    "In Wormbase": "PHC, PHCL, PHCR",
    "Lineage": "TL.pppaa, TR.pppaa",
    "Location": "Right and left lumbar ganglia",
    "Description": "Possibly sensory in tail spike. PHC neurons contain striated rootlets in the male but not in the hermaphrodite (Sulston et al., 1980). Postembryonically born.",
    "Neurotransmitter/ Neuropeptide": [
      "Betaine",
      "Glutamate",
      "(Wang et al., 2024; Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-11",
      "INX-14",
      "INX-19",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "DOP-1; dopamine receptor",
      "(Sanyal et al., 2004)"
    ],
    "Function": [
      "Thermonociception & temperature avoidance response; along with AFD and FLP neurons (in the head), PHC neurons (in the tail) sense noxious temperatures (~35-38oC), inducing a reflex-like escape reaction. This avoidance response requires the cell autonomous function of cGMP dependent Cyclic Nucleotide-Gated channels (TAX-2, TAX-4) in AFD, and the heat- and capsaicin-sensitive Transient Receptor Potential Vanilloid (TRPV) channels (OCR-2/OSM-9) in the FLP and PHC neurons (Liu et al., 2012).",
      "Structure and location suggests mechanosensory function"
    ],
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "PLM": {
    "Type": "Sensory neuron (mechanosensory)",
    "Connectivity": [
      "In MoW: PLM",
      "In WormWiring: PLMLh, PLMRh, PLMLm, PLMRm",
      "In Nemanode: PLM"
    ],
    "In Wormbase": "PLM, PLML, PLMR",
    "Lineage": "AB plapappppaa, AB prapappppaa",
    "Location": "Lumbar ganglia",
    "Description": "Posterior lateral microtubule cells, aka touch receptor neurons. Send ventrally directed processes to ventral cord.",
    "Neurotransmitter/Neuropeptide": [
      "Glutamate",
      "(Lee et al., 1999)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-13",
      "INX-14",
      "INX-18a",
      "UNC-9",
      "(Bhattacharya et al., 2019; Altun et al., 2009)"
    ],
    "Receptor expression": [
      "DEG-3; alpha subunit of nicotinic acetylcholine receptor",
      "DES-2; alpha subunit of nicotinic acetylcholine receptor",
      "DOP-1; D1-like dopamine receptor",
      "GLR-8; ionotropic glutamate receptor subunit (unclassifiable as NMDA or non-NMDA)",
      "MEC-2; stomatin-like protein required to sense touch, part of a mechanotransduction channel complex that senses low-threshold stimuli (gentle body touch)",
      "MEC-4; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit). - part of a mechanosensory transduction channel - core component of a mechanosensory transduction channel that senses low-threshold stimuli (gentle body touch)",
      "MEC-6; part of the degenerin/epithelial Na+channel complex - interacts physically with the MEC-4 degenerin ion channel",
      "MEC-9; provides an extracellular attachment point for the mechanosensory channels in touch cells",
      "PDFR-1; pigment dispersing factor (PDF-1) receptor",
      "(Wormbase; Barrios et al., 2012; Sanyal et al., 2004; Chelur et al., 2002; Brockie et al., 2001; Treinin. et al., 1998; Du et al., 1996; Lai et al., 1996; Huang et al., 1995; Treinin and Chalfie, 1995)",
      "Function:",
      "Along with AVM and ALM, PLM neurons sense gentle (low threshold) mechanical stimulus to the body and provide input to the command (inter) neurons (PVC, AVB, AVD, AVA) via both synaptic connections and gap junctions (see mechanosensory circuit in C.elegans Book II and circuit for escape response in Pirri and Alkema, 2011). The touch cells form gap junctions with agonist interneurons and chemical synapses with the antagonist interneurons (see locomotory circuit). Hence, in the neural circuit of the escape response, the posterior touch cells PLML/R form gap junctions with the forward movement interneuron PVC, but they provide synaptic input to the backward movement interneurons AVA and AVD(Goodman, 2006; Chalfie et al.,1985; Kaplan and Driscoll, 1997).",
      "Along with other TRNs, PLM neurons are involved in memory formation for habituation to tap response both for massed training with 12-hr memory retention and spaced training with 48-hr memory retention (Li et al., 2013). Long-term memory for tap habituation requires protein synthesis, the transcription factor CREB and the AMPA-type glutamate receptor subunit GLR-1 in the postsynaptic AVA and AVD interneurons of the tap withdrawal circuit, while 12-hr memory is correlated with a FLP-20-dependent increase of synaptic vesicles in the terminals of the PLM mechanosensory neurons and likely other TRNs (Timbers and Rankin, 2011; Li et al., 2013)."
    ],
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "PLN": {
    "Type": "Sensory neuron (minor oxygen-sensory), interneuron",
    "Connectivity": [
      "In MoW: PLN",
      "In WormWiring: PLNLh, PLNRh, PLNLm, PLNRm",
      "In Nemanode: PLN"
    ],
    "In Wormbase": "PLN, PLNL, PLNR",
    "Lineage": "TL.pppap, TR.pppap",
    "Location": "Lumbar ganglia",
    "Description": "Postembryonically born. The processes of PLN's run closely associated with those of PLM's in the posterior half of the animal. At midbody, they join the ventral sublateral cords via bilateral, short ventrally directed commissures. Anteriorly, they enter the ventral cord via amphidial commissures.",
    "Neurotransmitter/Neuropeptide": [
      "Acetylcholine",
      "(Loer and Rand, 2022; Duerr et al., 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-13",
      "INX-14",
      "INX-18a",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019; Altun et al., 2009)"
    ],
    "Receptor expression": [
      "DOP-1 dopamine receptor",
      "(Tsalik et al., 2003)",
      "Function:",
      "Soluble guanylate cyclase (sGC, e.g. GCY-35 and GCY-36)-expressing oxygen-sensing neurons (URX, AQR, PQR, SDQ, BDU, ALN, and PLN) mediate the avoidance of high O2 levels (Zimmer et al., 2009). URX appears to be the most important member of this group, since its activity is uniquely important for aggregation (Coates and de Bono, 2002), while for aerotactic behavior in an O2 gradient, URX is redundant with other sGC-expressing neurons (Chang et al., 2006)."
    ],
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "PQR": {
    "Type": "Sensory neuron (oxygen- and minor CO2-sensory)",
    "Connectivity": [
      "In MoW: PQR",
      "In WormWiring: PQR",
      "In Nemanode: PQR"
    ],
    "In Wormbase": "PQR",
    "Lineage": "QL.ap",
    "Location": "Left Lumbar ganglia",
    "Description": [
      "Postembryonically born from the left Q neuroblast (QL) and migrates posteriorly to a position near the phasmid neurons in the left lumbar ganglion. Single neuron with basal body. It is directly exposed to the pseudocoelomic body fluid (internal environment of the animal). An anterior process projects into preanal gangion and usually ends just posterior to the vulva, although can be slightly shorter or longer. Posterior process is ensheathed by PHso2L cell.",
      "See a 3-D reconstruction of PQR by R. Newbury & Moerman lab. (Cell labels are shown below. 3-D movie was created from confocal images of a strain expressing the GFP marker linked to the promoter for ZC53.7 using Zeiss LSM 5 Pascal software v. 3.2.)"
    ],
    "Neurotransmitter/Neuropeptide": [
      "Glutamate",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-7",
      "INX-10a",
      "INX-11",
      "INX-18a",
      "UNC-9",
      "(Bhattacharya et al., 2019)"
    ],
    "Receptor expression": [
      "GCY-32; guanylyl cyclase",
      "GCY-35; guanylyl cyclase which binds molecular oxygen and mediates oxygen sensation",
      "NPR-1; neuropeptide Y receptor like protein",
      "PDFR-1; pigment dispersing factor receptor ortholog",
      "(Barrios et al., 2012; Gray et al., 2004; Coates and de Bono, 2002; Yu et al., 1997)",
      "Function:",
      "Functions in aerotaxis, and along with AQR, URX and AUA regulate social feeding (or aggregation on a bacterial lawn) and bordering (the accumulation of animals on the thickest part of a bacterial lawn) behavior. Suppressing the activity of AQR, PQR and URX neurons inhibits social feeding (Coates and de Bono, 2002). AQR, PQR and URX function as sensors of environmental oxygen which is a quantitative regulator of social feeding (Gray et al., 2004). Studies indicate that animals that carry the npr-1 (215F) allele or that lack npr-1 function tend to dwell (slow down) in low ambient O2 and roam (disperse) or aggregate in high ambient O2. In this model, drops in O2 lead to increased activity of a GCY-35/GCY-36 heterodimeric soluble guanylate cyclase. Rising cGMP, in turn, opens the TAX-2/TAX-4 cGMP-gated ion channel in AQR, PQR and URX leading to their depolarization and when the food is present, strong suppression of roaming behavior (Cheung et al., 2005). In npr-1 mutants these neurons are thought to be hyperactive (see URX page for a full description).",
      "AQR, PQR and URX suppress innate immunity via NPR-1, which regulates both PMK-1-dependent and PMK-1-independent immune responses (Styer et al., 2008). Since URX, AQR, PQR are exposed to pseudocoelomic fluid, they are hypothesized to communicate neuroendocrine signals to nonneural tissues involved in innate immunity defense responses.",
      "AQR, PQR and URX are weak CO2-sensors and contribute to CO2 avoidance (main CO2 sensors are AFD, BAG and ASE) (Bretscher et al., 2011).",
      "Part of the neuronal circuit that functions in mate-searching behavior of males(Barrios et al., 2012)"
    ],
    "Reporters": [
      "At CGC: ZG629iaIs22 [gcy-36p::GFP + unc-119(+)]",
      "Other:"
    ]
  },
  "PVC": {
    "Type": "Ventral cord interneuron",
    "Connectivity": [
      "In MoW: PVC",
      "In WormWiring: PVCLh, PVCRh, PVCLm, PVCRm",
      "In Nemanode: PVC"
    ],
    "In Wormbase": "PVC, PVCL, PVCR",
    "Lineage": "AB plpppaapaa, AB prpppaapaa",
    "Location": "Tail - lumbar ganglion",
    "Description": "PVC processes enter the nerve cord via the lumbar commissures and run on the right side of the hypodermal ridge in the nerve cord. PVCL process decussates posterior to the excretory pore and enters the nerve ring on the left side, while PVCR process enters the ring on the right. They run near the middle of the neuropil to make a full turn within the nerve ring before ending ventrally on the opposite side.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Pereira et al., 2015; Duerr et al., 2008)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-2",
      "INX-7",
      "INX-10a",
      "INX-13",
      "INX-14",
      "INX-18a",
      "INX-19",
      "UNC-7",
      "UNC-9"
    ],
    "Receptor expression": [
      "PDFR-1; pigment dispersing factor (PDF-1) receptor",
      "(Barrios et al., 2012)"
    ],
    "Function": [
      "Command interneuron",
      "Functions as command interneuron for forward locomotion; drives forward movement of the animal along with AVB.",
      "Modulates response to harsh touch to tail. Harsh tail touch induces Ca2+ increases in PVC, which are higher than those evoked by gentle touch, and a harsh touch defect is seen in the absence of PVC neurons. PVC may be sensing the stimulus directly or indirectly through other neurons (Li et al., 2011)."
    ],
    "Reporters": [
      "At CGC: OH16749ynIs54 [flp-20p::GFP] IV. hdIs32 [glr-1::DsRed2]",
      "Other:"
    ]
  },
  "PVD": {
    "Type": "Sensory neuron (polymodal nociceptive for mechanosensation and thermosensation)",
    "Connectivity": [
      "At CGC: NC3182otIs181[dat-1::mCherry + ttx-3::mCherry] III. otIs138[ser-2(prom3)::GFP + rol-6(su1006)] X. otIs396 [ace-1prom2::NLS::tagRFP]",
      "Other:"
    ],
    "In Wormbase": "PVD, PVDL, PVDR",
    "Lineage": "V5L.paapa, V5R.paapa",
    "Location": "Tail - lumbar ganglion",
    "Description": "Postembryonically born (see V lineage). PVDL/R have extensive branching pattern in adult animals. In early larval stages 3 major processes are discerned; one anteriorly directed, one posteriorly directed and one ventrally directed. The anteriorly- and posteriorly-directed processes show short extensions and branches along their length at this stage. As the animal ages, starting from L2, this branching pattern is elaborated extensively by growth and retraction, finally forming well-ordered, repeating menorah-like units at L4 (Oren-Suissa et al., 2010). The quaternary branches of these menorahs are about 30-60 nm in diameter.",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "NLP-11; neuropeptide-like protein",
      "(Nathoo et al., 2001; Lee et al., 1999)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-5",
      "INX-7",
      "INX-10a",
      "INX-12",
      "INX-14",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019; Altun et al., 2009)"
    ],
    "Receptor expression": [
      "DEG-3; alpha subunit of a nicotinic acetylcholine receptor",
      "DEGT-1; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit) - part of a mechanosensory transduction channel. Colocalizes with MEC-10 on the primary and tertiary branches of PVD.",
      "DES-2; alpha subunit of a nicotinic acetylcholine receptor",
      "GLR-4; glutamate receptor subunit",
      "MEC-6; part of the degenerin/epithelial Na+channel complex - interacts physically with the MEC-4 degenerin ion channel",
      "MEC-9; provides an extracellular attachment point for the mechanosensory channels in touch cells",
      "MEC-10; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit). - part of a mechanosensory transduction channel. Colocalizes with DEGT-1 on the primary and tertiary branches of PVD.",
      "OSM-9; transient receptor potential (TRPV) ion channel protein",
      "SER-2; splice variant of the tyramine receptor",
      "TRPA-1; transient receptor potential ion channel (TRPA, TRPM and TRPV ion channel families are considered \"thermoTRPs\" that sense temperature\"). Activation of TRPA-1 in cold-sensitive neurons and the intestine is required for cold-induced longevity via DAF-16.",
      "(Wormbase; Xiao et al., 2013; Altun, 2011; Kindt et al., 2007; Tsalik et al., 2003; Rex and Komuniecki, 2002; Brockie et al., 2001; Chelur et al., 2002; Colbert et al., 1997; Treinin et al., 1998; Treinin and Chalfie, 1995; Huang and Chalfie, 1994; Du et al., 1996)"
    ],
    "Function": "PVD neurons are multidendritic nociceptors that respond to harsh touch (as stretch-sensing mechanosensor) and cold temperatures (cold hyperalgesia). Animals in which PVD neurons are laser-ablated fail to respond to harsh touch to the central region of the body but can respond to harsh touch to the head and tail tap. The harsh touch modality specifically requires the DEG/ENaC proteins MEC-10 and DEGT-1, while responses to cold require the TRPA-1 channel and are MEC-10- and DEGT-1-independent. Hence, polymodal nociception in PVD neurons involves parallel sensory transduction channels (Chatzigeorgiou et al., 2010; Way and Chalfie, 1989). It has been suggested that application of a harsh mechanical stimulus stretches the tertiary processes by displacing the quarternary branches, which do not contain any mechanosensory ion channels themselves. The pulling force transmitted to the tertiary processes leads to local DEG/ENaC opening in primary and tertiary neurites instead (See image below; Hall and Treinin, 2011). PVD is possibly not involved in the circuit that mediates suppression of pharyngeal pumping in response to a touch stimulus in adults (Keane and Avery, 2003)."
  },
  "PVM": {
    "Type": "Sensory neuron (mechanosensory)",
    "Connectivity": [
      "In MoW: PVM",
      "In WormWiring: PVMh, PVMm",
      "In Nemanode: PVM"
    ],
    "In Wormbase": "PVM",
    "Lineage": "QL.paa",
    "Location": "Lateral - left side of the posterior half of the body",
    "Description": "Postembryonically born (AVM and PVM are generated at about 9 hours after hatching at 20°C, about 19 hours after egg deposition). Posterior ventral microtubule cell. In the L1 stage, PVM extends a process that first grows ventrally along a commissure on the left side of the posterior body and then turns anteriorly when it reaches the ventral nerve cord (VNC). Within VNC the PVM process runs anteriorly on the ventral side adjacent to the cuticle. PVM is an unbranched unipolar neuron.",
    "Neurotransmitter/Neuropeptide": "",
    "Innexin expression": [
      "INX-1a",
      "INX-1b",
      "INX-7",
      "UNC-9",
      "(Bhattacharya et al., 2019; Altun et al., 2009)"
    ],
    "Receptor expression": [
      "GAR-1; G protein-linked muscarinic acetylcholine receptor",
      "MEC-2; stomatin-like protein required to sense touch, part of a mechanotransduction channel complex that senses low-threshold stimuli (gentle body touch)",
      "MEC-4; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit) - part of a mechanosensory transduction channel - core component of a mechanosensory transduction channel that senses low-threshold stimuli (gentle body touch)",
      "MEC-6; part of the degenerin/epithelial Na+channel complex - interacts physically with the MEC-4 degenerin ion channel",
      "MEC-9; provides an extracellular attachment point for the mechanosensory channels in touch cells",
      "MEC-10; mechanically gated ion channel subunit; amiloride-sensitive Na+ channel (ASC) protein (DEG/ENaC subunit) - part of a mechanosensory transduction channel - core component of a mechanosensory transduction channel that senses low-threshold stimuli (gentle body touch)",
      "UNC-8; a DEG/ENaC family member homologous to subunits of a candidate mechanically-gated, cation-specific ion channel",
      "PDFR-1; pigment dispersing factor (PDF-1) receptor",
      "(Wormbase; Barrios et al., 2012; Altun, 2011; Chelur et al., 2002; Lee et al., 2000; Tavernarakis et al., 1997; Du et al., 1996; Lai et al., 1996; Huang and Chalfie, 1994)"
    ],
    "Function": [
      "PVM is ultrastructurally very similar to the other touch cells, and its differentiation is controlled by the same genetic pathway that controls differentiation of the other five touch receptor neurons. However, PVM does not mediate a locomotory response to gentle touch (Chalfie and Sulston, 1981) and does not appear to have a critical role in touch sensitivity (for discussion see Kaplan and Driscoll, 1997; Goodman, 2006).",
      "It is postulated to be a stretch receptor."
    ],
    "Reporters": [
      "At CGC: TU6276uIs115 [mec-17p::RFP]. kuIs70 [alr-1p::GFP + rol-6(su1006)]",
      "Other:"
    ]
  },
  "PVN": {
    "Type": "Interneuron, motor neuron",
    "In MoW": "PVN",
    "Connectivity": [
      "In WormWiring: PVNLh, PVNRh, PVNLm, PVNRm",
      "In Nemanode: PVN"
    ],
    "In Wormbase": "PVN, PVNL, PVNR",
    "Lineage": "TL.appp, TL.appp",
    "Location": "Tail",
    "Description": "Postembryonically born. Processes enter the preanal ganglion via lumbar commissures.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "Betaine",
      "Glutamate",
      "PDF-1; pigment dispensing factor homolog",
      "(Wang et al., 2024; Pereira et al., 2015; Barrios et al., 2012)"
    ],
    "Innexin expression": [
      "INX-1b",
      "INX-5",
      "INX-7",
      "INX-10a",
      "INX-13",
      "INX-14",
      "INX-18a",
      "INX-18b",
      "INX-19",
      "UNC-9",
      "(Bhattacharya et al., 2019; Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "PVP": {
    "Type": "Interneuron",
    "In MoW": "PVP",
    "Connectivity": [
      "In WormWiring: PVPLh, PVPRh",
      "In Nemanode: PVP"
    ],
    "In Wormbase": "PVP, PVPL, PVPR",
    "Lineage": "AB plppppaaa, AB prppppaaa",
    "Location": "Pre-anal ganglion",
    "Description": "Interneuron. Differences in connectivity observed between hermaphrodites and males. In hermaphrodites PVP neurites were observed to make branches around the vulva suggesting they may form synapses with egg-laying muscles (Hobert and Hall, 1999). The PVPL/PVPR processes cross over in the pre-anal ganglion and then grow forward on the opposite side of the cord to the nerve ring. The PVPL process invariably crosses in front of the PVPR process. PVPL and PVPR somas are nearly opposite one another in the embryo and early larval stages. However, in the adult, this symmetry and order is lost and cells are situated almost linearly within PAG (Durbin, 1987).",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Duerr et al., 2008)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-3",
      "INX-7",
      "INX-10",
      "INX-14",
      "INX-18a",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019; Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "PVPR pioneers the left tract of the ventral cord and this function appears to be a joint action of PVPR and PVQL processes; PVQ axons pioneer the lumber commissures and continue to travel alongside the PVP processes in the VNC (Durbin, 1987; Wadsworth and Hedgecock, 1996; Wadsworth et al., 1996). When PVPR precursor is ablated in the embryo, PVQL and AVKR growth cones migrate towards the right side (Durbin, 1987; Antebi et al., 1997).",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "PVQ": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: PVQ",
      "In WormWiring: PVQLh, PVQRh, PVQLm, PVQRm",
      "In Nemanode: PVQ"
    ],
    "In Wormbase": "PVQ, PVQL, PVQR",
    "Lineage": "AB plapppaaa, AB prapppaaa",
    "Location": "Right and left lumbar ganglia",
    "Description": "Interneurons, project along ventral cord to ring. PVQL axon travels in the left tract while PVQR axon travels in the right track.",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "INX-1a",
      "INX-2",
      "INX-3",
      "INX-7",
      "INX-10a",
      "INX-13",
      "INX-14",
      "INX-18a",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019; Altun et al., 2009)"
    ],
    "Receptor expression": [
      "DOP-1; D1-like dopamine receptor",
      "Possibly GGR-1; GABA-A/glycine receptor-like protein",
      "GLR-1; glutamate receptor subunit",
      "GLR-5; glutamate receptor subunit - SRA-6; G protein-coupled seven transmembrane receptor",
      "SER-1; serotonin receptor",
      "PDFR-1; pigment dispersing factor (PDF-1) receptor",
      "(Wormbase; Barrios et al., 2012; Altun, 2011; Dernovici et al., 2007; Carnell et al., 2005; Tsalik et al., 2003; Brockie et al., 2001; Fujiwara et al., 1996; Troemel et al., 1995)"
    ],
    "Function": "Pioneering of the left tract of the ventral cord appears to be a joint action of PVPR and PVQL processes; PVQ axons pioneer the lumber commissures and continue to travel alongside the PVP processes in the VNC (Durbin, 1987; Wadsworth and Hedgecock, 1996; Wadsworth et al., 1996). When PVPR precursor is ablated in the embryo, PVQL and AVKR growth cones migrate towards the right side (Durbin, 1987; Antebi et al., 1997).",
    "Reporters": [
      "At CGC: XE2263oyIs14 [sra-6p::GFP] V. wpEx369 [sra-6p::mito::TagRFP + odr-1p::RFP]",
      "Other:"
    ]
  },
  "PVR": {
    "Type": "Interneuron",
    "Connectivity": [
      "In MoW: PVR",
      "In WormWiring: PVRh, PVRm",
      "In Nemanode: PVR"
    ],
    "In Wormbase": "PVR",
    "Lineage": "C aappa",
    "Location": "Right lumbar ganglion",
    "Description": "The posteriorly directed process of PVR runs through the tail spike to nearly the end. This process may be a sensory dendrite.",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "CHE-7",
      "INX-1a",
      "INX-1b",
      "INX-2",
      "INX-3",
      "INX-7",
      "INX-8",
      "INX-9",
      "INX-10a",
      "INX-13",
      "INX-14",
      "INX-18a",
      "UNC-7",
      "UNC-9",
      "(Bhattacharya et al., 2019; Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "May function in modulation of pharyngeal pumping by the touch circuitry as it makes gap junctions to ALM and PLM neurons and synapses onto RIP(Chalfie et al.,1985; Albertson and Thomson, 1976)",
    "Reporters": [
      "At CGC:",
      "Other:"
    ]
  },
  "PVT": {
    "Type": "Interneuron",
    "In MoW": "PVT",
    "Male Wiring Project": "PVT",
    "In Wormbase": "PVT",
    "Lineage": "AB plpappppa",
    "Location": "Pre-anal ganglion",
    "Description": "Interneuron, projects along ventral cord to ring. Hermaphrodites and males exhibit some differences in PVT connectivity",
    "Neurotransmitter/ Neuropeptide": [
      "PDF-1; pigment dispensing factor homolog",
      "(Barrios et al, 2012)"
    ],
    "Innexin expression": [
      "INX-3",
      "INX-4 (aka CHE-7)",
      "INX-7",
      "INX-17",
      "INX-18",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": [
      "SER-1; serotonin receptor (ortholog of mammalian 5-HT2R)",
      "SER-2 ; a splice variant of the tyramine receptor (variable expression)"
    ],
    "Function": "Midline neuroblast, secretes UNC-6, serves as a guidepost neuron to guide growing axons from the lumbar ganglia in the posteriormost region of the ventral cord. When PVT is ablated embryonically, these axons follow multiple routes to enter the ventral cord instead of making tight bundles (Antebi et al., 1997; Ren et al., 1999). Postembryonically, PVT functions to keep the ventral cord fascicles intact. Early larval ablation of PVT induces axons of AVKL/R, PVQL/R, HSNL/R and RMEV to aberrantly cross the ventral midline (Aurelio et al., 2002)"
  },
  "PVW": {
    "Type": "Interneuron",
    "In MoW": "PVW",
    "Male Wiring Project": "PVWL, PVWR",
    "In Wormbase": "PVW, PVWL, PVWR",
    "Lineage": "TL.ppa, TR.ppa",
    "Location": "Righ and left lumbar ganglion",
    "Description": "Postembryonically born",
    "Neurotransmitter/ Neuropeptide": "",
    "Innexin expression": [
      "INX-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": [
      "Possibly PDFR-1; pigment dispersing factor (PDF-1) receptor",
      "(Barrios et al., 2012)"
    ],
    "Function": ""
  },
  "RIA": {
    "Type": "Interneuron",
    "In MoW": "RIA",
    "Male Wiring Project": "RIAL, RIAR",
    "In Wormbase": "RIA, RIAL, RIAR",
    "Lineage": "AB alapaapaa, AB alaapppaa",
    "Location": "Head",
    "Description": "These neurons receive synaptic inputs from AIY and AIZ interneurons and densely innervate head motor neurons SMD and RMD",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": "Although MoW shows no gap junctions for RIA neurons, and no innexin expression has yet been detected in RIA neurons in the hermaphrodite, the Wormwiring Project shows both hermaphrodite RIAL/RIAR and male RIAL/RIAR make gap junctions",
    "Receptor expression": [
      "SER-1 serotonin receptor",
      "(Dernovici et al, 2007; Carnell et al, 2005)"
    ],
    "Function": "RIM, RIA and RIB are classified as the"
  },
  "RIB": {
    "Type": "Interneuron",
    "In MoW": "RIB",
    "Male Wiring Project": "RIBL, RIBR",
    "In Wormbase": "RIB, RIBL, RIBR",
    "Lineage": "AB plpaappap, AB prpaappap",
    "Location": "Head",
    "Description": [
      "Head interneurons that make gap junctions to multiple other neuron classes",
      "Neurotransmitter/ Neuropeptide: - Acetylcholine - very weak",
      "(Pereira et al., 2015)",
      "Innexin expression: - UNC-9 (Altun et al., 2009) Receptor expression:"
    ],
    "Neurotransmitter/ Neuropeptide": "Acetylcholine - very weak",
    "Innexin expression": [
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "RIM, RIA and RIB are classified as the \"second layer\" interneurons in the process of integration of information from the outside world and the inner state of the animal, which then leads to a behavioral response."
  },
  "RIC": {
    "Type": "Interneuron",
    "In MoW": "RIC",
    "Male Wiring Project": "RICL, RICR",
    "In Wormbase": "RIC, RICL, RICR",
    "Lineage": "AB plppaaaapp, ABprppaaaapp",
    "Location": "Head",
    "Description": "Octopaminergic interneurons",
    "Neurotransmitter/ Neuropeptide": [
      "Octopamine",
      "(Alkema et al., 2005)"
    ],
    "Innexin expression": [
      "INX-4 (aka CHE-7)",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": [
      "SER-1; serotonin receptor",
      "(Dernovici et al, 2007; Carnell et al, 2005)"
    ],
    "Function": "Dopaminergic CEP neurons are presynaptic to both the octopaminergic RIC neurons and the SIA neurons. In the absence of food octopamine is released from the RIC neurons and humorally activates the octopamine receptor SER-3 in the cholinergic SIA neurons (in the absence of food, activation of DAF-3 by loss of DAF-7 signaling leads to increased octopamine signaling from the RIC neurons and the cyclic AMP response element binding protein becomes activated in SIA). Dopamine signaling suppresses octopamine signaling through a mechanism that requires two D2-like dopamine receptors DOP-2 and DOP-3 , located on both the SIA neurons and RIC neurons (Suo et al., 2009)"
  },
  "RID": {
    "Type": "Motor neuron, interneuron",
    "In MoW": "RID",
    "Male Wiring Project": "RID",
    "In Wormbase": "RID",
    "Lineage": "AB alappaapa",
    "Location": "Head",
    "Description": "Single neuron, situated in the dorsal ganglion. RID sister undergoes apoptosis during embryonic development. RID has a short dorsal process and a long ventral process. In 90% of animals the ventral process of RID runs down on the left side of the NR and enters the VNC on the same side. In the remaining 10% it runs down on the right side and enters the nerve ring on the right (pers. comm. M. Zhen; Wang et al., 2016). The process then exits the VNC via the same-side amphid commissure and continues as a commissure to reach the DC and runs along the length of the DC",
    "Neurotransmitter/ Neuropeptide": "",
    "Innexin expression": "",
    "Function": ""
  },
  "RIF": {
    "Type": "Interneuron",
    "In MoW": "RIF",
    "Male Wiring Project": "RIFL, RIFR",
    "In Wormbase": "RIF, RIFL, RIFR",
    "Lineage": "AB plppapaaap, AB prppapaaap",
    "Location": "Head, retrovesicular ganglion",
    "Description": "RIF processes cross over to the opposite side within the ventral cord and enter the nerve ring on the other side (Durbin, 1987.) They meet at the midline of the nerve ring but do not make gap junctions to each other",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "PDFR-1; pigment dispersing factor (PDF-1) receptor",
      "(Barrios et al., 2012)"
    ],
    "Function": ""
  },
  "RIG": {
    "Type": "Interneuron",
    "In MoW": "RIG",
    "Male Wiring Project": "RIGL, RIGR",
    "In Wormbase": "RIG, RIGL, RIGR",
    "Lineage": "AB plppappaa, AB prppappaa",
    "Location": "Head, retrovesicular ganglion",
    "Description": "RIG processes cross over to the opposite side within the ventral cord and enter the nerve ring on the other side (Durbin, 1987)",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": [
      "INX-4",
      "(Altun et al., 2009)"
    ],
    "Function": ""
  },
  "RIH": {
    "Type": "Interneuron",
    "In MoW": "RIH",
    "Male Wiring Project": "RIH",
    "In Wormbase": "RIH",
    "Lineage": "AB prpappaaa",
    "Location": "Head",
    "Description": "RIH has a single, large cell body situated on the ventral midline at the anterior end of the ventral ganglion",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "Serotonin - may be absorbing (and then releasing) rather than synthesizing serotonin",
      "(Pereira et al., 2015; Sze et al., 2000)"
    ],
    "Innexin expression": "",
    "Function": ""
  },
  "RIM": {
    "Type": "Motor neuron, interneuron",
    "In MoW": "RIM",
    "Male Wiring Project": "RIML, RIMR",
    "In Wormbase": "RIM, RIML, RIMR",
    "Lineage": "AB plppaapap, AB prppaapap",
    "Location": "Lateral ganglia of head",
    "Description": "RIM neurons send processes into the nerve ring via amphid commissures. They innervate muscles in the head via NMJs in the nerve ring",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "Tyramine",
      "(Loer, 2010; Alkema et al., 2005)"
    ],
    "Innexin expression": [
      "INX-4",
      "(Altun et al., 2009)"
    ],
    "Function": "RIM, RIA and RIB are classified as the \"second layer\" interneurons in the process of integration of information from the outside world and the inner state of the animal, which then leads to a behavioral response."
  },
  "RIP": {
    "Type": "Ring/Pharynx interneuron",
    "In MoW": "RIP",
    "Male Wiring Project": "RIPL, RIPR",
    "In Wormbase": "RIP, RIPL, RIPR",
    "Lineage": "AB alpapaaaa, AB arappaaaa",
    "Location": "Head",
    "Description": "Anterior processes of RIP neurons run in the lateral labial process bundles and enter the pharynx close to its anterior end. Gap junctions between RIPL/R neurons and the pharyngeal I1's, as well as possible gap junctions between RIPL/R and the pharyngeal motor neuron, M1 constitute the only connection between the pharyngeal nervous system and the somatic nervous system.",
    "Neurotransmitter/ Neuropeptide": "",
    "Innexin expression": [
      "INX-4",
      "UNC-9",
      "(Altun et al, 2009)"
    ],
    "Receptor expression": "",
    "Function": "Only connection between the phrayngeal and somatic nervous systems. In intact worms light touch sensed by the extrapharyngeal touch cells briefly inhibits pumping. When RIPs are ablated pharyngeal pumping becomes unresponsive to light touch (Avery and Thomas, 1997)."
  },
  "RIR": {
    "Type": "Ring interneuron",
    "In MoW": "RIR",
    "Male Wiring Project": "RIR",
    "In Wormbase": "RIR",
    "Lineage": "AB prpapppaa",
    "Location": "Head",
    "Description": "Single neuron with a cell body situated in the ventral ganglion",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": "",
    "Function": ""
  },
  "RIS": {
    "Type": "Interneuron",
    "In MoW": "RIS",
    "Male Wiring Project": "RIS",
    "In Wormbase": "RIS",
    "Lineage": "AB prpappapa",
    "Location": "Ventral ganglion, right side",
    "Description": "Single ring interneuron with a cell body situated on the right side of the ventral ganglion behind the excretory duct.",
    "Neurotransmitter/ Neuropeptide": [
      "GABA",
      "(Eastman et al., 1999)"
    ],
    "Innexin expression": [
      "INX-6",
      "INX-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": [
      "GLR-1; glutamate receptor subunit",
      "SER-4; serotonin receptor",
      "DOP-1 ; dopamine receptor",
      "(Tsalik et al., 2003; Hart et al., 1995)"
    ],
    "Function": ""
  },
  "RIV": {
    "Type": "Polymodal (interneuron, motor neuron)",
    "In MoW": "RIV",
    "Male Wiring Project": "RIVL, RIVR",
    "In Wormbase": "RIV, RIVL, RIVR",
    "Lineage": "AB plpaapaaa, AB prpaapaaa",
    "Location": "Head",
    "Description": "Cell bodies are situated subdorsally in the lateral ganglia",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": "",
    "Function": "Functions in locomotion: After animals are removed from bacterial food, they initiate a local search behavior consisting of reversals and deep omega-shaped turns. This is followed by dispersal ~30 min later as reversal and turns are suppressed. Local search behavior is triggered by AWC olfactory neurons, ASK gustatory neurons, and AIB interneurons while dispersal is promoted"
  },
  "RMD": {
    "Type": "Motor neuron",
    "In MoW": "RMD",
    "Male Wiring Project": "",
    "In Wormbase": "RMD, RMDDL, RMDDR, RMDL, RMDR, RMDVL, RMDVR",
    "Lineage": [
      "AB alpapapaa, AB arappapaa, AB alpppapad, AB praaaapad, AB alppapaaa,",
      "AB arapppaaa"
    ],
    "Location": "Head",
    "Description": "Ring motor neurons which innervate muscles in the head via NMJs in the nerve ring",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Although earlier reports suggested RMD might be glutamatergic, more recent studies showed it is not)",
      "(Serrano-Saiz et al., 2013; Ohnishi et al., 2011; Loer, 2010; Duerr et al., 2008)"
    ],
    "Innexin expression": [
      "UNC-7",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": [
      "GLR-1; AMPA-type ionotropic glutamate receptor",
      "(Maricq et al., 1995)"
    ],
    "Function": [
      "IL1, OLQ, and RMD regulate spontaneous foraging movements; in the presence of food, C. elegans makes rapid nose oscillations termed 'foraging' as they explore their environment. Laser operated animals lacking IL1 and OLQ forage abnormally slowly and make exaggerated dorsal and ventral nose turns (Hart et al., 1995; Kaplan and Driscoll, 1997; Goodman, 2006.) See head withdrawal and foraging circuit.",
      "When worms are touched on the ventral or dorsal side of the nose during forward movement they respond with an aversive head movement away from the stimulus, termed the head-withdrawal reflex. This simple reflex is mediated by two classes of mechanosensory neurons (OLQ and IL1) and their synaptic targets, the RMD motor neurons. Killing any of these cells, alone or in combination, diminishes this reflex (Kaplan and Driscoll, 1997; Kindt et al., 2007.)TRPA-1 function in IL1 and OLQ and GLR-1 function in RMD neurons facilitate both foraging rate and head withdrawal (Kindt et al., 2007.)"
    ]
  },
  "RME": {
    "Type": "Motor neuron",
    "In MoW": "RME",
    "Male Wiring Project": [
      "RMED, RMEL, RMER,",
      "RMEV"
    ],
    "In Wormbase": "RME, RMED, RMEL, RMER, RMEV",
    "Lineage": [
      "AB alapppaap, AB alaaaarlp,",
      "AB alaaaarrp, AB plpappaaa"
    ],
    "Location": "Head",
    "Description": "Ring motor neurons which innervate head muscles with NMJs in the nerve ring",
    "Neurotransmitter/ Neuropeptide": "GABA",
    "Innexin expression": [
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": [
      "ACR-14; nicotinic AChR non-alpha subunit",
      "AVR-15; glutamate-gated chloride channel subunit (only in RMED and RMEV)",
      "GLR-1 ; glutamate receptor subunit (only in RMEL and RMER)",
      "PDFR-1; pigment dispersing factor (PDF-1) receptor (only in RMED and RMEV)",
      "-SER-2; a splice variant of the tyramine receptor",
      "(Barrios et al., 2012; Fox et al., 2005; Tsalik et al., 2003; Dent et al., 1997; Hart et al., 1995)"
    ],
    "Function": "Suggested to be the pioneers of the nerve ring (Antebi et al., 1997)"
  },
  "RMF": {
    "Type": "Motor neuron",
    "In MoW": "RMF",
    "Male Wiring Project": "RMFL, RMFR",
    "In Wormbase": "RMF, RMFL, RMFR",
    "Lineage": "G2.al, G2.ar",
    "Location": "Head",
    "Description": "Postembryonic neurons, born in late L2 stage",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": "None yet reported, although described to have gap junctions in adult animals (MoW)",
    "Receptor expression": "",
    "Function": ""
  },
  "RMG": {
    "Type": "Interneuron",
    "In MoW": "RMG",
    "Male Wiring Project": "RMGL, RMGR",
    "In Wormbase": "RMG, RMGL, RMGR",
    "Lineage": "AB plapaaapp, AB prapaaapp",
    "Location": "Head",
    "Description": "RMG neurons innervate muscles in the head via NMJs in the nerve ring",
    "Neurotransmitter/ Neuropeptide": [
      "PDF-1; pigment dispensing factor homolog",
      "(Barrios et al, 2012)"
    ],
    "Innexin expression": [
      "UNC-7",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "Functions as the center of a hub-and-spoke circuit, which works bidirectionally due to gap junctions, for pheromone attraction and social behavior. RMG is suggested to integrate signals from various sensory neurons, and, in turn, set the activity state for these neurons, modulating their chemosensory responses (Macosco et al., 2009; Lockery, 2009)."
  },
  "RMH": {
    "Type": "Motor neuron",
    "In MoW": "RMH",
    "Male Wiring Project": "RMHL, RMHR",
    "In Wormbase": "RMH, RMHL, RMHR",
    "Lineage": "G1.l, G1.r",
    "Location": "Head",
    "Description": "Postembryonic neurons, born in L1 stage",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Pereira et al., 2015)"
    ],
    "Innexin expression": "None yet reported, although described to have gap junctions in adult animals (MoW)",
    "Receptor expression": "",
    "Function": ""
  },
  "SAA": {
    "Type": "Interneuron, (sublateral) motor neuron",
    "In MoW": "SAA",
    "Male Wiring Project": "SAADL, SAADR, SAAVL, SAAVR",
    "In Wormbase": "SAA, SAADL, SAADR, SAAVL, SAAVR",
    "Lineage": [
      "AB alppapapa, AB arapppapa,",
      "AB plpaaaaaa, AB prpaaaaaa"
    ],
    "Location": "Head",
    "Description": "SAA neurons send their processes anteriorly within the sublateral cords in the head",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "PDF-1; pigment dispensing factor homolog",
      "(Barrios et al, 2012;Loer, 2010; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": "None yet reported, although described to have gap junctions in adult animals (MoW)",
    "Receptor expression": "",
    "Function": ""
  },
  "SAB": {
    "Type": "Interneuron, (sublateral) motor neuron",
    "In MoW": "SAB",
    "Male Wiring Project": "SABD, SABVL, SABVR",
    "In Wormbase": "SAB, SABD, SABVL, SABVR",
    "Lineage": [
      "AB plppapaap, AB plppapaaaa,",
      "AB prppapaaaa"
    ],
    "Location": "Head, retrovesicular ganglion",
    "Description": "SAB neurons send their processes anteriorly within the sublateral cords in the head.The processes leave the ventral cord via the amphid commissures to enter the sublateral cords on each side. SABV processes cross over to the opposite side before entering the amphid commissures (Durbin, 1987)",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Loer, 2010; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "INX-8",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": ""
  },
  "SDQ": {
    "Type": "Interneuron, sensory neuron (minor oxygen-sensory)",
    "In MoW": "SDQ",
    "Male Wiring Project": "SDQL, SDQR",
    "In Wormbase": "SDQ, SDQL, SDQR",
    "Lineage": "QL.pap, QR.pap",
    "Location": "SDQL in the anterior body, SDQR in the posterior body",
    "Description": "Postembryonic neurons, born in mid L1 stage",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Loer, 2010; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "INX-7",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "Soluble guanylate cyclase (sGC, e.g. GCY-35 and GCY-36)-expressing oxygen-sensing neurons (URX, AQR, PQR, SDQ, BDU, ALN, and PLN) mediate the avoidance of high O2 levels (Zimmer et al, 2009). URX appears to be the most important member of this group, since its activity is uniquely important for aggregation (Coates and de Bono, 2002), while for aerotactic behavior in an O2 gradient, URX is redundant with other sGC-expressing neurons (Chang et al., 2006)."
  },
  "SIA": {
    "Type": "Interneuron, (sublateral) motor neuron",
    "In MoW": "SIA",
    "Male Wiring Project": "SIADL, SIADR, SIAVL, SIAVR",
    "In Wormbase": [
      "SIA, SIADL, SIADR, SIAVL, SIAVR",
      "Lineage: AB plpapaapa, AB prpapaapa,",
      "AB plpapappa, AB prpapappa"
    ],
    "Location": "Ventral ganglion of the head",
    "Description": "SIA neurons extend their processes anteriorly into the nerve ring. These processes then exit the nerve ring posteriorly within the ventral or dorsal sublateral cords",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "PDF-1; pigment dispensing factor homolog (in SIAV)",
      "(Barrios et al, 2012; Loer, 2010; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "In wild type animals the NR is positioned around the center of the isthmus of the pharynx. CWN-2, the C. elegans Wnt5 homolog, and SIA and SIB neurons play an essential role in placement of the NR correctly in this position. CWN-2 is required at the time of nerve ring formation and functions through the Wnt receptor CAM-1. CWN-2 is a ligand for CAM-1 (Ror receptor) and CAM-1 expression in SIA and SIB neurons facilitates this function. When this pathway is perturbed the NR is displaced towards the anterior (Kennerdell et al., 2009)"
  },
  "SIB": {
    "Type": "Interneuron, (sublateral) motor neuron",
    "In MoW": "SIB",
    "Male Wiring Project": "SIBDL, SIBDR, SIBVL, SIBVR",
    "In Wormbase": "SIB, SIBDL, SIBDR, SIBVL, SIBVR",
    "Lineage": [
      "AB plppaaaaa, AB prppaaaaa,",
      "AB plpapaapp, AB prpapaapp"
    ],
    "Location": "SIBV are in the ventral ganglion, while SIBD are in the lateral ganglia of the head",
    "Description": "SIB neurons extend their processes anteriorly into the nerve ring. These processes then exit the nerve ring posteriorly within the ventral or dorsal sublateral cords",
    "Neurotransmitter/Neuropeptide": [
      "Acetylcholine",
      "(Although earlier reports suggested SIB might be glutamatergic, more recent studies showed it is not)",
      "(Serrano-Saiz et al., 2013; Ohnishi et al., 2011;",
      "Loer, 2010; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "INX-9",
      "INX-12",
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "In wild type animals the NR is positioned around the center of the isthmus of the pharynx. CWN-2, the C. elegans Wnt5 homolog, and SIA and SIB neurons play an essential role in placement of the NR correctly in this position. CWN-2 is required at the time of nerve ring formation and functions through the Wnt receptor CAM-1. CWN-2 is a ligand for CAM-1 (Ror receptor) and CAM-1 expression in SIA and SIB neurons facilitates this function. When this pathway is perturbed the NR is displaced towards the anterior (Kennerdell et al., 2009)"
  },
  "SMB": {
    "Type": "Motor neuron",
    "In MoW": "SMB",
    "Male Wiring Project": "SMBDL, SMBDR, SMBVL, SMBVR",
    "In Wormbase": "SMB, SMBDL, SMBDR, SMBVL, SMBVR",
    "Lineage": [
      "AB alpapapapp, AB arappapapp,",
      "AB alpapappp, AB arappappp"
    ],
    "Location": "Head",
    "Description": "SMB motor neurons innervate muscles in the head via NMJs in the nerve ring and also send processes posteriorly down the sublateral cords.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Loer, 2010; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "Functions in locomotion: After animals are removed from bacterial food, they initiate a local search behavior consisting of reversals and deep omega-shaped turns. This is followed by dispersal ~30 min later as reversal and turns are suppressed. Local search behavior is triggered by AWC olfactory neurons, ASK gustatory neurons, and AIB interneurons while dispersal is promoted by ASI gustatory neurons and AIY interneurons (Gray et al., 2005). Downstream of AIB and AIY, motor neurons define specific aspects of reversal and turn frequency, amplitude, and directionality. SMD motor neurons define the steep amplitude of omega turns, RIV motor neurons specify the ventral bias of turns that follow a reversal, and SMB motor neurons set the amplitude of sinusoidal movement."
  },
  "SMD": {
    "Type": "Motor neuron",
    "In MoW": "SMD",
    "Male Wiring Project": "SMDDL, SMDDR, SMDVL, SMDVR",
    "In Wormbase": "SMD, SMDDL, SMDDR, SMDVL, SMDVR",
    "Lineage": [
      "AB plpapaaaa, AB prpapaaaa,",
      "AB alppappaa, AB arappppaa"
    ],
    "Location": "The cell bodies of SMDV are located subdorsally in the head, posterior and close to the neuropile of the nerve ring.The cell bodies of SMDD are in the ventral ganglion",
    "Description": "These motor neurons innervate muscles in the head via NMJs in the nerve ring and also send processes posteriorly down the sublateral cords.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Loer, 2010; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "Functions in locomotion: After animals are removed from bacterial food, they initiate a local search behavior consisting of reversals and deep omega-shaped turns. This is followed by dispersal ~30 min later as reversal and turns are suppressed. Local search behavior is triggered by AWC olfactory neurons, ASK gustatory neurons, and AIB interneurons while dispersal is promoted by ASI gustatory neurons and AIY interneurons (Gray et al., 2005). Downstream of AIB and AIY, motor neurons define specific aspects of reversal and turn frequency, amplitude, and directionality. SMD motor neurons define the steep amplitude of omega turns, RIV motor neurons specify the ventral bias of turns that follow a reversal, and SMB motor neurons set the amplitude of sinusoidal movement."
  },
  "URA": {
    "Type": "Motor neuron, putative sensory neuron",
    "In MoW": "URA",
    "Male Wiring Project": "URADL, URADR, URAVL, URAVR",
    "In Wormbase": "URA, URADL, URADR, URAVL, URAVR",
    "Lineage": [
      "AB plaaaaaaa, AB arpapaaaa,",
      "AB plpaaapaa, AB prpaaapaa"
    ],
    "Location": "Head",
    "Description": "Dendritic processes of URA neurons terminate in the body cavity and may have sensory function. As motor neurons, URAs innervate muscles in the head via NMJs in the nerve ring. The dorsal URA neurons are sister cells of the dorsal CEM neurons",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Loer, 2010; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": ""
  },
  "URB": {
    "Type": "Interneuron",
    "In MoW": "URB",
    "Male Wiring Project": "URBL, URBR",
    "In Wormbase": "URB, URBL, URBR",
    "Lineage": "AB plaapaapa, AB praapaapa",
    "Location": "Head",
    "Description": "Cell bodies of URB neurons are situated lateral-anteriorly to the nerve ring. Their processes run anteriorly within the lateral process bundles.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Loer, 2010; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": ""
  },
  "URX": {
    "Type": "Sensory neuron (oxygen- and minor CO2 -sensory), also ring interneuron",
    "In MoW": "URX",
    "Male Wiring Project": "URXL, URXR",
    "In Wormbase": "URX, URXL, URXR",
    "Lineage": "AB plaaaaappp, AB arpapaappp",
    "Location": "Head",
    "Description": "Nonciliated dendritic endings in nose, associated with CEPD in embryo. These dendrites terminate in flat, membranous and branched processes around the ILso endings (Doroquez et al., 2014). During embryonic development, unlike retrograde extension of the amphid dendrites, URX dendrite likely extends from a stationary cell body, and OL glia might be the adhesive guide along which this extension of URX dendrite occurs (McLachlan & Heiman, 2013). Like AQR and PQR, URX are directly exposed to the pseudocoelomic fluid and are proposed to monitor the contents of this fluid.",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "FLP-8; FMRFamide-like peptide",
      "FLP-10; FMRFamide-like peptide",
      "FLP-11; FMRFamide-like peptide",
      "FLP-19; FMRFamide-like peptide",
      "(Pereira et al., 2015;Li and Kim, 2008)"
    ],
    "Innexin expression": "",
    "Receptor expression": [
      "GCY-1; transmembrane receptor guanylate cyclase",
      "GCY-25; transmembrane receptor guanylate cyclase",
      "GCY-32; soluble guanylate cyclase",
      "GCY-34; soluble guanylate cyclase",
      "GCY-35; soluble guanylate cyclase, binds molecular oxygen and mediates oxygen sensation. Heterodimerizes with GCY-36",
      "GCY-36"
    ],
    "Function": [
      "Functions in aerotaxis: When placed in an O2 gradient, C. elegans shows a strong behavioral preference for ~5–10% (intermediate) O2 levels and avoids both hypoxia (<7%) and hyperoxia (21%). Animals navigate the O2 gradients by O2-induced changes in locomotion speed, reversal and turning behavior (Cheung et al., 2005; Gray et al., 2004). This preference for intermediate O2 levels (Gray et al., 2004), may work to allow oxidative metabolism but avoid oxidative stress (Lee and Atkinson, 1977). The intermediate O2 preference also promotes aggregation behavior, possibly since aggregating C. elegans locally deplete O2 to preferred levels (Gray et al., 2004; Rogers et al., 2006). The rise in O2 levels detected by animals leaving a group induces reversal (backing) and turning. Conversely, the fall in O2 encountered when entering a group suppresses reversal, turning, and rapid locomotion, allowing the animal to stay with the group. Soluble guanylate cyclase (sGC)-expressing, oxygen-sensing neurons (URX, BAG, AQR, PQR, SDQ, BDU, ALN, and PLN) mediate the responses to ambient O2 levels (Zimmer et al, 2009). For aggregation, URX appears to be the most important member of this group (Coates and de Bono, 2002), while for aerotactic behavior in an O2 gradient, URX is redundant with other sGC-expressing neurons (Chang et al., 2006). O2 sensation mainly requires the opposing actions of BAG and URX sensory neurons; in wild type animals with high NPR-1 function, BAG neurons sense drops in O2 concentrations, while URX neurons sense elevations. The interaction of these neurons results in locomotion responses allowing the worm to find and settle at places of preferred O2 concentrations. The O2-sensing abilities of BAG and URX neurons are attributed to specific O2-binding sGCs within those neuron classes (GCY-31 and GCY-33 in BAG neurons, and GCY-35 and GCY-36 in URX neurons) (Skora and Zimmer, 2013; Zimmer et al, 2009).",
      "The locations of URX in the head and PQR in the tail facilitate high O2 avoidance by the animal accelerating forward without changing direction of movement when its tail/PQR encounters high O2 and by reversal and turning when its head/URX encounters high O2 (Busch et al., 2012). Two post-synaptic targets of URX, AUA and RMG, seem to be involved in this O2-induced behavioral response.",
      "The strength of the O2 response is regulated by food, genotype, and an animal’s prior O2 exposure. The lab standard wild-type C. elegans strain (N2) with high activity of the neuropeptide receptor NPR-1 (215V) is indifferent to high O2 when food is present, whereas C. elegans isolates with low activity of NPR-1 (215F) avoid high O2 in the presence of food, and therefore, aggregate (Gray et al., 2004; Rogers et al., 2006). Since all strains avoid high O2 when food is absent, NPR-1 may be an internal food sensor important for food-related regulation of aggregation (i.e., regulation of social behavior on food) (Chang et al., 2006). Also other studies indicate that animals that carry the npr-1 (215F) allele or that lack npr-1 function tend to dwell (slow down) in low ambient O2 and roam (disperse) in high ambient O2. In this model, in animals with low NPR-1 activity, drops in O2 lead to increased activity of a GCY-35/36 heterodimeric soluble guanylate cyclase. Rising cGMP, in turn, opens the TAX-2/TAX-4 cGMP-gated ion channel in AQR, PQR and URX leading to their depolarization and when the food is present, strong suppression of roaming behavior (Cheung et al., 2005).",
      "Cultivation conditions also regulate O2 preference: animals cultivated in hypoxia migrate to lower O2 levels, and avoid high O2 regardless of food or NPR-1 genotype (Cheung et al., 2005; Chang and Bargmann, 2008). The sensory neurons ASH, ADL, and ADF also promote avoidance of high O2 levels (through function of TRP-related channel subunits OCR-2 and OSM-9 and the transmembrane protein ODR-4 in nociceptive ASH and ADL, and serotonin production by ADF), but these cells are not needed after animals are cultivated in hypoxia (Chang et al., 2006; Chang and Bargmann; 2008; Rogers et al., 2006).",
      "AQR, PQR and URX are weak CO2-sensors and contribute to CO2 avoidance (main CO2 sensors are AFD, BAG and ASE)(Bretscher et al., 2011).",
      "Lifespan regulation; ablation of low-O2-sensing BAG neurons increases lifespan, while ablation of high-O2-sensing URX neurons decreases lifespan. BAG and URX neurons counterbalance each other for control of lifespan via functions of different sCGs. Also, their life-span modulating effects are independent of canonical life-span modulatory pathways, including DAF-2/DAF-16, DAF-12, germline signaling, sensory perception pathways or dietary restriction (Liu and Cai; 2013)",
      "AQR, PQR and URX suppress innate immunity via NPR-1, which regulates both PMK-1-dependent and PMK-1-independent immune responses (Styer et al., 2008). Since URX, AQR, PQR are exposed to pseudocoelomic fluid, they are hypothesized to communicate neuroendocrine signals to nonneural tissues involved in innate immunity defense responses."
    ]
  },
  "URY": {
    "Type": "Sensory neuron",
    "In MoW": "URY",
    "Male Wiring Project": "URYDL, URYDR, URYVL, URYVR",
    "In Wormbase": "URY, URYDL, URYDR, URYVL, URYVR",
    "Lineage": [
      "AB alapapapp, AB alapppapp,",
      "AB plpaaappp, AB prpaaappp"
    ],
    "Location": "Head",
    "Description": "Exposed to the internal environment of the animal. Cell bodies are situated anterior to the nerve ring. Processes travel in subdorsal and subventral labial process bundles. URY dendrites terminate in variable membranous nonciliated, branched processes and they may extend across the midline boundary into the adjacent quadrant possibly to interact with other sensilla (Doroquez et al., 2014). URY endings are apposed to ILshD and OLQshD processes.",
    "Neurotransmitter/ Neuropeptide": [
      "Glutamate",
      "(Saiz et al., 2013)"
    ],
    "Innexin expression": "None yet reported, although described to have gap junctions in adult animals (MoW)",
    "Receptor expression": [
      "PDFR-1; pigment dispersing factor receptor ortholog",
      "SER-1; (inconsistently) serotonin receptor",
      "(Barrios et al, 2012; Dernovici et al, 2007; Carnell et al, 2005)"
    ],
    "Function": [
      "Part of the neuronal circuit that functions in mate-searching behavior of males(Barrios et al, 2012)",
      "May function in pathogen sensing (Pradel et al, 2007)"
    ]
  },
  "VA": {
    "Type": "Motor neuron",
    "In MoW": "VAn",
    "Male Wiring Project": "VAn, VA08, VA09, VA10, VA11, VA12",
    "In Wormbase": [
      "VA1, VA2, VA3, VA4, VA5,",
      "VA6, VA7, VA8, VA9, VA10, VA11, VA12"
    ],
    "Lineage": [
      "W.pa, P2.aaaa, P3.aaaa, P4.aaaa,",
      "P5.aaaa, P6.aaaa, P7.aaaa, P8.aaaa, P9.aaaa,",
      "P10.aaaa, P11.aaaa, P12.aaaa"
    ],
    "Location": "Body (ventral nerve cord)",
    "Description": "Postembryonically born. Ventral cord motor neurons. The connectivity of VA1, VA3 and VA5 differ slightly from the remaining VAs (Haspel & Donovan 2011)",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Loer, 2010; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "INX-3",
      "INX-12",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": "Locomotion"
  },
  "VB": {
    "Type": "Motor neuron, sensory neuron (proprioceptive)",
    "In MoW": "VBn",
    "Male Wiring Project": "VBn, VB05, VB06, VB07, VB08, VB09, VB10, VB11",
    "In Wormbase": [
      "VB1, VB2, VB3, VB4, VB5,",
      "VB6, VB7, VB8, VB9, VB10, VB11"
    ],
    "Lineage": [
      "P1.aaap, W.aap, P2.aaap, P3.aaap,",
      "P4.aaap, P5.aaap, P6.aaap, P7.aaap, P8.aaap,",
      "P9.aaap, P10.aaap, P11.aaap"
    ],
    "Location": "Body (ventral nerve cord)",
    "Description": "Postembryonically born. Ventral cord motor neurons. The connectivity of VB1, VB4 and VB7 differ slightly from the remaining VBs (Haspel & Donovan 2011)",
    "Neurotransmitter/ Neuropeptide": [
      "Acetylcholine",
      "(Loer, 2010; Duerr et al, 2008; Rand and Nonet, 1997-Appendix 2)"
    ],
    "Innexin expression": [
      "INX-3",
      "INX-12",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "",
    "Function": [
      "Locomotion",
      "Proprioception involving propagation of rhythmic activities along the body during forward locomotion; ventral and dorsal bending of an anterior body region directly activates VB and DB motor neurons (Wen et al., 2012). Gap junctions between neighbors as well as overlapping segments of their processes then propagate the bending signal from anterior to posterior. The mechanosensitive-proprioceptive receptors are likely localized near the anterior of the processes"
    ]
  },
  "VC": {
    "Type": "Motor neuron",
    "In MoW": "VCn",
    "In Wormbase": [
      "VC1, VC2, VC3, VC4, VC5,",
      "VC6"
    ],
    "Lineage": [
      "P3.aap, P4.aap, P5.aap, P6.aap,",
      "P7.aap, P8.aap"
    ],
    "Location": "Body (ventral nerve cord)",
    "Description": [
      "Postembryonically born. Hermaphrodite specific ventral cord motor neurons. The neurons are born in L1, and begin to send out processes in late L3. These processes branch in the region of the vulva during L4. VC4 and VC5 have short ventral cord processes, but send branched processes dorsally along the vulval hypodermis on each side of the vulval slit. VC1-3 and VC6 send less branched processes to vulval regions but have longer processes in the ventral cord (in R side fascicle). The dorsal branches of VC axons innervate vm2 vulval muscles. These neurons, except VC4 and VC5, also innervate ventral body muscles.",
      "The generation of VC neurons from the 6 Pn.a neuroblast lineages (P3.a-P8.a) is dependent on a HOM-C gene, lin-39. In the absence of lin-39, these neurons undergo programmed cell death (Ruvkun, 1997). The formation of the complex arborizations made by VC neuron branches at the level of the vulva depend on the presence of the vulval cells and the somatic gonad but not on the interactions of VC's with target muscles or HSN"
    ],
    "Neurotransmitter/ Neuropeptide": "",
    "Innexin expression": [
      "UNC-7",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": [
      "ACR-14; expressed in VC54 and VC5; nicotinic AChR non-alpha subunit",
      "GLR-5 glutamate receptor subunit",
      "(Fox et al., 2005; Brockie et al., 2001)"
    ],
    "Function": "Acetylcholine released from the VC neurons inhibits egg-laying behavior. This may be caused by inhibition of presynaptic neurotransmitter release by HSN neurons following the activation of the G-protein- coupled acetylcholine receptor 2 (GAR-2) signaling (Bany et al., 2003). VC4 and VC5 can also induce the active phase of egg-laying by releasing serotonin (Waggoner et al., 1998)"
  },
  "VD": {
    "Type": "Motor neuron",
    "In MoW": "VDn",
    "Male Wiring Project": "VDn, VD08, VD09, VD10, VD11, VD12, VD13",
    "In Wormbase": [
      "VD1, VD2, VD3, VD4, VD5,",
      "VD6, VD7, VD8, VD9, VD10, VD11, VD12, VD13"
    ],
    "Lineage": [
      "W.pp, P1.app, P2.app, P3.app,",
      "P4.app, P5.app, P6.app, P7.app, P8.app,",
      "P9.app, P10.app, P11.app, P12.app"
    ],
    "Location": "Body (ventral nerve cord)",
    "Description": "Postembryonically born. GABAergic inhibitory ventral cord motor neurons.",
    "Neurotransmitter/ Neuropeptide": "GABA",
    "Innexin expression": [
      "INX-3",
      "INX-14",
      "UNC-9",
      "(Altun et al., 2009)"
    ],
    "Receptor expression": "NPR-1; receptor for flp-18- and flp-21-encoded peptides",
    "Function": "Sinusoidal body movement-locomotion."
  }
}